{"ÜberSoldier": {"description": "ÜberSoldier is a World War II-based first-person shooter, developed by Burut Creative Team and released in 2006. The game's original Russian title is Восточный Фронт (translated: Eastern Front).", "genre": "First-person shooter", "date_release": "2006-03-29"}, "Undertale": {"composer": "Toby Fox", "description": "Undertale is a role-playing video game created by American indie developer Toby Fox. The player controls a child who has fallen into the Underground: a large, secluded region under the surface of the Earth, separated by a magic barrier. The player meets various monsters during the journey back to the surface. Some monsters might engage the player in a fight. The combat system involves the player navigating through mini-bullet hell attacks by the opponent. They can opt to pacify or subdue monsters in order to spare them instead of killing them. These choices affect the game, with the dialogue, characters, and story changing based on outcomes.\nFox developed the entirety of the game independently, including writing and composing the score. Additional art was created by other artists, primarily Temmie Chang. The game took inspiration from several sources. These include the Mother and Mario & Luigi role-playing series, the bullet hell shooter series Touhou Project, and the British comedy show Mr. Bean. Originally, Undertale was meant to be two hours in length and was set to be released in mid-2014. However, development was delayed over the next three years.\nThe game was released for Microsoft Windows and OS X in September 2015. It was also ported to Linux in July 2016, PlayStation 4 and PlayStation Vita in August 2017 and the Nintendo Switch in September 2018. The game was acclaimed for its thematic material, intuitive combat system, musical score, originality, story, dialogue, and characters. The game sold over one million copies and was nominated for multiple accolades and awards. Several gaming publications and conventions listed Undertale as Game of the Year. The first chapter of a related game, Deltarune, was released on October 31, 2018.", "developer": ["Toby Fox"], "genre": "RPG", "date_release": "2015-09-15"}, "Universe Sandbox": {"description": "Universe Sandbox is an interactive space gravity simulator video game and educational software. Using Universe Sandbox, users can see the effects of gravity on objects in the universe and run scale simulations of the Solar System, various galaxies or other simulations, while at the same time interacting and maintaining control over gravity, time, and other objects in the universe, such as moons, planets, asteroids, comets, and black holes. The original Universe Sandbox was only available for Windows-based PCs, but an updated version, Universe Sandbox ², was released for Windows, macOS, and Linux in 2017.\nUniverse Sandbox was designed primarily by Dan Dixon, who worked on the educational project for over fifteen years before launching the full version in May 2008. Dixon had worked full-time on the project since 2010, founding the company Giant Army the following year. Since then, he has hired eight additional designers for the company.\n\n", "genre": "Casual", "date_release": "2011-04-29"}, "Unreal": {"producer": null, "composer": null, "description": null, "developer": ["Epic MegaGames", "Digital Extremes"], "genre": "First-person shooter", "date_release": "1998-05-22"}, "Unreal Tournament": {"composer": null, "description": "Unreal Tournament is a first-person shooter video game developed by Epic Games and Digital Extremes. The second installment in the Unreal series, it was first published by GT Interactive in 1999 for Microsoft Windows, and later released on the PlayStation 2 and Dreamcast by Infogrames in 2000 and 2001, respectively. Players compete in a series of matches of various types, with the general aim of out-killing opponents. The PC version supports multiplayer online or over a local area network. Free expansion packs were released, some of which were bundled with a 2000 re-release: Unreal Tournament: Game of the Year Edition.\nPowered by the Unreal Engine and initially developed as an expansion for Unreal, Unreal Tournament received critical acclaim, with reviewers praising the graphics, level design and gameplay, although the console ports were noted for having limitations. The design of the game shifted the series' focus to competitive multiplayer action with the releases of sequels Unreal Tournament 2003 in 2002, Unreal Tournament 2004 in 2004, and Unreal Tournament 3 in 2007.", "developer": ["Epic Games", "Digital Extremes"], "genre": "First-person shooter", "date_release": "1999-11-30"}, "Unreal Tournament 2003": {"composer": null, "description": "Unreal Tournament 2003 is a first-person shooter video game developed by Epic Games and Digital Extremes, and published by Infogrames under the Atari brand name. It is designed mainly for multiplayer gaming. The game is part of the Unreal series of games, and is a sequel to Unreal Tournament (UT99). The game set a record for the number of downloads (1.2 million) when the demo was released, which is a reflection of the popularity of the original UT.  In addition, the game engine has been widely licensed for games such as the Tom Clancy's Rainbow Six series, Splinter Cell, and America's Army. Its sequel/expansion, Unreal Tournament 2004, was released on March 16, 2004.", "developer": ["Epic Games", "Digital Extremes"], "genre": "First-person shooter", "date_release": "2002-10-01"}, "Unreal Tournament 2004": {"producer": "Jeff Morris", "composer": null, "description": "Unreal Tournament 2004 is a first-person shooter video game developed by Epic Games and Digital Extremes. It is part of the Unreal series, specifically the subseries started by the original Unreal Tournament. It is the sequel to Unreal Tournament 2003.\nUnreal Tournament 2004 features most of the content of its predecessor. Among significant changes to gameplay mechanics and visual presentation, one of the major additions introduced by Unreal Tournament 2004 is the inclusion of vehicles and the Onslaught game type, allowing for large-scale battles.Its sequel, Unreal Tournament 3, was released on November 19, 2007.", "developer": ["Epic Games", "Digital Extremes", "Psyonix", "Streamline Studios"], "genre": "First-person shooter", "date_release": "2004-03-16"}, "Unreal Tournament 3": {"producer": null, "composer": null, "description": "Unreal Tournament 3 (UT3) is a first-person shooter and online multiplayer video game developed by Epic Games and published by Midway Games in the Unreal series. It was released for Microsoft Windows on November 19, 2007, for the PlayStation 3 on December 11, 2007, and for the Xbox 360 on July 3, 2008. Unreal Tournament 3 is the fourth game in the Unreal Tournament series and the eighth Unreal game.\nSimilar to its predecessors, the game is primarily an online multiplayer title offering several game modes. There are eight modes, including Deathmatch, Capture the Flag, as well as modes like Duel, Warfare, Betrayal and Greed. In vehicle maps, the player will be equipped with a hover board, which allows players to quickly traverse large maps and grapple onto other teammates' vehicles. Unlike its predecessors, Unreal Tournament 3's single-player campaign does not follow a plot based around the Tournament Grand Championship, and it centers on a Necris attack occurs on a colony on an unknown planet, releasing armed Kralls, a warlike race of aliens, on the humans.\nOriginally announced as Unreal Tournament 2007 in 2005, and set to be released in 2006, the game was delayed to 2007. It was renamed as Unreal Tournament 3 as the team considered it the third generation of Unreal game since it utilizes Unreal Engine 3. OS X and Linux ports were planned but they were eventually cancelled. The game received positive reviews from critics, and sold more than 1 million copies worldwide.", "developer": ["Epic Games"], "genre": "First-person shooter", "date_release": "2007-11-19"}, "Unreal Tournament 4": {"composer": null, "description": "Unreal Tournament is a first-person shooter video game developed by Epic Games. It was to be the ninth installment in the Unreal franchise, and the first main entry in the series since Unreal Tournament 3 (2007). The game utilizes Epic's Unreal Engine 4 and was to be released for free on Microsoft Windows, OS X, and Linux.Unreal Tournament's development is crowdsourced and open to contribution from anyone. Epic Games has been using forums for discussions and Twitch livestreams for regular updates. The source code of the game is published on GitHub.Since July 2017, there have been no new updates. The bulk of the developer team has since transitioned to develop and maintain Fortnite Battle Royale. Development of Unreal Tournament was confirmed to be halted indefinitely in December 2018, though the game will remain available in its current state to play.", "developer": ["Epic Games"], "genre": "First-person shooter", "date_release": null}, "Unturned": {"description": "Unturned is a free-to-play survival game developed by Smartly Dressed Games, a one-man studio consisting of Canadian game designer Nelson Sexton. Following a three-year long early access beta phase, it was released for Microsoft Windows, macOS, and Linux on July 7, 2017.", "developer": ["Nelson Sexton"], "genre": "Open-world", "date_release": "2017-07-07"}}