{"Papers, Please": {"description": "Papers, Please is a puzzle simulation video game created by indie game developer Lucas Pope, developed and published through his production company, 3909 LLC. The game was released on August 8, 2013 for Microsoft Windows and OS X, for Linux on February 12, 2014 and for iOS on December 12, 2014. A port for the PlayStation Vita was announced in August 2014, and was then released on December 12, 2017.In Papers, Please, the player take on the role of a border-crossing immigration officer in the fictional dystopian Eastern Bloc-like country of Arstotzka, which has been and continues to be at political hostilities with its neighboring countries. The game takes place at the border of East and West Grestin, a fictional parallel East/West Berlin. As the immigration officer, the player must review each immigrant and return citizen's passports and other supporting paperwork against an ever-growing list of rules using a number of tools and guides, allowing in only those with the proper paperwork while rejecting those without all proper forms, and at times detaining those with falsified information. The player is rewarded in their daily salary for how many people they have processed correctly in that day, while also being fined for making mistakes; the salary is used to help provide shelter, food and heat for the player's in-game family. In some cases, the player will be presented with moral decisions, such as approving entry of a pleading spouse of a citizen despite the lack of proper paperwork, knowing this will affect their salary. The game deals with the issues of keeping up with immigration policy in an ever-changing political environment. In addition to a story mode which follows several scripted events that occur within Arstotzka, the game includes an endless mode that challenges the player to process as many immigrants as possible.\nPope came upon the idea of passport-checking as a gameplay mechanic after witnessing the behavior of immigration officers through his own international travels. He coupled this with a narrative inspired by spy thriller films, having the immigration officer be one to challenge spies trying to move in or out of countries with fake travel documents. He was able to build on principles and concepts from some of his earlier games, including his The Republia Times from which he also borrowed the setting of Arstotzka. Pope publicly shared details of the game's development from its onset, leading to high interest in the title and encouraging him to put more effort into it; though he initially planned to only spend a few weeks, Pope ended up spending about nine months on the game.\nPapers, Please was positively received on its release, and it has come to be seen as an example of an empathy game and a demonstration of video games as an art form. The game was recognized with various awards and nominations from the Independent Games Festival, Game Developers Choice Awards, and BAFTA Video Games Awards, and was named by Wired and The New Yorker as one of the top games of 2013. Pope reported that by 2016, more than 1.8 million copies of the title had been sold.", "genre": "Puzzle", "date_release": "2013-08-08"}, "ParaWorld": {"description": "ParaWorld is a real-time strategy PC game released on September 25, 2006.  It was developed by the German company SEK (Spieleentwicklungskombinat), based in Berlin. The game features more than 50 prehistoric animals, especially dinosaurs and Pleistocene mammals. The game uses TAGES, and therefore installs a driver on the system for copy protection.", "genre": "Real-time strategy", "date_release": "2006-09-15"}, "Path of Exile": {"composer": null, "description": "Path of Exile is a free-to-play action role-playing video game developed and published by Grinding Gear Games. Following an open beta phase, the game was released in October 2013. A version for Xbox One was released in August 2017, and a PlayStation 4 version was released on March 26, 2019.", "developer": ["Grinding Gear Games"], "genre": "Action RPG", "date_release": "2013-10-23"}, "Payday: The Heist": {"composer": "Simon Viklund", "description": "Payday: The Heist is a cooperative first-person shooter video game developed by Overkill Software and published by Sony Online Entertainment. It was released on 18 October 2011, for PlayStation 3 in North America and 2 November 2011, in Europe. It was released on 20 October 2011, for Microsoft Windows via Steam. The game runs on the Diesel game engine. It contains seven different missions (including the free No Mercy downloadable content (DLC) released on 25 July 2012), with each mission containing random elements which alter the gameplay in subtle ways with the aim of enhancing replayability. On 7 August 2012, the Wolf Pack DLC was released on PlayStation 3 and PC. This DLC adds two heists, additional weapons, increased level cap, and a player upgrade tree.", "developer": ["Overkill Software"], "genre": "First-person shooter", "date_release": "2011-10-18"}, "Payday 2": {"producer": "Almir Listo", "composer": null, "description": "Payday 2 is a cooperative first-person shooter video game developed by Overkill Software and published by 505 Games. The game is a sequel to 2011's Payday: The Heist. It was released in August 2013 for Microsoft Windows, PlayStation 3 and Xbox 360. An improved version of the game, subtitled Crimewave Edition, was released for PlayStation 4 and Xbox One in June 2015. A version for the Nintendo Switch was released in February 2018.Two years after the events of the previous game, a new gang comes to the Washington, D.C. area to perform another heisting spree. The player takes control of one of the gang's twenty one members and can perform heists alone, or with up to three teammates. The player can participate in a variety of heists, including but not limited to robberies of banks, shops and armored cars, and producing and distributing narcotics. The game differs on the previous by allowing much more customization of the player (aesthetically and gameplay-wise), somewhat improved graphical interface and experience, more variety and playability in levels, and has reworked stealth mechanics.\nAn accompanying web series was produced to promote the game. The game was profitable from pre-orders alone and received positive reviews. Payday 2: Crimewave Edition which offers improved graphics, new content and all previous DLCs, was released for PlayStation 4 and Xbox One in June 2015.", "developer": ["Overkill Software"], "genre": "First-person shooter", "date_release": "2013-08-13"}, "Penumbra: Black Plague": {"composer": "Mikko Tarmia", "description": "Penumbra: Black Plague is the second installment of the Penumbra series of episodic video games developed by Frictional Games. The story continues from the previous episode, Penumbra: Overture, showing the protagonist Philip moving away from the abandoned mine setting of the original to explore an underground research base. Black Plague was released in February 2008 to generally favourable reviews from critics. Although originally intended to conclude the series, a further expansion called Penumbra: Requiem was released later that year.", "developer": ["Frictional Games"], "genre": "Survival horror", "date_release": "2008-02-12"}, "Penumbra: Overture": {"composer": "Mikko Tarmia", "description": "Penumbra: Overture is the first in a series of episodic survival horror games  developed by Frictional Games. It was originally intended as the first episode of a trilogy. With the announcement of the second episode, Penumbra: Black Plague, it was stated that the second game would be the final chapter. However, an expansion has been released since then: Penumbra: Requiem, technically giving the series a third chapter.A fourth chapter - Penumbra: Necrologue - was released in 2014 as a total conversion modification for Amnesia: The Dark Descent.", "developer": ["Frictional Games"], "genre": "Survival horror", "date_release": "2007-03-30"}, "Penumbra: Requiem": {"composer": "Mikko Tarmia", "description": "Penumbra: Requiem is an expansion pack to the game Penumbra: Black Plague developed by Frictional Games.", "developer": ["Frictional Games"], "genre": "Survival horror", "date_release": "2008-08-27"}, "Pillars of Eternity": {"producer": "Brandon Adler", "composer": "Justin E. Bell", "description": "Pillars of Eternity is a role-playing video game developed by Obsidian Entertainment and published by Paradox Interactive. It was released for Microsoft Windows, OS X, and Linux on March 26, 2015. The game is a spiritual successor to the Baldur's Gate and Icewind Dale series, along with Planescape: Torment. Obsidian started a crowdfunding campaign on Kickstarter for it in September 2012. The campaign raised over US$4 million, which was the highest funded video game at the time. The game uses the Unity engine.\nThe game takes place in the fantasy world of Eora, mainly inside the nation of Dyrwood. The infants in the Dyrwood are plagued by a recent phenomenon in which they become \"hollowborn\" upon birth, meaning they are born with no soul. During the beginning of the game, the protagonist experiences an awakening of power due to a disastrous supernatural event, discovering they are a \"Watcher\": a person who can see past lives and interact with souls. The objective of the game is to find out what caused their awakening and how to solve the hollowborn problem.\nPillars of Eternity received critical acclaim upon its release; many critics praised the game for its world and immersive writing, along with the strategic combat, and also said that it is a worthy successor to the games it was inspired by. The game also won various awards and accolades, including best RPG of 2015. A two-part expansion pack, The White March was released in August 2015 and February 2016, respectively. A sequel, Pillars of Eternity II: Deadfire, was released in May 2018.", "developer": ["Obsidian Entertainment"], "genre": "Role-playing", "date_release": "2015-03-26"}, "Pixel Piracy": {"producer": "Alexander Poysky", "composer": "Kole Hiks", "description": "Pixel Piracy is an indie side-scrolling real-time strategy video game with roguelike elements, developed by Quadro Delta. In the game, players construct a pirate ship, hire and train a crew, and guide their crew toward notoriety as renowned pirates.", "developer": ["Quadro Delta"], "genre": "Action-adventure", "date_release": "2016-02-16"}, "Planetarian: The Reverie of a Little Planet": {"description": "Planetarian: The Reverie of a Little Planet (planetarian ～ちいさなほしのゆめ～, Planetarian: Chiisana Hoshi no Yume) is a Japanese post-apocalyptic visual novel developed by Key, a brand of VisualArt's whose previous works include Kanon and Air. It was released over the Internet on November 29, 2004 for Windows, and is rated for all ages. The game was later ported to the PlayStation 2 (PS2), PlayStation Portable and Nintendo Switch, as well as mobile devices. The story centers on a man who comes across a malfunctioning robot in a dead city. The man, known simply as \"the junker\", stays with this robot for a time and attempts to fix the projector of the planetarium where the story takes place.\nKey defines Planetarian as a \"kinetic novel\", since its gameplay offers no choices or alternate endings. Instead, the player proceeds through the story solely by reading. The story is written by Yūichi Suzumoto and character design is produced by Eeji Komatsu. The game's soundtrack was composed and arranged by Key's signature composers Magome Togoshi and Shinji Orito. A light novel of short stories set in the world of Planetarian was released in April 2006, and three audio dramas have also been produced. David Production produced a five-episode original net animation series and an anime film in 2016. Planetarian's story, artwork and music have been praised, and the PS2 version ranked first for console games in terms of satisfaction in 2007.", "developer": ["Key"], "genre": "Visual novel", "date_release": "2004-11-29"}, "Planetary Annihilation": {"producer": null, "composer": null, "description": "Planetary Annihilation is a real-time strategy PC game originally developed by Uber Entertainment, whose staff included several industry veterans who worked on Total Annihilation and Supreme Commander. A standalone expansion pack, Planetary Annihilation: TITANS, was released, which adds powerful Titan-class units.\nPlanetary Annihilation and TITANS are now developed and published by a new company, Planetary Annihilation Inc.", "developer": ["Uber Entertainment"], "genre": "RTS", "date_release": "2014-09-05"}, "PlanetSide": {"description": "PlanetSide was a massively-multiplayer online first-person-shooter video game published by Sony Online Entertainment and released on May 20, 2003.PlanetSide chronicles the efforts of three factions as they fight for territorial control over ten different continents on the planet Auraxis. Players take on the role of individual soldiers fighting for one of the three factions within the game, and can specialize in various fields such as combat vehicle crewman, infantry, invisible infiltrator or a variety of combat support roles such as combat medic or combat engineer. The game is played primarily in a first person perspective, with the option of third-person.\nUnlike most shooting games, in which small-scale matches take place in essentially an instanced map, PlanetSide battles can involve hundreds of players in a single fight. PlanetSide battles concern control over territory and strategic points, and can cause repercussions to all three factions. To date, PlanetSide remains one of the few MMOFPS games ever created. A sequel, PlanetSide 2, was released in November, 2012. On January 24, 2014 Sony Online Entertainment announced that the game was going to be free-to-play in April 2014. The game was officially launched as free to play on April 29, 2014, after several delays.  On July 1, 2016, at 4:00pm PT, Planetside servers went offline permanently.", "developer": ["Sony Online Entertainment"], "genre": "MMOFPS", "date_release": "2003-05-20"}, "PlanetSide 2": {"composer": null, "description": "PlanetSide 2 is a free-to-play massively multiplayer online first-person shooter developed and published by Sony Online Entertainment (now Daybreak Game Company), which released in November 2012. It is a sequel of PlanetSide, which originally released in 2003. PlanetSide 2 uses the Forgelight Engine, which is able to support thousands of players in continuous large scale conflict on a single map. As in the first PlanetSide, PlanetSide 2 chronicles the efforts of three factions as they fight for territorial control of the planet Auraxis. PlanetSide 2 was released for the PlayStation 4 in June 2015. PlanetSide 2 holds the Guinness World Record for the biggest first-person shooter battle, with over 1158 players being recorded in a single battle.", "developer": ["Sony Online Entertainment"], "genre": "MMOFPS", "date_release": "2012-11-12"}, "Playboy: The Mansion": {"producer": "Eric Marcoullier", "description": "The Playboy Mansion, also known as the Playboy Mansion West, is the former home of Playboy magazine founder Hugh Hefner, who lived there from 1974 until his death in 2017. Barbi Benton convinced Hefner to buy the home. Located in Holmby Hills, Los Angeles, California, near Beverly Hills, the mansion became famous during the 1970s through media reports of Hefner's lavish parties which were often attended by famous celebrities and socialites.Currently owned by Daren Metropoulos, the son of billionaire investor Dean Metropoulos, the mansion is also used for various corporate activities and serves as a location for television production, magazine photography, charitable events, and civic functions.", "developer": ["Cyberlore Studios"], "genre": "Business simulation game", "date_release": "2005-03-04"}, "PlayerUnknown's Battlegrounds": {"producer": "Chang-han Kim", "composer": "Tom Salta", "description": "PlayerUnknown's Battlegrounds (PUBG) is an online multiplayer battle royale game developed and published by PUBG Corporation, a subsidiary of South Korean video game company Bluehole. The game is based on previous mods that were created by Brendan \"PlayerUnknown\" Greene for other games, inspired by the 2000 Japanese film Battle Royale, and expanded into a standalone game under Greene's creative direction. In the game, up to one hundred players parachute onto an island and scavenge for weapons and equipment to kill others while avoiding getting killed themselves. The available safe area of the game's map decreases in size over time, directing surviving players into tighter areas to force encounters. The last player or team standing wins the round.\nBattlegrounds was first released for Microsoft Windows via Steam's early access beta program in March 2017, with a full release in December 2017. The game was also released by Microsoft Studios for the Xbox One via its Xbox Game Preview program that same month, and officially released in September 2018. A free-to-play mobile version for Android and iOS was released in 2018, in addition to a port for the PlayStation 4. Battlegrounds is one of the best-selling and most-played video games of all time, selling over fifty million copies worldwide by June 2018, with over 400 million players in total when including the mobile version.\nBattlegrounds received positive reviews from critics, who found that while the game had some technical flaws, it presented new types of gameplay that could be easily approached by players of any skill level and was highly replayable. The game was attributed to popularizing the battle royale genre, with a number of unofficial Chinese clones also being produced following its success. The game also received several Game of the Year nominations, among other accolades. PUBG Corporation has run several small tournaments and introduced in-game tools to help with broadcasting the game to spectators, as they wish for it to become a popular esport. The game has also been banned in some countries for allegedly being harmful and addictive to young players.", "genre": "Multiplayer online game", "date_release": "2017-12-12"}, "Pokémon TCG Online": {"description": "Pokémon TCG Online (PTCGO) is the digital version of the Pokémon Trading Card Game developed by American studio Dire Wolf Digital, and is available for Microsoft Windows, macOS, iOS and Android. It was originally released in April 2011 as Pokémon Trainer Challenge.", "genre": "Digital collectible card game", "date_release": "2011-03-24"}, "Pony Island": {"composer": "Jonah Senzel", "description": "Pony Island is a video game developed and published by Canadian indie developer Daniel Mullins. As a metafictional game, the game has the player interact with what appears to be an old arcade cabinet game called \"Pony Island\". The player soon discovers the game is corrupted by a demonic being which is trying to claim the player's soul for itself. The player is aided by the soul of a previous player who helps the player access Pony Island's internal programming to get around the traps left by Satan and save their soul.", "genre": "Indie", "date_release": "2016-01-04"}, "Pool of Radiance": {"composer": null, "description": "Pool of Radiance is a role-playing video game developed and published by Strategic Simulations, Inc (SSI) in 1988. It was the first adaptation of TSR's Advanced Dungeons & Dragons (AD&D) fantasy role-playing game for home computers, becoming the first episode in a four-part series of D&D computer adventure games. The other games in the \"Gold Box\" series used the game engine pioneered in Pool of Radiance, as did later D&D titles such as the Neverwinter Nights online game. Pool of Radiance takes place in the Forgotten Realms fantasy setting, with the action centered in and around the port city of Phlan.\nJust as in traditional D&D games, the player starts by building a party of up to six characters, deciding the race, sex, class, and ability scores for each. The player's party is enlisted to help the settled part of the city by clearing out the marauding inhabitants that have taken over the surroundings. The characters move on from one area to another, battling bands of enemies as they go and ultimately confronting the powerful leader of the evil forces. During play, the player characters gain experience points, which allow them to increase their capabilities. The game primarily uses a first-person perspective, with the screen divided into sections to display pertinent textual information. During combat sequences, the display switches to a top-down \"video game isometric\" view.Generally well received by the gaming press, Pool of Radiance won the Origins Award for \"Best Fantasy or Science Fiction Computer Game of 1988\". Some reviewers criticized the game's similarities to other contemporary games and its slowness in places, but praised the game's graphics and its role-playing adventure and combat aspects. Also well-regarded was the ability to export player characters from Pool of Radiance to subsequent SSI games in the series.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1988-01-01"}, "Pools of Darkness": {"composer": "David Govett", "description": "Pools of Darkness is a role-playing video game published by Strategic Simulations in 1991.  The cover art and introduction screen shows a female drow. It is the fourth (and final) entry in the Pool of Radiance series of Gold Box games, and the story is a continuation of the events after Secret of the Silver Blades. The novel loosely based on the game was released in 1992.  Like the previous games in the series, it is set in the Forgotten Realms, a campaign setting from Dungeons & Dragons.  Players must stop an invasion from an evil god, eventually traveling to other dimensions to confront his lieutenants.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1991-01-01"}, "Portal": {"composer": null, "description": null, "developer": ["Valve Corporation"], "genre": "Puzzle-platform game", "date_release": "2007-10-10"}, "Portal 2": {"producer": "Gabe Newell", "composer": "Mike Morasky", "description": "Portal 2 is a puzzle-platform game developed by Valve Corporation. It was released in April 2011 for Windows, OS X, Linux, PlayStation 3, and Xbox 360. The digital PC version is distributed online by Valve's Steam service, while all retail editions were distributed by Electronic Arts.\nLike the original Portal (2007), players solve puzzles by placing portals and teleporting between them. Portal 2 adds features including tractor beams, lasers, light bridges, and paint-like gels that alter player movement or allow portals to be placed on any surface. In the single-player campaign, players control Chell, who navigates the dilapidated Aperture Science Enrichment Center during its reconstruction by the supercomputer GLaDOS (Ellen McLain); new characters include robot Wheatley (Stephen Merchant) and Aperture founder Cave Johnson (J. K. Simmons). In the new cooperative mode, players solve puzzles together as robots Atlas and P-Body (both voiced by Dee Bradley Baker). Jonathan Coulton and the National produced songs for the game.\nValve announced Portal 2 in March 2010, and promoted it with alternate reality games including the Potato Sack, a collaboration with several independent game developers. After release, Valve released downloadable content and a simplified map editor to allow players to create and share levels.\nPortal 2 received acclaim for its gameplay, balanced learning curve, pacing, dark humor, writing, and acting. It has been described as one of the greatest video games of all time by numerous publications and critics.", "developer": ["Valve Corporation"], "genre": "Puzzle-platform game", "date_release": "2011-04-19"}, "Postal": {"producer": "Vince Desi", "composer": "Christian A. Salyer", "description": null, "developer": ["Running With Scissors"], "genre": "Top-down shooter", "date_release": "1997-11-14"}, "Postal 2": {"producer": [null, null], "description": "Postal 2 (stylized as POSTAL2) is a black comedy first-person shooter video game by Running With Scissors, and it is the sequel to the 1997 game Postal. Both are intentionally highly controversial due to high levels of violence and stereotyping. Unlike its predecessor, Postal 2 is played completely in first-person based on the Unreal Engine 2. Scenes of the game can be seen in the music video of The Black Eyed Peas single \"Where Is the Love?\"In 2004, New Zealand banned Postal 2 due to \"gross, abhorrent content\" and Australia banned the game a year later due to \"excessive abhorrent content\". On May 1, 2007, Malaysia banned the game outright due to \"very high impact violence & offensive depictions of cruelty\". The game was also banned in Germany and temporarily banned for sale in Sweden, however it was later legally made available worldwide through GOG.com in 2009 and Desura in 2012, and was successfully greenlit on Steam later that year.\nThe game received a mixed reception from critics upon its release in 2003, with some reviewers going so far as to give the game a score of zero, while others argued in favour of the game's concept and implementation. Regardless, the game was successful enough to receive several expansions and to be included in multiple compilations, and a film adaptation of the game and its predecessor was made in 2007. The Complete Edition, available through Steam, remains continually updated, with a new expansion pack titled Paradise Lost released on April 17, 2015.", "developer": ["Running With Scissors"], "genre": "First-person shooter", "date_release": "2003-04-13"}, "Postal III": {"description": "Postal III (stylized as PostaLIII) is a third-person shooter video game developed by TrashMasters Studios, co-developed by Running With Scissors and published by Akella. It is the third game in the Postal series, being the sequel to Postal 2, telling the story of the Postal Dude's adventures in a town named Catharsis, following directly from the ending of the second game in which the town of Paradise was destroyed by a nuclear bomb. Postal III was released in Russia for Microsoft Windows on November 23, 2011, and in North America on December 23, 2011. Ports for OS X, Linux, PlayStation 3, and Xbox 360 were announced, but ultimately canceled.", "developer": ["Running With Scissors"], "genre": "Third-person shooter", "date_release": "2011-11-23"}, "Postal Redux": {"description": "Postal Redux (stylized as POSTAL Redux) is an isometric shoot 'em up video game developed by Running With Scissors. It is a remake of the first installment in the Postal franchise and its expansions in Unreal Engine 4, and contains high-definition redesigns of levels, remastered voice acting and sound effects, updated controls, and additional content not seen in the original.", "developer": ["Running With Scissors"], "genre": "Shoot 'em up", "date_release": "2016-05-20"}, "PP: Pianissimo": {"description": null, "genre": "Mystery", "date_release": "2009-09-29"}, "Prince of Persia: The Sands of Time": {"producer": "Yannis Mallat", "composer": "Stuart Chatwood", "description": "Prince of Persia: The Sands of Time is a third-person action-adventure puzzle-platform video game developed and published by Ubisoft. Revealed in March 2003, it was released across Game Boy Advance, PlayStation 2, GameCube, Xbox and Microsoft Windows in November 2003. The Sands of Time is a reboot of the Prince of Persia series, created by Jordan Mechner. Mechner served as creative consultant, designer, and scenario writer for The Sands of Time.\nThe game follows an unnamed Prince whose father sacks a Maharaja's city at the instigation of its treacherous Vizier. During the attack, the Prince obtains an artifact called the Dagger of Time, while his army captures an hourglass containing the Sands of Time. Visiting Azad to present the Sands as a gift to the city's ruler, the Vizier tricks the Prince into releasing the Sands, transforming the city's population into savage monsters. Together with the Maharaja's daughter Farah, the Prince works to correct his mistake and return the Sands to the hourglass. The gameplay revolves around the Prince's platforming abilities, broken up by fights with the creatures created by the Sands. A key mechanic in the game is using the Dagger to rewind time if the Prince makes a mistake platforming, and using it to kill and freeze enemies.\nConcept work began in spring of 2001, after Ubisoft acquired the Prince of Persia catalog. After Mechner was brought on board, production began in June of that year. After the initial story draft was scrapped as it was too complex, the team began with four guiding concepts, including the ability to rewind time: this idea grew into the Dagger, the Sands, and the various powers related to them. Mechner's script drew inspiration from the Shahnameh, with the main focus on creating a simple narrative that worked with the pace of gameplay. The game used Ubisoft's Jade engine, originally designed for Beyond Good & Evil, another game published by the company. Production was troubled, with the team facing problems with the engine structure and delays with environment assets, while also managing to create an effective tester network to seek out the game's bugs.  In 2004, a version for mobile phones was developed and published in North America by Gameloft.\nUpon release, it received critical acclaim, was nominated for, and won numerous awards and has been recognized by many as one of the greatest video games of all time. Sales of the title were initially slow, but it eventually became a commercial success. Its success prompted the development of a sequel, Prince of Persia: Warrior Within, which was released in November 2004. Further games set in the Sands of Time continuity have been developed, and it is generally cited as the reason for the Prince of Persia series' return to fame.", "developer": ["Ubisoft Montreal"], "genre": "Action-adventure", "date_release": "2003-11-06"}, "Prince of Persia: Warrior Within": {"producer": "Bertrand Hélias", "composer": "Stuart Chatwood", "description": "Prince of Persia: Warrior Within is an action-adventure  video game and sequel to Prince of Persia: The Sands of Time. Warrior Within was developed and published by Ubisoft, and released on December 2, 2004 for the Xbox, PlayStation 2, GameCube, and Microsoft Windows. It picks up where The Sands of Time left off, adding new features, specifically, options in combat. The Prince has the ability to wield two weapons at a time as well as the ability to steal his enemies' weapons and throw them. The Prince's repertoire of combat moves has been expanded into varying strings that allow players to attack enemies with more complexity than was possible in the previous game. Warrior Within has a darker tone than its predecessor adding in the ability for the Prince to dispatch his enemies with various gory finishing moves. In addition to the rewind, slow-down, and speed-up powers from Sands of Time, the Prince also has a new sand power: a circular \"wave\" of sand that knocks down all surrounding enemies as well as damaging them.\nFollowing Warrior Within, a second sequel and a prequel were made, expanding the Sands of Time story. Prince of Persia: The Two Thrones was released on December 1, 2005 and Prince of Persia: The Forgotten Sands was released on May 18, 2010. A port of Warrior Within was done by Pipeworks Software, renamed as Prince of Persia: Revelations, and was released on December 6, 2005 for PlayStation Portable. The port includes additional content including new areas not available in the original release. On June 3, 2010, a port of Warrior Within developed by Gameloft was released for the iPhone. Due to problems with the in-game menu, the game was pulled from the App Store on the same day. It was re-released on June 18, 2010, with the fixed menu and improved tutorial. The iPad version, titled Prince of Persia: Warrior Within HD, was released on September 15, 2010. A remastered, high-definition, version of Warrior Within was released on the PlayStation Network for the PlayStation 3 on December 14, 2010.", "developer": ["Ubisoft Montreal", "Pipeworks Software", "Gameloft"], "genre": "Action-adventure", "date_release": "2004-11-30"}, "Prison Architect": {"producer": "Mark Morris", "description": "Prison Architect is a private prison construction and management simulation video game developed by Introversion Software. It was made available as a crowdfunded paid alpha pre-order on 25 September 2012 with updates scheduled every three to four weeks. With over 2,000,000 copies sold, Prison Architect made over US$10.7 million in pre-order sales for the alpha version. Prison Architect was an entrant in the 2012 Independent Games Festival.The game was available on Steam's Early Access program, and was officially released on 6 October 2015.\nOn 8 January 2019, it was announced that Paradox Interactive had acquired the rights to Prison Architect for an undisclosed sum.", "developer": ["Introversion Software"], "genre": "Construction and management simulation", "date_release": "2015-10-06"}, "Project I.G.I.": {"producer": null, "composer": "Kim M. Jensen", "description": "Project I.G.I. (released in North America as Project I.G.I.: I'm Going In) is a tactical first-person shooter video game developed by Innerloop Studios and released in December 2000 by Eidos Interactive. Upon release the game received mixed reviews due to a number of shortcomings, including poorly programmed A.I., lack of a mid-game save option, and the lack of multiplayer features. However it was praised for its sound design and graphics, thanks in part to its use of a proprietary game engine that was previously used in Innerloop's Joint Strike Fighter.\nIt was followed up in 2003 by I.G.I.-2: Covert Strike.", "developer": ["Innerloop Studios"], "genre": "Stealth game", "date_release": "2000-12-15"}, "Project Zomboid": {"composer": "Zach Beever", "description": "Project Zomboid is an open world survival horror video game in alpha stage development by British and Canadian independent developer, The Indie Stone. The game is set in a post apocalyptic, zombie infested world where the player is challenged to survive for as long as possible before inevitably dying. It was also one of the first five games released on the alpha funding section of the gaming portal Desura.The Indie Stone were subject to a high-profile setback within the indie gaming community following the theft of two laptops containing code for Project Zomboid. Since then, Project Zomboid has appeared on Steam Early Access and continues development to this day. Project Zomboid is The Indie Stone's first commercially released game. As of May 2016, Build 34 was released as stable, and the next build was in development.", "developer": ["The Indie Stone"], "genre": "Role-playing", "date_release": "2013-11-08"}}