{"Quake": {"composer": null, "description": null, "developer": ["id Software"], "genre": "First-person shooter", "date_release": "1996-06-22"}, "Quake II": {"composer": "Sonic Mayhem", "description": "Quake II is a first-person shooter video game released in December 1997. It was developed by id Software and published by Activision. It is not a direct sequel to Quake; id decided to revert to an existing trademark when the game's fast-paced, tactile feel felt closer to a Quake game than a new franchise. The game is followed by Quake 4.\nThe soundtrack for Quake II was mainly provided by Sonic Mayhem, with some additional tracks by Bill Brown; the main theme was also composed by Bill Brown and Rob Zombie, and one track by Jer Sypult. The soundtrack for the Nintendo 64 version of the game was composed by Aubrey Hodges, credited as Ken \"Razor\" Richmond.\n\n", "developer": ["id Software"], "genre": "First-person shooter", "date_release": "1997-12-09"}, "Quake III Arena": {"composer": null, "description": "Quake III Arena is a multiplayer-focused first-person shooter video game released in December 1999. The game was developed by id Software and featured music composed by Sonic Mayhem and Front Line Assembly founder Bill Leeb. Quake III Arena is the third game in the Quake series; it differs from previous games by excluding a story-based single-player mode and highly focusing on multiplayer gameplay. The single-player mode is played against computer-controlled bots.\nNotable features of Quake III Arena include the minimalist design, lacking rarely used items and features, the extensive customizability of player settings such as field of view, texture detail and enemy model, and advanced movement features such as strafe-jumping and rocket-jumping.\nQuake III Arena is available on a number of platforms and contains mature content. The game was highly praised by reviewers who, for the most part, described the gameplay as fun and engaging. Many liked the crisp graphics and focus on multiplayer.\nQuake III Arena has also been used extensively in professional electronic sports tournaments such as QuakeCon, Cyberathlete Professional League, DreamHack, and the Electronic Sports World Cup.", "developer": ["id Software", "Bullfrog Productions", "Pi Studios"], "genre": "First-person shooter", "date_release": "1999-12-02"}, "Quake 4": {"composer": null, "description": "Quake 4 is a military science fiction first-person shooter video game, the fourth title in the Quake series. The game was developed by Raven Software and published by Activision. Raven Software collaborated with id Software, the creators and developers of preceding Quake games. id Software supervised the development of the game as well as providing the id Tech 4 engine upon which it was built. Quake 4 went gold in early October 2005 and was released on October 18, 2005 for Microsoft Windows and later for Linux and OS X, as well as being a launch title for the Xbox 360. A special DVD Collectors Edition was released, including promotional material and the game Quake II with its expansions, The Reckoning and Ground Zero. The Xbox 360 version of Quake 4 is based on the Special Collectors Edition, and includes Quake II. On August 4, 2011, the game was made available through Steam.\nPlotwise, the game is a sequel to Quake II and takes place during the same war as Enemy Territory: Quake Wars. Compared to other titles in the Quake series, Quake 4 has an increased emphasis on the single-player portion of the game. A multiplayer mode is available, but it does not involve playable bots like Quake III Arena.", "developer": ["Raven Software", "id Software"], "genre": "First-person shooter", "date_release": "2005-10-18"}}