{"Vampire: The Masquerade – Bloodlines": {"producer": [null, null], "composer": "Rik Schaffer", "description": "Vampire: The Masquerade – Bloodlines is a 2004 action role-playing video game developed by Troika Games and published by Activision for Microsoft Windows. Set in White Wolf Publishing's World of Darkness, the game is based on White Wolf's role-playing game Vampire: The Masquerade and follows either a male or female character who is killed and subsequently revived as a fledgling vampire. The game depicts the fledgling's journey through the early 21st-century Los Angeles to uncover the truth behind a recently discovered relic that heralds the end of all vampires.\nBloodlines is presented from first- and third-person perspectives. The player assigns their character to one of several vampire clans—each with unique powers, customizes their combat and dialog abilities and progresses through Bloodlines using violent and nonviolent methods. The selection of clan affects how the player is perceived in the game world, and which powers and abilities they possess; this opens up different avenues of exploration and methods of interacting with or manipulating other characters. The player is able to complete side missions away from the primary storyline by moving freely between the available hubs: Santa Monica, Hollywood, downtown Los Angeles, and Chinatown.\nTroika's 32-member team began development of Bloodlines in November 2001, as an indirect sequel to the previous year's Vampire: The Masquerade – Redemption. Troika used Valve Corporation's Source game engine, then in development, which was being used for Valve's own Half-Life 2. The game's production was turbulent, as the design's scope exceeded the available resources, and the team were left without a producer for nearly a year until Activision appointed David Mullich to the role, where he found designs and levels unfinished or abandoned. After three years in development with no end in sight and running over budget, Activision set a strict deadline for completion, and Bloodlines was released incomplete in November 2004.\nReleased in competition with Half-Life 2 and several other titles, Bloodlines sold fewer than 80,000 copies during its initial release, which was considered a poor performance. It divided critics at the time; although they praised the game's writing and scale of choice, they criticized its technical flaws. It was Troika Games' last production before its failure in early 2005, when it was unable to secure additional projects. The game has a cult following as a rarely replicated example of gameplay and narrative, and contemporary reception recognises it as a flawed masterpiece. Since its original release in 2004, Bloodlines received post-release support from fans, supplying unofficial fixes and re-adding unused content. A sequel, Vampire: The Masquerade – Bloodlines 2, is scheduled for release in 2020.", "developer": ["Troika Games"], "genre": "Action role-playing", "date_release": "2004-11-16"}, "Vampire: The Masquerade – Redemption": {"description": "Vampire: The Masquerade – Redemption is a 2000 role-playing video game developed by Nihilistic Software and published by Activision. Set in White Wolf Publishing's World of Darkness, the game is based on White Wolf's role-playing game Vampire: The Masquerade and follows the adventures of Christof Romuald, a 12th-century French crusader who is killed and subsequently revived as a Vampire. The game depicts Christof's centuries-long journey from the Dark Ages of 12th century Prague and Vienna to modern-day London and New York City in search of his humanity and his kidnapped love, the nun Anezka.\nRedemption is presented in the first- and third-person perspectives. The player controls Christof and up to three allies through a linear structure, providing the player with missions to progress through a set narrative. Certain actions committed by Christof throughout the game can raise or lower his humanity, affecting which of the game's three endings the player receives. As a Vampire, Christof is imbued with a variety of abilities and powers that can be used to combat or avoid enemies and obstacles. Use of these abilities drains Christof's supply of blood which can be replenished by drinking from enemies or innocents. It includes multiplayer gameplay called \"Storyteller\", which allows one player to create a narrative for a group of players with the ability to modify the game dynamically in reaction to the players' actions.\nFounded in March 1998, Nihilistic's twelve-man team began development of Redemption the following month as their first game. It took the team twenty-four months to complete on a budget of US$1.8 million. The team relied on eight outside contractors to provide elements that the team could not supply, such as music and artwork. The game's development was difficult: late changes to software forced the developers to abandon completed code and assets; a focus on high-quality graphics and sound meant that the game ran poorly on some computer systems; and the original scope of the game exceeded the game's schedule and budget, forcing the team to cancel planned features.\nRedemption was released for Microsoft Windows on June 7, 2000, with a Mac OS version following in November 2001. The game received a mixed critical response; reviewers praised its graphics and its multiplayer functionality but were polarized by the quality of the story and combat. It received the 1999 Game Critics Awards for Best Role-Playing game. It was successful enough to merit the production of a sequel, Vampire: The Masquerade – Bloodlines, which was released in November 2004 as an indirect sequel set in the same fictional universe.", "developer": ["Nihilistic Software"], "genre": "Role-playing", "date_release": "2000-06-07"}, "Victoria: An Empire Under The Sun": {"producer": "Johan Andersson", "description": "Victoria: An Empire Under the Sun is a grand strategy game by Paradox Entertainment (now known as Paradox Interactive), released in 2003. It covers primarily its namesake the Victorian period (1837-1901) and beyond, specifically 1836-1920 for the main game, and extended until 1936 if the expansion is installed. The game runs on a modified version of the Europa Engine, and the lead game programmer was Johan Andersson. It was later ported to Macintosh by Virtual Programming.\nUnlike previous Paradox Games, which either focused on diplomacy or war, Victoria focuses on internal management, covering the industrialization and social/political changes in a country. The game itself gives a lot of importance to the economy of a country, having a complex market system which is described as being one of the best economic simulators ever made. Fans of Paradox's games have noted this one for being the deepest game Paradox had yet made, making it quite popular with the Paradox fanbase. However, Victoria received largely indifferent reviews on release, averaging only 60.4% on GameRankings. Critics cited reasons such as the game's steep learning curve and its relatively dated graphics. A sequel, Victoria II was released in August 2010.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2003-01-01"}, "Victoria II": {"producer": "Johan Andersson", "composer": "Andreas Waldetoft", "description": "Victoria II is a grand strategy game developed by Paradox Development Studio and published by Paradox Interactive. It was announced on August 19, 2009, and released on August 13, 2010.Virtual Programming published the Mac OS X version of the game on September 17, 2010. The game was localized for Russia by 1C Company and Snowball Studios.Like its predecessor, Victoria II allows for the player to take control of and manage a 19th-century state, including its political, diplomatic, economic, military, and technological aspects. The game has many historical aspects to it, such as the ability to colonize places that, at the time, were not under the control of any European power, such as Sub-Saharan Africa, and North-Western Canada. The time frame of the game is 1836-1936.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2010-08-13"}, "Vivisector: Beast Within": {"description": "Vivisector: Beast Within is a Ukrainian made first-person shooter game released in Europe in 2006. Inspired largely by the science fiction horror film Island of Lost Souls and the science fiction novel The Island of Doctor Moreau, which the film was based on, the game is set in 1987 on a covert military installation on Soreo Island, where a riot has broken out by renegade geneticist Dr. Morhead's experimental human-animal hybrid soldiers against the corrupt general that ordered their creation. It is the player's job, initially, to help the General suppress the riot and regain control of the hybrid soldiers, but the player eventually switches sides against the General halfway through the game. The game is most infamous for its \"vivisection point\" feature, which allows the player to rend an enemy's flesh from their body with each shot (though, due to Germany's strict censor laws, this feature was removed for the human NPCs). This game came out of the cancelled Duke Nukem: Endangered Species Hunter title.", "developer": ["Action Forms"], "genre": "First-person shooter", "date_release": "2006-01-05"}, "Voxatron": {"description": "Humble Bundle, Inc. is a digital storefront for video games, which grew out of its original offering of Humble Bundles, collections of games sold at a price determined by the purchaser and with a portion of the price going towards charity and the rest split between the game developers. Humble Bundle continues to offer these limited-time bundles, but have expanded to include a greater and more persistent storefront. The Humble Bundle concept was initially run by Wolfire Games in 2010, but by its second bundle, the Humble Bundle company was spun out to manage the promotion, payments, and distribution of the bundles. In October 2017, the company was acquired by Ziff Davis through its IGN Entertainment subsidiary, though operates as a separate subsidiary.\nInitial bundles were typically collections of independently developed games featuring multi-platform support (including Microsoft Windows, macOS, and Linux platforms) provided without digital rights management (DRM). Occurring every few months, the two-week Humble Bundles drew media attention, with several bundles surpassing $1 million in sales. Subsequently, the bundles became more frequent and expanded to include games from established developers, AAA publishers, games for Android-based devices, bundles promoting game jams, and bundles featuring digital copies of music, books and comic books. Bundles are presently offered on a more regular basis, with a persistent storefront for individual game sales.\nThe Humble Bundle offerings support a number of charities, including Action Against Hunger, Child's Play, the Electronic Frontier Foundation, charity: water, the American Red Cross, WaterAid and the Wikimedia Foundation. By the end of October 2014, participating developers had grossed more than $100 million and by June 2019, the total charitable amount raised by the Bundles exceeded $150 million across 50 different charities. The success of the Humble Bundle approach has inspired a number of similar efforts to offer \"pay what you want\" bundles for smaller titles, including Indie Gala and Indie Royale.\nAs a corporation, Humble Bundle is headquartered in San Francisco, California, with about 60 employees.", "developer": ["[1]"], "genre": "Action-adventure", "date_release": "2011-10-31"}}