{"_summer": {"description": "Summer  is the hottest of the four temperate seasons, falling after spring and before autumn. At the summer solstice, the days are longest and the nights are shortest, with day length decreasing as the season progresses after the solstice. The date of the beginning of summer varies according to climate, tradition, and culture. When it is summer in the Northern Hemisphere, it is winter in the Southern Hemisphere, and vice versa.", "developer": ["Hooksoft"], "genre": "Visual novel", "date_release": "2005-07-15"}, "0 A.D.": {"description": "Year zero does not exist in the Anno Domini (AD) system usually used to number years in the Gregorian calendar and in its predecessor, the Julian calendar. In this system, the year 1 BC is followed by AD 1. However, there is a year zero in astronomical year numbering (where it coincides with the Julian year 1 BC) and in ISO 8601:2004 (where it coincides with the Gregorian year 1 BC) as well as in all Buddhist and Hindu calendars.", "developer": ["Wildfire Games"], "genre": "RTS", "date_release": "2010-08-16"}, "007 Legends": {"composer": null, "description": "007 Legends is a first-person shooter video game featuring the character of British secret agent James Bond. It was developed by Eurocom and released by Activision on October 2012 for PlayStation 3 and Xbox 360, November 2012 for Microsoft Windows and December 2012 for Wii U. The game is available as physical optical disc media, as well as a digital release download via PlayStation Network and Xbox Live Marketplace on date of release. It was removed off all other digital stores without warning. The PAL Wii U version of the game was released in some parts of Europe on 6 December 2012, and in the United Kingdom on 21 December 2012. The release was cancelled in Australia.The game was released to coincide with the fiftieth anniversary of the James Bond film series. To achieve this the single player campaign includes one mission from each of the six actors' eras, being Goldfinger (Sean Connery), On Her Majesty's Secret Service (George Lazenby), Moonraker (Roger Moore), Licence to Kill (Timothy Dalton) and Die Another Day (Pierce Brosnan), with Skyfall (Daniel Craig) released as downloadable content for the Xbox 360, PS3 and PC and included on disc for the Wii U version. Additionally, some of the original talent from the films add their likenesses and voices to their associated characters. 007 Legends is the fourth and final James Bond game title released by Activision, the last game Eurocom developed before the company ceased operations and also the last James Bond video game to be available on home video game systems, to date. The game received generally unfavorable reviews from critics, according to Metacritic.", "developer": ["Eurocom"], "genre": "First-person shooter", "date_release": "2012-11-02"}, "007: Licence to Kill": {"composer": "David Whittaker", "description": "007: Licence to Kill is a 1989 video game based on the James Bond film of the same name, developed by Quixel and published by Domark in 1989. It was originally released for DOS and then ported to the Amiga, Amstrad CPC, Atari ST, BBC Micro, Commodore 64, MSX and ZX Spectrum. The game was later released in South Korea in 1996, for the Master System.The game's storyline closely follows that of the film, consisting of six scenes in which Bond chases drug czar Sanchez who has murdered his best friend Felix Leiter's bride. The scenes within the game vary in setting and include helicopter chases, underwater diving, water-skis and behind the wheel of an 18-wheel tanker truck.", "genre": "Top-down shooter", "date_release": "1989-04-20"}, "007: Quantum of Solace": {"composer": "Christopher Lennertz", "description": "007: Quantum of Solace is a first-person shooter (third-person shooter for Nintendo DS and PlayStation 2) video game based on the films Casino Royale and Quantum of Solace. The game was released for Microsoft Windows, Nintendo DS, PlayStation 2, PlayStation 3, Wii and Xbox 360. The game was released on October 31, 2008 in Europe, November 4, 2008 in North America, and November 19, 2008 in Australia. The game's release coincided with the release of Quantum of Solace. The game is the first James Bond title published by Activision; the company acquired the video game licence to the James Bond franchise in 2006. The game was released on Microsoft Windows, PlayStation 3, Wii and Xbox 360 developed by Treyarch, Beenox ported the Microsoft Windows and Wii versions alongside Treyarch, Vicarious Visions and Eurocom developed their own versions for Nintendo DS and PlayStation 2. It is powered by the Call of Duty 4: Modern Warfare game engine. It is first to feature Daniel Craig's voice and likeness, as well as those of Eva Green, Judi Dench, Mads Mikkelsen, Olga Kurylenko and Mathieu Amalric.\nIt is also the only Activision-published James Bond title to be developed primarily by an American studio, as the later Bond games published by Activision would be developed by British studios Eurocom (in Derby) and Bizarre Creations (in Liverpool).", "developer": ["Treyarch", "Beenox"], "genre": "First-person shooter", "date_release": "2008-10-31"}, "1-0 Soccer Manager": {"description": "The Soccer Game was an early football-management game, released by Wizard Games of Scotland in 1989. The player manages a football team in the English league. The team starts in the 4th division, although any team from [what were then] the top 4 division of England can be chosen. S/he can alter a team's name before playing. The squad usually consisted of 11 players, but new players could be purchased. According to the help file, the database had 1270 players, and 100 each of treasurers, scouts, physiotherapists, managers and assistant managers. The action in the football matches was written out on the screen.\nThe game had many humorous elements that were dropped from Wizard's later football games. There was a \"Comments\" option on the physio, and this produced irrelevant statements such as \"I want more money\" and \"If you can't stand losing then don't play this game\". When the scout had found a player, his report would read, \"I almost had a deal with....\" The Finance section allowed the player to trade shares in the club, take out loans (always at 20% interest) and gamble on the team's results.\nWizard Games continued to produce football-management games with the later releases 1-0 Soccer Manager and Goal 94.\n\n", "genre": "Sports", "date_release": "1992-01-01"}, "101 Dalmatians: Escape from DeVil Manor": {"description": null, "developer": ["DreamForge Intertainment"], "genre": "Action", "date_release": "1997-01-01"}, "102 Dalmatians: Puppies to the Rescue": {"composer": null, "description": "Disney's 102 Dalmatians: Puppies to the Rescue is a platform video game developed by Toys for Bob and published by Eidos Interactive for Microsoft Windows, PlayStation, Dreamcast and Game Boy Color. It is loosely based on the live-action Disney movie 102 Dalmatians.", "developer": ["Crystal Dynamics"], "genre": "Platform", "date_release": "2000-01-01"}, "10th Frame": {"description": "10th Frame is a ten-pin bowling simulation game published by Access Software in 1986. Up to eight players can take part in open bowling or a tournament. It was released for the Amstrad CPC, Atari ST, Commodore 64, IBM PC compatibles, MSX, and ZX Spectrum.", "developer": ["Access Software"], "genre": "Sports", "date_release": "1986-01-01"}, "140": {"description": "Year 140 (CXL) was a leap year starting on Thursday (link will display the full calendar) of the Julian calendar. At the time, it was known as the Year of the Consulship of Hadrianus and Caesar (or, less frequently, year 893 Ab urbe condita). The denomination 140 for this year has been used since the early medieval period, when the Anno Domini calendar era became the prevalent method in Europe for naming years.", "genre": "Platformer", "date_release": "2013-10-16"}, "18 Wheels of Steel: Haulin'": {"description": "18 Wheels of Steel is a series of trucking simulators developed by SCS Software and published by ValuSoft from 2002 to 2011. The series has eight installments.", "developer": ["SCS Software"], "genre": "Vehicle simulation", "date_release": "2006-12-08"}, "180": {"description": "Year 180 (CLXXX) was a leap year starting on Friday (link will display the full calendar) of the Julian calendar. At the time, it was known as the Year of the Consulship of Rusticus and Condianus (or, less frequently, year 933 Ab urbe condita). The denomination 180 for this year has been used since the early medieval period, when the Anno Domini calendar era became the prevalent method in Europe for naming years.", "genre": "Sports", "date_release": "1986-01-01"}, "1830: Railroads & Robber Barons": {"description": "1830: Railroads & Robber Barons is a video game developed by Simtex and published by Avalon Hill in 1995 for MS-DOS.", "developer": ["Simtex"], "genre": "RTS", "date_release": "1995-01-01"}, "1869": {"description": "1869 (MDCCCLXIX)\nwas a common year starting on Friday of the Gregorian calendar and a common year starting on Wednesday of the Julian calendar, the 1869th year of the Common Era (CE) and Anno Domini (AD) designations, the 869th  year of the 2nd millennium, the 69th  year of the 19th century, and the  10th  and last year of the 1860s decade. As of the start of 1869, the Gregorian calendar was \n12 days ahead of the Julian calendar, which remained in localized use until 1923.", "developer": ["Max Design"], "genre": "Strategy", "date_release": "1992-01-01"}, "1914 Shells of Fury": {"description": "1914 Shells of Fury is a submarine simulation video game set during World War I. The game centers on commanding Kaiserliche Marine U-boats from the beginning of the War in 1914 to its end. It was developed by German studio h2f Informationssysteme and published by Strategy First in 2007.", "genre": "Simulation", "date_release": "2007-08-14"}, "1942: The Pacific Air War": {"description": "1942: The Pacific Air War is combat flight simulation developed and published  by MicroProse for the PC DOS in 1994. It is based on the U.S. and Japanese Pacific War conflict from 1942 to 1945. The popularity of this game influenced the creation of European Air War, a sequel. Tommo purchased the rights to this game and digitally publishes it through its Retroism brand in 2015.", "developer": ["Microprose"], "genre": "Flight simulator", "date_release": "1994-01-01"}, "221B Baker Street": {"description": "221B Baker Street is the London address of the fictional detective Sherlock Holmes, created by author Sir Arthur Conan Doyle. In the United Kingdom, postal addresses with a number followed by a letter may indicate a separate address within a larger, often residential building.  Baker Street in the late 19th century was a high-class residential district, and Holmes' apartment would probably have been part of a Georgian terrace.\nAt the time the Holmes stories were published, addresses in Baker Street did not go as high as 221.  Baker Street was later extended, and in 1932 the Abbey National Building Society moved into premises at 219–229 Baker Street.  For many years, Abbey National employed a full-time secretary to answer mail addressed to Sherlock Holmes.  In 1990, a blue plaque signifying 221B Baker Street was installed at the Sherlock Holmes Museum, situated elsewhere on the same block, and there followed a 15-year dispute between Abbey National and the Holmes Museum for the right to receive mail addressed to 221B Baker Street.  Since the closure of Abbey House in 2005, ownership of the address by the Holmes Museum has not been challenged, despite its location between 237 and 241 Baker Street.", "developer": ["Datasoft"], "genre": "Puzzle", "date_release": "1987-01-01"}, "2400 A.D.": {"description": "2400 A.D. is a role-playing video game designed by Chuck Bueche and published by Origin Systems in 1987. It was developed for MS-DOS and the Apple II.", "developer": ["Origin Systems"], "genre": "Adventure", "date_release": "1987-01-01"}, "3-D Bomberman": {"description": "Bomberman (ボンバーマン, Bonbāman, also briefly known as Dyna Blaster in Europe) is a strategic, maze-based video game franchise originally developed by Hudson Soft and currently owned by Konami. The first game in the series was released in Japan in December 20, 1985 (1987 in the US)  and new games have been published at irregular intervals ever since. Today, Bomberman has featured in over 70 different games on numerous platforms (including all Nintendo platforms), as well as several anime and manga. The most recent iteration, Super Bomberman R, was released in 2017.", "developer": ["Hudson Soft"], "genre": "Arcade", "date_release": "1984-01-01"}, "3-Demon": {"description": "Onimusha 3: Demon Siege, released in Japan and Europe as Onimusha 3 (鬼武者3, Onimusha Surī), is an action-adventure game developed and published by Capcom. It is the third game of the Onimusha series and was released for the PlayStation 2 on April 27, 2004. It was later ported to Windows on December 8, 2005. The story focuses on the returning hero, swordsman Hidemitsu Samanosuke Akechi, who is in his quest to defeat his nemesis, Nobunaga Oda, who wishes to conquer Japan with his army of demons known as Genma. However, Samanosuke changes places with a French officer from the future named Jacques Blanc, and both have to adapt to their new worlds to get rid of Nobunaga and the Genma.\nThe game retains elements from previous games in the franchise including the use of multiple special weapons in order to fight enemies and absorb their energy to enhance the weaponry. This time the player primarily controls both Samanosuke and Jacques in separate scenarios. The two are able to exchange items in order to solve puzzles. The development from this game started after the release of the PlayStation 2 which allowed the team to work on a 3D engine to design 3D backgrounds. In order to appeal to the Western market, the team set this game in Paris and chose French actor Jean Reno to portray Jacques.Onimusha 3 has been generally well received by publications for video games. Most of the writers' praise focused on the improved controls and the use of a 3D engine that allowed better combat and visuals, respectively. The game also generated good sales with over 1.5 million copies sold as of May 2008.", "genre": "Adventure", "date_release": "1983-01-01"}, "3D Construction Kit": {"description": "3D Construction Kit (US, Canada and Israel release title: Virtual Reality Studio), also known as 3D Virtual Studio, is a utility for creating 3D worlds in Freescape. Developed by Incentive Software and published by Domark, it was released in 1991 on multiple platforms. The game originally retailed for £24.99 for the 8-bit version, and £49.99 for 16-bit version, in the United Kingdom. A sequel, 3D Construction Kit II, was released in 1992, but only available on Amiga, Atari ST and MS-DOS.", "developer": ["Incentive Software"], "genre": "Simulation", "date_release": "1991-07-01"}, "3D Construction Kit II": {"composer": null, "description": "3D Construction Kit II (released in North America as Virtual Reality Studio II and Virtual Reality Studio 2.0), is a utility for creating 3D worlds in Freescape. Developed by Incentive Software and published by Domark, it was released in 1992 as a sequel to 3D Construction Kit. Unlike its predecessor, 3D Construction Kit II was released on three platforms: Amiga, Atari ST and MS-DOS.", "developer": ["Incentive Software"], "genre": "Simulation", "date_release": "1992-11-10"}, "3D Maze Man: Amazing Adventures": {"composer": null, "description": "3D Maze Man: Amazing Adventures is a 1998 video game for Microsoft Windows unofficially based on Namco's Pac-Man games and character. In 2000, Pac-Man licensee Hasbro (via Atari) sued to prevent the production and distribution of this and other eGames' other offerings, which included a Tetris-inspired game. Per the settlement, sales continued until the end of September 2000.", "developer": ["Webfoot Technologies"], "genre": "Arcade", "date_release": "1998-01-01"}, "3DiTeams": {"description": "3DiTeams (also known as 3Di TEAMS) is a first person serious video game developed by the Duke University Medical Center and Virtual Heroes and used for medical education and team training. The 3DiTeams Project was conceived by Dr. Jeffrey M. Taekman and Jerry Heneghan and is managed by the Human Simulation and Patient Safety Center at Duke University Medical Center, Durham, North Carolina. \nThe project was unveiled to the general public in a workshop entitled \"3DiTeams – Team Training in a Virtual Interactive Environment\" hosted by the American Society of Anesthesiologists Annual Meeting in San Francisco, California on October 16, 2007. Since that time, it has been the subject of presentations for the Second Annual TeamSTEPPS Consortium Meeting, the Fourth Annual Games for Health Conference, First Annual North Carolina Advanced Learning Technology Summit, and Leadership Symposium on Digital Media in Health Care.", "developer": ["Duke University Medical Center", "Virtual Heroes, Inc."], "genre": "Serious game", "date_release": "2007-11-01"}, "3Kingdoms": {"description": "3Kingdoms, abbreviated 3K, is a MUD, a text-based online role-playing game, founded in 1992.", "genre": "MUD", "date_release": "1992-01-01"}, "4D Sports Boxing": {"composer": null, "description": "4D Sports Boxing is a 3D boxing computer game of the 4D Sports series, with motion capture animation, developed by Distinctive Software, Inc. (DSI) from Vancouver.", "developer": ["Distinctive Software"], "genre": "Sports", "date_release": "1991-06-15"}, "4D Sports Tennis": {"description": "4D Sports Tennis (also known as World Tour Tennis, World Tennis Championshps and Compaq Grand Slam Cup) is a 3D Tennis computer game with motion capture animation of the 4D Sports series.  The game uses untextured 3D polygon graphics.", "developer": ["Distinctive Software"], "genre": "Sports", "date_release": "1990-01-01"}, "4 Elements": {"description": "Classical elements typically refer to the concepts of earth, water, air, fire, and (later) aether, which were proposed to explain the nature and complexity of all matter in terms of simpler substances. Ancient cultures in Persia, Greece, Babylonia, Japan, Tibet, and India had similar lists, sometimes referring in local languages to \"air\" as \"wind\" and the fifth element as \"void\".  The Chinese Wu Xing system lists Wood (木 mù), Fire (火 huǒ), Earth (土 tǔ), Metal (金 jīn), and Water (水 shuǐ), though these are described more as energies or transitions rather than as types of material.\nThese different cultures and even individual philosophers had widely varying explanations concerning their attributes and how they related to observable phenomena as well as cosmology.  Sometimes these theories overlapped with mythology and were personified in deities.  Some of these interpretations included atomism (the idea of very small, indivisible portions of matter), but other interpretations considered the elements to be divisible into infinitely small pieces without changing their nature.\nWhile the classification of the material world in ancient Indian, Hellenistic Egypt, and ancient Greece into Air, Earth, Fire and Water was more philosophical, during the Islamic Golden Age medieval middle eastern scientists used practical, experimental observation to classify materials. In Europe, the Ancient Greek system of Aristotle evolved slightly into the medieval system, which for the first time in Europe became subject to experimental verification in the 1600s, during the Scientific Revolution.\nModern science does not support the classical elements as the material basis of the physical world.  Atomic theory classifies atoms into more than a hundred chemical elements such as oxygen, iron, and mercury.  These elements form chemical compounds and mixtures, and under different temperatures and pressures, these substances can adopt different states of matter.  The most commonly observed states of solid, liquid, gas, and plasma share many attributes with the classical elements of earth, water, air, and fire, respectively, but these states are due to similar behavior of different types of atoms at similar energy levels, and not due to containing a certain type of atom or a certain type of substance.", "genre": "Adventure Game", "date_release": "2008-09-03"}, "4Story": {"description": "Toy Story 4 is a 2019 American computer-animated comedy film produced by Pixar Animation Studios for Walt Disney Pictures. It is the fourth installment in Pixar's Toy Story series, and the sequel to 2010's Toy Story 3. It was directed by Josh Cooley (in his feature directorial debut) from a screenplay by Andrew Stanton and Stephany Folsom; the three also conceived the story alongside John Lasseter, Rashida Jones, Will McCormack, Valerie LaPointe, and Martin Hynes. The film stars the voices of Tom Hanks, Tim Allen, Annie Potts, Tony Hale, Keegan-Michael Key, Jordan Peele, Madeleine McGraw, Christina Hendricks, Keanu Reeves, Ally Maki, Jay Hernandez, Lori Alan, and Joan Cusack.\nThe film directly follows Toy Story 3, as Sheriff Woody, Buzz Lightyear, and their other toy friends have found new appreciation living with Bonnie. They are joined by Forky, a spork that has been made into a toy, and embark on a road trip adventure. The film is dedicated to actor Don Rickles and animator Adam Burke, who died on April 6, 2017 and October 8, 2018, respectively.Toy Story 4 premiered on June 11, 2019 in Los Angeles, California and was theatrically released in the United States on June 21, 2019, in RealD 3D, Dolby Cinema, and IMAX. The film has grossed $1 billion worldwide, becoming the highest grossing installment of the franchise, fifth highest-grossing film of 2019, the 30th highest-grossing film of all time and the fifth highest grossing animated film of all time. Like its predecessors, Toy Story 4 received critical acclaim for its story, humor, emotion, score, animation, and vocal performances.", "genre": "MMORPG", "date_release": "2008-01-01"}, "4th & Inches": {"description": "4th & Inches is an American football sports game by Accolade.  It was released for the Commodore 64, Apple II, MS-DOS, Amiga, and Apple IIGS. It was designed by Accolade co-founder, Bob Whitehead.", "developer": ["Accolade"], "genre": "Sports", "date_release": "1987-01-01"}, "4x4 Hummer": {"description": "This is a list of video games published and/or developed by 505 Games.\n\n", "genre": "Racing", "date_release": "2009-06-15"}, "4x4 Off-Road Racing": {"description": "4x4 Off-Road Racing is a video game of the racing genre released in 1988 by Epyx and developed by Ogdan Micro Design Inc. The four maps consist of Mud, Ice, Desert and Mountains.", "genre": "Racing", "date_release": "1988-01-01"}, "5": {"description": "5 (five) is a number, numeral, and glyph. It is the natural number following 4 and preceding 6.", "developer": ["Ram"], "genre": "Eroge", "date_release": "2008-07-25"}, "5 A Day Adventures": {"producer": "Patsy Northcutt", "composer": "Phil Schroeder", "description": "5 A Day Adventures is an educational computer game developed by eMotion Studios.", "genre": "Education", "date_release": "1994-01-01"}, "50 Mission Crush": {"description": "50 Mission Crush (sometimes Fifty Mission Crush) is a turn-based strategy game published in 1984 by Strategic Simulations (SSI) that simulates the career of the crew of a B-17 Flying Fortress bomber during World War II.  The bomber is based out of the RAF Thurleigh base just north of London, and is part of the 8th Air Force. While most of SSI's games emphasized long-term strategic planning, 50 Mission Crush was marketed explicitly for its quick, comparatively fast pace: each mission takes no more than about 10 minutes. SSI described it as a \"role-playing game\".", "genre": "RPG", "date_release": "1984-01-01"}, "500cc Grand Prix": {"description": "500cc Grand Prix was one of the first French-made games for the Atari ST. It was developed by Microïds in 1987. The graphics and animation were not well developed in this motorcycle Racing game but on the other hand the fact that the game has a versus mode is well-appreciated.", "developer": ["Microïds"], "genre": "Racing", "date_release": "1987-01-01"}, "688(I) Hunter/Killer": {"producer": "Ed Gwynn", "composer": null, "description": "Jane's 688(i) Hunter/Killer is a 1997 submarine simulator video game, developed by Sonalysts Inc. and published by Electronic Arts and more recently by Strategy First for Windows 95 compatible operating systems. It is named after the 688 (Improved) Los Angeles class of United States (SSN) submarine, and was a successor to the earlier game 688 Attack Sub. It's part of the Jane's Combat Simulations series. It was released on Valve's Steam content delivery service as well as DotEmu.", "genre": "Submarine simulator", "date_release": "1997-07-04"}, "7 Colors": {"description": "7 Colors (a.k.a. Filler) is a puzzle game, designed by Dmitry Pashkov. It was developed by the Russian company Gamos) in 1991. The game was published by Infogrames for MS-DOS, Amiga, and NEC PC-9801.", "genre": "Strategy", "date_release": "1991-01-01"}, "7554": {"description": "7554: Glorious Memories Revived is a first-person shooter video game developed by Vietnamese video game developer Emobi Games for Windows. It was released for Vietnamese markets on December 16, 2011.\nThe game is set during the Franco-Vietnamese War from 1946 to 1954. The title is a reference to May 7, 1954, which was the date of the Việt Minh's victory over France at the Battle of Dien Bien Phu.", "genre": "First-person shooter", "date_release": "2011-12-16"}, "7th Legion": {"description": "7th Legion is a real-time strategy computer game for Microsoft Windows, developed by Vision and Epic MegaGames and published by MicroProse in 1997. The game consists of two single-player campaigns and supports multiplayer online games. On February 18, 2014, Tommo re-released the game on GOG.com, but without multiplayer. In a joint effort, Nintendo was going to help Epic MegaGames port the game to Nintendo 64, but this port did not come to release.", "developer": ["Epic MegaGames"], "genre": "RTS", "date_release": "1997-09-30"}, "80 Days": {"description": "Around the World in Eighty Days (French: Le tour du monde en quatre-vingts jours) is an adventure novel by the French writer Jules Verne, published in 1873. In the story, Phileas Fogg of London and his newly employed French valet Passepartout attempt to circumnavigate the world in 80 days on a £20,000 wager (£2,242,900 in 2019) set by his friends at the Reform Club. It is one of Verne's most acclaimed works.", "developer": ["Frogwares"], "genre": "Adventure", "date_release": "2005-01-01"}, "8BitMMO": {"description": "8BitMMO is a massively multiplayer game and a free-to-play created by American indie studio Archive Entertainment. It is currently in a public beta-testing stage and has been released on Steam on December 14, 2013 and currently on Early Access. It was created and is actively developed by Robby Zinchak. Users are encouraged to build in a shared world and undertake player vs environment and player vs player combat. The game was released on Steam.On February 14, 2014, a chiptune soundtrack was included with music from Danimal Cannon, Zef, Protodome, and Honin Myo Audio.", "genre": "MMORPG", "date_release": "2013-12-14"}, "9: The Last Resort": {"producer": null, "composer": "Marco d'Ambrosio", "description": "9: The Last Resort is a 1996 adventure computer game developed by Tribeca Interactive. The game was produced by Robert De Niro and Jane Rosenthal, and sported an all-star cast of voice-artists including Cher, James Belushi, Christopher Reeve, and Steven Tyler & Joe Perry of Aerosmith.  It also includes the visual style and artwork of Mark Ryden.The game came three years after the release of Myst. Like Myst, 9 is a graphically-rich 3D prerendered world, taking advantage of high-quality QuickTime video. It was written for the Windows and the Mac OS platforms, unlike most games of the time which ran on DOS platform as well/instead.\n9 features a large cast of characters, and is rich in character interaction. The game world is populated by bizarre environments, objects and creatures. There is a strong musical theme running through the entire game, as evidenced by a majority of the puzzles, including the main recurring puzzle. There is also a strong element of humour in the game.", "developer": ["Tribeca Interactive"], "genre": "Adventure game", "date_release": "1996-09-30"}}