{"Napoleon: Total War": {"composer": "Richard Beddow", "description": "Napoleon: Total War is a turn-based strategy and real-time tactics video game developed by The Creative Assembly and published by Sega for the Microsoft Windows and Mac OS X. Napoleon was released in North America on 23 February 2010, and in Europe on 26 February. The game is the sixth stand-alone installment in the Total War series. The game is set in Europe, North Africa, and the Middle East during the late 18th and early 19th centuries. Players assume the role of Napoleon Bonaparte, or one of his major rivals, on a turn-based campaign map and engage in the subsequent battles in real-time. As with its predecessor, Empire: Total War, which included a special United States storyline, Napoleon features three special campaigns that follow the general's career.\nNapoleon received generally favourable reviews from video game critics. Reviews praised the game's visuals, story driven campaigns, and new gameplay features. Some reviewers were critical of the game's weak AI, high system requirements, and its limited scope – while others considered Napoleon overly similar to Empire, its immediate predecessor in the series.\nAn entirely new campaign, the Peninsular Campaign, was released 25 June 2010 as downloadable content. It was later released in retail as part of the Empire and Napoleon Total War – Game of the Year Edition compilation pack on 2 October 2010.\nThe Mac OS X version of the game, containing the Peninsular Campaign and additional unit packs, was announced by Feral Interactive on 28 January 2013. It was released for the Mac on 3 July 2013.French actor Stéphane Cornicard provided voice-acting for Napoleon Bonaparte in the original English, German, French, and Spanish editions.", "developer": ["The Creative Assembly", "Feral Interactive"], "genre": "Turn-based strategy", "date_release": "2010-02-23"}, "Natural Selection 2": {"description": "Natural Selection 2  is a multiplayer video game  which combines first-person shooter and real-time strategy rules. It is set in a science fiction universe in which a human team fights an alien team for control of resources and territory in large and elaborate indoor facilities. It is the sequel to Natural Selection.", "developer": ["Unknown Worlds Entertainment"], "genre": "First-person shooter", "date_release": "2012-10-30"}, "NBA 2K10": {"description": "NBA 2K10 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It was released in October and November 2009 for Microsoft Windows, PlayStation 3, PlayStation 2, PlayStation Portable, Xbox 360, and Wii. The eleventh installment in the NBA 2K series, it is the successor to NBA 2K9 and the predecessor to NBA 2K11. Kobe Bryant of the Los Angeles Lakers is the cover athlete of the game. NBA 2K10 is the first game in the series to be released for the PlayStation Portable and Nintendo Wii platforms; it is also the first game in the series to be released on a Nintendo console since NBA 2K3 was released for GameCube.\nThe game strives to realistically depict the experience of basketball, and more specifically, the National Basketball Association. Players mainly play NBA basketball games in a variety of game modes with real players and teams as well as customizable players. MyPlayer mode is one of the new features; it in, players create their own player and play through their career in the NBA. A mode called Association is also present, in which the player assumes control of an NBA organization, and simulates through seasons. Online modes and quick play options among others are also available.\nIn addition to the regular edition of the game, a limited edition, known as the Anniversary Edition, was also released; it included several bonuses, such as a poster and figurine. Only 30,000 copies of the Anniversary Edition were manufactured. A downloadable title available for PlayStation Network and Xbox Live, called NBA 2K10 Draft Combine, was released prior to the release of the main game; it tied into the main game's MyPlayer mode.\nNBA 2K10 received favorable reviews from critics upon release. Positive comments were directed at the overall gameplay and presentation, as well as the introduction of the MyPlayer mode, while negative comments were concerning the presence of numerous technical issues. By February 2010, the game had sold over two million copies worldwide.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2009-10-12"}, "NBA 2K11": {"description": "NBA 2K11 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It was released in October 2010 for Microsoft Windows, PlayStation 3, PlayStation 2, PlayStation Portable, Xbox 360, and Nintendo Wii. The twelfth installment in the NBA 2K series, it is the successor to NBA 2K10 and the predecessor to NBA 2K12. Michael Jordan is the cover athlete of the game. This is the first game on Playstation 3 to be used with the Playstation Move \nThe game strives to realistically depict the experience of basketball, and more specifically, the National Basketball Association (and the NBA D League in association mode). Players mainly play NBA basketball games in a variety of game modes with real and customizable players and teams. MyPlayer mode is one of the modes. In it, players create their own player and play through their career in the NBA. A mode called Association is also present, in which the player assumes control of an NBA organization, and simulates through seasons. Two new modes focusing on Michael Jordan are introduced, as are classic NBA teams. Online modes and quick play options among others are also available.\nNBA 2K11 received positive reviews from critics upon release. Positive comments were directed at the overall gameplay and presentation, as well as the introduction of the Michael Jordan-centric modes, while negative comments were concerning the presence of technical issues. By August 2011, the game had sold over 5.5 million copies worldwide.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2010-10-05"}, "NBA 2K12": {"description": "NBA 2K12 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It was released in October 2011 for Xbox 360, PlayStation 3, PlayStation 2, PlayStation Portable, Wii, Microsoft Windows, and, for the first time, iOS. The thirteenth installment in the NBA 2K series, it is the successor to NBA 2K11 and the predecessor to NBA 2K13. For the first time in the series, three different covers are available; the three cover athletes are Michael Jordan, Magic Johnson, and Larry Bird. This was the last installment in the series to be released for the PlayStation 2.\nNBA 2K12, like the other games in the series, strives to emulate the experience of the National Basketball Association. Players mainly play NBA basketball games in a variety of game modes with real and customizable players and teams. MyPlayer mode is one of the modes; in it, players create their own player and play through their career in the NBA. A mode called Association is also present, in which the player assumes control of an NBA organization, and simulates through seasons. A mode focusing on past NBA players is introduced, and several online modes are present.\nIn September 2011, prior to the game's release, a demo was released for PlayStation Network and Xbox Live. The game features a licensed soundtrack consisting of 28 songs. A contest was held before the game's release, the winners of which would collaborate on an original song to be featured in the game.\nNBA 2K12 received positive reviews from critics upon release, with praise directed at the visuals, wealth of content, controls, and overall gameplay. By April 2012, the game had sold over four million copies worldwide.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2011-10-04"}, "NBA 2K13": {"producer": "Jay-Z", "description": "NBA 2K13 is a  basketball video game developed by Visual Concepts and published by 2K Sports. It was released on October 2, 2012 in North America for the Xbox 360, PlayStation Portable, PlayStation 3, Microsoft Windows and Wii. A version for the Wii U was also released as a launch title in North America, and in December for the PAL region. Kevin Durant of the Oklahoma City Thunder, Blake Griffin of the Los Angeles Clippers and Derrick Rose of the Chicago Bulls are the cover athletes.  NBA 2K13 is the successor to NBA 2K12 and was succeeded by NBA 2K14 in the NBA 2K series. The game was executive produced by rapper Jay-Z, who designed the game and curated its soundtrack. It is also the last NBA 2k game to be released on the PlayStation Portable.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2012-10-02"}, "NBA 2K14": {"description": "NBA 2K14 is a basketball video game developed by Visual Concepts and published by 2K Sports. It was released on October 1, 2013, for Microsoft Windows, PlayStation 3, and Xbox 360, and the PlayStation 4 and the Xbox One versions were released on the consoles' respective launch dates. LeBron James of the Miami Heat became the cover athlete, and also served as the music curator for the game. 2K Sports also released the DLC pack that as a bonus for pre-ordering the game, they would receive 10,000 VC, bonus content for \"Path to Greatness\" mode, adding James in the Blacktop mode and a signature skill for MyCareer mode. On August 14, 2013, 2K Sports announced that Crew Mode would return to this year's installment of NBA 2K. NBA 2K14 is the successor to NBA 2K13 and was succeeded by NBA 2K15 in the NBA 2K series.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2013-11-15"}, "NBA 2K15": {"description": "NBA 2K15 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It is the sixteenth installment in the NBA 2K franchise and the successor to NBA 2K14. It was released in October 2014 for Microsoft Windows, Xbox One, Xbox 360, PlayStation 3 and PlayStation 4. Kevin Durant of the Oklahoma City Thunder, one of the three cover athletes of NBA 2K13, is the solo cover athlete of NBA 2K15. NBA 2K15 was succeeded by NBA 2K16.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2014-10-07"}, "NBA 2K16": {"composer": null, "description": "NBA 2K16 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It is the 17th installment in the NBA 2K franchise and the successor to NBA 2K15. It was released on September 29, 2015 for Microsoft Windows, Xbox One, Xbox 360, PlayStation 4, and PlayStation 3. A mobile version for Android and iOS was also released on October 14, 2015. There are three different covers for the main game, one featuring Anthony Davis of the New Orleans Pelicans, another featuring Stephen Curry of the Golden State Warriors, and the last featuring James Harden of the Houston Rockets. A special edition version of the game was also released; it features Michael Jordan on the cover. Additionally, the French version of NBA 2K16 features Tony Parker of the San Antonio Spurs as the cover athlete, the German version, Dennis Schröder of the Atlanta Hawks, and the Spanish version, Marc and Pau Gasol of the Memphis Grizzlies and Chicago Bulls respectively. NBA 2K16 was succeeded by NBA 2K17.NBA 2K16 simulates the experience of the National Basketball Association. Players play NBA games with real or created players and teams in various game modes, such as MyCareer, MyTeam, and standard games. Players may play regular season NBA games, playoff games, Summer League games, and others. Apart from the NBA, EuroLeague teams are also featured, thus simulating the EuroLeague. Players may create their own player and take them through a basketball career with the central goal of being the greatest basketball player of all time. The game offers many customization options for the player; the player may customize the physical appearance, attributes, and skill set of any player. Players may also create, build, and customize their own teams. The soundtrack was curated by DJ Premier, DJ Mustard, and DJ Khaled. It consists of 50 different songs.\nDirector Spike Lee was heavily involved in the development of the game's MyCareer mode. Lee's goal was to create a more story-focused MyCareer mode than previous installments. Lee worked with real world basketball players, following them and documenting their experience in high school and college competition, in an effort to more accurately depict the lifestyle of real professional basketball players. Several improvements and new additions were made to NBA 2K16, such as full body scanning, and overall aesthetic improvements. Several versions of the game were released, such as a special edition, which includes several physical and digital extras. If players pre-ordered the game, they received it on September 25, 2015. Players may also purchase a companion app called MyNBA2K16 which allows the player to earn in-game currency among other things.\nNBA 2K16 was met with a positive reception upon release. Many critics praised the overall presentation and gameplay, as well as the large amount of content, the new features, and the developers' ability to still introduce positive changes after many previous installments. However, some critics still experienced online technical issues, while others heavily criticized the MyCareer mode for being far too restrictive. Some critics also felt that changing the controls was unnecessary and criticized the lack of tutorials and the presence of microtransactions. NBA 2K16 shipped over 4 million copies in its first week, making it the fastest selling game in the series. NBA 2K16 is the predecessor to NBA 2K17.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2016-09-29"}, "NBA 2K17": {"description": "NBA 2K17 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It is the 18th installment in the NBA 2K franchise and the successor to NBA 2K16. It was released worldwide on September 20, 2016, for Microsoft Windows, PlayStation 4, PlayStation 3, Xbox One, and Xbox 360. Players who pre-ordered the game received it on September 16, 2016. Paul George of the Indiana Pacers is the cover athlete for the regular edition of the game, while Kobe Bryant is the cover athlete for the 'Legend Edition'. In Italy, the cover athlete is Danilo Gallinari, and in Spain, the cover athlete is Pau Gasol. A version of the game for iOS and Android was released on September 23, 2016. NBA 2K17 was succeeded by NBA 2K18NBA 2K17 simulates the experience of the National Basketball Association (NBA). Several game modes are included, such as MyCareer, where the player creates a customizable player and plays through their career, MyGM and MyLeague, both franchise modes where the player controls an entire organization, and MyTeam, where the player creates a team to compete against other players' teams. Along with current NBA teams, other teams are included, such as classic NBA teams, national teams, and EuroLeague teams. The game's soundtrack, which features 50 licensed songs, was curated by Grimes, Imagine Dragons, and Noah Shebib.\nNBA 2K17 was released to critical acclaim. Most critics praised the presentation and visuals, as well as the gameplay and amount of content. By February 2017, the game had shipped approximately 7 million copies.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2016-09-20"}, "NBA 2K18": {"description": "NBA 2K18 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It is the 19th installment in the NBA 2K franchise, the successor to NBA 2K17, and the predecessor to NBA 2K19. It was released on September 19, 2017 for Microsoft Windows, Xbox One, PlayStation 4, Xbox 360, iOS, Android, PlayStation 3, and Nintendo Switch. Pre-ordering gives it on September 15, 2017. Kyrie Irving of the Boston Celtics serves as cover athlete for the regular edition of the game, Shaquille O'Neal is the cover athlete for the special editions, and DeMar DeRozan of the Toronto Raptors is the cover athlete for the game in Canada. While a member of the Cleveland Cavaliers when selected for the cover, Irving was traded to the Boston Celtics prior to the game's release. As a result, a new cover depicting Irving in a Celtics uniform was revealed alongside the original cover. This was the last installment in the series to be released for the Xbox 360 and PlayStation 3.\nNBA 2K18, like the previous games in the series, is based on the sport of basketball; more specifically, it simulates the experience of the National Basketball Association (NBA). Several game modes are present, including the team-managing MyGM and MyLeague modes, which were a considerable emphasis during development, and MyCareer, in which the player creates and plays through the career of their own player. The game features a licensed soundtrack consisting of 49 songs.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2017-09-19"}, "NBA 2K9": {"description": "NBA 2K9 is a basketball simulation video game developed by Visual Concepts and published by 2K Sports. It is the tenth installment in the NBA 2K franchise and the successor to NBA 2K8. It was released in 2008 for PlayStation 2, PlayStation 3, Xbox 360, and Microsoft Windows. Kevin Garnett of the Boston Celtics is the cover athlete of the game. NBA 2K9 is the predecessor to NBA 2K10 in the NBA 2K series.\nLike past games in the series, NBA 2K9 simulates the experience of the sport of basketball, and more specifically, the National Basketball Association. Players play NBA games with any team of their choosing, and may customize many different aspects to alter the play style and overall presentation. Several single- and multiplayer game modes are present, including season, online, and quick play, as well as the ability to create new teams and players.\nNBA 2K9 received positive reviews from critics upon release. Most positive comments were concerning the overall gameplay, and the aesthetical presentation; some called NBA 2K9 the \"best basketball game around\". Some criticism was directed at the game for what some saw as having a lack of new features. By July 2009, the game had sold over 2 million copies.", "developer": ["Visual Concepts"], "genre": "Sports", "date_release": "2008-10-07"}, "NBA Hangtime": {"description": "NBA Hangtime is a basketball video game developed and published by Midway and released in arcades in 1996. Home versions were released for the Nintendo 64, PlayStation, SNES, Sega Mega Drive/Genesis, and Microsoft Windows. A version for Game.com was cancelled.\nHangtime was the third basketball game by the original development team behind the NBA Jam series. The title was changed due to the NBA Jam name being acquired by Acclaim Entertainment, the publisher of the games for the home market. Acclaim's NBA Jam Extreme was released the same year as Hangtime. Features introduced in Hangtime included character creation, alley oops, and double dunks. A software update known as NBA Maximum Hangtime was released for the arcades later in the life cycle. A sequel, NBA Showtime: NBA on NBC, was released in 1999.\nThe theme song \"Whatcha Gonna Do?\" was produced by rapper M-Doc of Indasoul Entertainment.", "developer": ["Midway", "Funcom"], "genre": "Sports", "date_release": "1996-12-31"}, "NBA Inside Drive": {"description": "NBA Inside Drive is a series of video games based on National Basketball Association, published by Microsoft Studios. Its main competition was NBA Live, a series from Electronic Arts.", "developer": ["Microsoft Studios"], "genre": "Sports", "date_release": "2000-08-17"}, "NBA Jam Extreme": {"description": "NBA Jam Extreme is a 1996 basketball arcade game by Acclaim Entertainment based on the 1996–97 NBA season. After Midway Games released two NBA Jam games, Acclaim, the publisher of the home versions of NBA Jam, ended up winning the exclusive rights to use the Jam name. NBA Jam Extreme was the first Jam game from Acclaim, as well as the first edition of the game to use 3D graphics. In contrast, Midway's competing NBA game NBA Hangtime featured 2-D visuals similar to the previous Jam games. Extreme also features longtime sports broadcaster Marv Albert doing commentary instead of original commentator Tim Kitzrow. New to the game is the \"Extreme\" button, essentially a super version of the series' trademark \"Turbo\" button. The cover features Shawn Kemp of the Seattle SuperSonics, and Hakeem Olajuwon of the Houston Rockets.\nThe game was used as the basis for a PlayStation demo game titled \"NBA 2Ball\", which was based on the NBA's 2Ball competition for the 1998 NBA All-Star Weekend. The demo featured rosters from the 1997-98 NBA Season, with each team having three players. Acclaim also released a series of follow-ups to Extreme, most of which were more traditional basketball simulations.", "developer": ["Sculptured Software"], "genre": "Sports", "date_release": "1997-01-31"}, "NBA Live 2000": {"description": "NBA Live 2000 is the 2000 installment of the NBA Live video games series. The cover features Tim Duncan of the San Antonio Spurs. The game was developed by EA Sports and released on October 31, 1999. Don Poier is the play-by-play announcer with Reggie Theus on color commentary. A release of the game for the Game Boy Color was planned, but cancelled. The game features Michael Jordan in his first official appearance in the series. The PC version of the game introduced EA's \"Face in the Game\" feature, allowing players to use custom facial photographs on created players. It was also the final NBA Live game released for Nintendo 64. NBA Live 2000 is followed by NBA Live 2001.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "1990-10-31"}, "NBA Live 2001": {"description": "NBA Live 2001 is the 2001 installment of the NBA Live video games series. The cover features Kevin Garnett as a member of the Minnesota Timberwolves and in Lithuanian copies of NBA Live 2001, it featured Arvydas Sabonis. The game was developed by EA Sports and was released on October 16, 2000, for the PlayStation, January 22, 2001, for the PlayStation 2 and February 7, 2001, for the Windows. NBA Live 2001 is followed by NBA Live 2002.", "developer": ["Electronic Arts"], "genre": "Sports", "date_release": "2001-02-07"}, "NBA Live 2003": {"description": "NBA Live 2003 is the 2003 installment of the NBA Live video games series. The cover features Jason Kidd as a member of the New Jersey Nets. The game was developed by EA Sports and released on October 8, 2002 for the PlayStation, PlayStation 2, Xbox, and GameCube consoles and November 14, 2002 for Microsoft Windows. The game includes a soundtrack, which is the first video game soundtrack in history to be certified Platinum by the RIAA, selling over 1,300,000 copies worldwide.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "2002-10-08"}, "NBA Live 2004": {"description": "NBA Live 2004 is the 2003 installment of the NBA Live video games series. The cover features Vince Carter as a member of the Toronto Raptors and in Spain copies of NBA Live 2004 feature Raul Lopez. The game was developed by EA Sports and released in 2003. The game is similar graphically to NCAA March Madness 2004 and has the same create-a-player models.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "2003-10-15"}, "NBA Live 2005": {"description": "NBA Live 2005 is the 2004 installment of the NBA Live video games series. The cover features Carmelo Anthony as a member of the Denver Nuggets. The game was developed by EA Sports and released in 2004 for PlayStation 2, Xbox, Nintendo GameCube, and Windows.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "2004-09-28"}, "NBA Live 06": {"description": "NBA Live 06 is a 2005 installment of the NBA Live series released on the Xbox, Xbox 360, Nintendo GameCube, Microsoft Windows, PlayStation Portable, PlayStation 2 and Mobile. It was developed by EA Sports. The game features several game modes, including Dynasty, Season, Playoffs, or Free Play. It features Dwyane Wade of the Miami Heat on the cover. This was the last NBA Live game on the GameCube and it also was the first NBA Live game on the Xbox 360 as a launch title and on the PlayStation Portable.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "2005-10-04"}, "NBA Live 07": {"description": "NBA Live 07 is the 2006 installment of the NBA Live series by EA Sports. It was released on Xbox, Xbox 360, PlayStation 2, PlayStation Portable, Windows, and Mobile phones. A launch for Playstation 3 was planned but was cancelled altogether due to the games ambitious design for the console", "developer": ["EA Canada"], "genre": "Sports", "date_release": "2006-11-15"}, "NBA Live 99": {"composer": "Traz Damji", "description": "NBA Live 99 is the 1999 installment of the NBA Live video games series. The cover features Antoine Walker of the Boston Celtics. The game was developed by EA Sports and released on October 31, 1998 for the Windows and PlayStation, then in November 4, 1998 for the Nintendo 64. Don Poier is the play-by-play announcer. It was the first NBA Live game released for Nintendo 64. NBA Live 99 is followed by NBA Live 2000.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "1998-10-31"}, "NBA Playgrounds": {"description": "NBA Playgrounds is a 2017 sports video game developed by Saber Interactive and published by Mad Dog Games for the Nintendo Switch, PlayStation 4, Xbox One, and for Microsoft Windows. Bearing similarities to previous related titles such as NBA Jam and NBA Street, NBA Playgrounds is an arcade-style basketball game officially licensed by the National Basketball Association.", "developer": ["Saber Interactive"], "genre": "Sports", "date_release": "2017-05-09"}, "Need for Speed": {"description": "Need for Speed (NFS) is a racing video game franchise published by Electronic Arts and currently developed by Ghost Games. The series centers around illicit street racing and in general tasks players to complete various types of races while evading the local law enforcement in police pursuits. The series released its first title, The Need for Speed, in 1994. The most recent game, Need for Speed Payback, was released in 2017.\nThe series has been overseen and had games developed by multiple notable teams over the years including EA Black Box and Criterion Games, the developers of Burnout. The franchise has been critically well received and is one of the most successful video game franchises of all time, selling over 150 million copies of games. Due to its strong sales, the franchise has expanded into other forms of media including a film adaptation and licensed Hot Wheels toys.", "developer": ["Pioneer Productions"], "genre": "Racing", "date_release": "1994-08-31"}, "Need for Speed II": {"producer": "Hanno Lemke", "composer": null, "description": "Need for Speed II is a racing video game released in 1997. It is a part of the Need for Speed series and is the second installment, following Road & Track Presents: The Need for Speed.\n\n", "developer": ["Electronic Arts"], "genre": "Racing", "date_release": "1997-03-31"}, "Need for Speed III: Hot Pursuit": {"producer": "Hanno Lemke", "composer": null, "description": "Need for Speed III: Hot Pursuit is a racing video game released in 1998. It is the third major installment in the Need for Speed series, incorporating police pursuits as a major part of gameplay. Hot Pursuit remains focused in racing using exotic sports cars, but features races that primarily take place in locations within North America, including varied settings and climates. In addition, police AI is improved over its predecessor, utilizing several tactics to stop both the player and opponent. The game was released for PlayStation in March 1998 and later received an enhanced port for Microsoft Windows in October 1998. A sequel, Need for Speed: Hot Pursuit 2, was released in 2002.\n\n", "developer": ["Electronic Arts"], "genre": "Racing", "date_release": "1998-03-25"}, "Need for Speed: High Stakes": {"producer": "Hanno Lemke", "composer": null, "description": "Need for Speed: High Stakes, known as Need for Speed: Road Challenge in Europe and South America is a 1999 racing game released by EA for the PlayStation and Microsoft Windows.", "developer": ["Electronic Arts"], "genre": "Racing", "date_release": "1999-03-08"}, "Need for Speed: Hot Pursuit 2": {"producer": null, "description": "Need for Speed: Hot Pursuit 2 is a 2002 racing video game, the sixth installment in the Need for Speed series and the sequel to 1998's Need for Speed III: Hot Pursuit. It was developed by EA Black Box for the PlayStation 2, and by EA Seattle for GameCube, Xbox and Windows. It features cars from various high performance and exotic car manufacturers. Players can compete in races using these cars, or opt to play as a police officer and pursue speeders.\nThe game features several popular recording artists from its time such as Uncle Kracker, The Humble Brothers and Hot Action Cop. Need for Speed: Hot Pursuit 2 received \"generally favorable\" reviews on the PS2 and Xbox, while the PC and GameCube versions received \"mixed or average\" reviews, according to review aggregator Metacritic. In 2002, the game was awarded Console Racing Game of the Year at the 6th Annual Interactive Achievement Awards. Hot Pursuit 2 was not released in Japan.\nIt was followed by either Need for Speed: Underground in 2003 or the 2010 reboot.", "developer": ["Electronic Arts"], "genre": "Racing", "date_release": "2002-10-02"}, "Need for Speed: Porsche Unleashed": {"composer": null, "description": "Need for Speed: Porsche Unleashed, released as Need for Speed: Porsche 2000 in Europe and Need for Speed: Porsche in Latin America, and Germany, is a racing video game released in 2000. It is the fifth installment in the Need for Speed series. Unlike other NFS titles, Porsche Unleashed centers on racing Porsche sports cars, with models ranging from 1950 to 2000. Unlike the previous four Need for Speed games, Porsche Unleashed was not released in Japan.", "developer": ["Electronic Arts"], "genre": "Racing", "date_release": "2000-02-29"}, "Need for Speed: Underground": {"description": "Need for Speed: Underground is the seventh installment in the Need for Speed series, and was developed by EA Black Box and published by Electronic Arts in 2003. Two different games were produced, one for consoles and Windows, and the other for the Game Boy Advance.\nUnderground rebooted the franchise, ignoring the previous Need for Speed games which featured sports cars and exotics. It was the first game in the series to offer a career mode featuring a storyline, and a garage mode that allowed players to fully customize their cars with a large variety of brand-name performance and visual upgrades. All races take place in a generic city at night called Olympic City, though the city bears some resemblance to New York City, San Francisco and Los Angeles. Rather than exotic cars, Underground featured vehicles associated with the import scene. Underground was commercially successful, and was followed by Need for Speed: Underground 2 in 2004.", "developer": ["EA Black Box"], "genre": "Racing", "date_release": "2002-10-02"}, "Nether: Resurrected": {"description": "Nether is a first-person multiplayer survival game for Windows. It was developed by American studio Phosphor Games, and was first available on October 29, 2013.", "genre": "Survival Horror", "date_release": "2013-10-28"}, "The Neverhood": {"composer": "Terry Scott Taylor", "description": "The Neverhood (also called The Neverhood Chronicles, released in Japan as Klaymen Klaymen: The Mystery of Neverhood) is a 1996 point-and-click adventure video game developed by The Neverhood, Inc. and published by DreamWorks Interactive for Microsoft Windows. The game follows the adventure of a claymation character named Klaymen as he discovers his origins and his purpose in a world made entirely out of clay. When the game was originally released, it was unique in that all of its animation was done entirely in claymation, including all of the sets, rather than 2- or 3-dimensional computer graphics, like many other games at its time. The gameplay consists mostly of the player guiding the main character Klaymen around and solving puzzles to advance in the game. As the player advances through different areas of the game, there are various video sequences that help advance the plot. In addition to being unique, The Neverhood aimed at being quirky and humorous, as is evident by the characters, the music, and the plot sequence of the game.", "genre": "Point-and-click adventure game", "date_release": "1996-10-31"}, "Neverwinter Nights": {"producer": "Trent Oster", "composer": "Jeremy Soule", "description": "Neverwinter Nights is a third-person role-playing video game developed by BioWare. Interplay Entertainment was originally set to publish the game, but financial difficulties led to it being taken over by Infogrames, who released the game under their Atari range of titles. It was released for Microsoft Windows on June 18, 2002. BioWare later released a Linux client in June 2003, requiring a purchased copy of the game to play. MacSoft released a Mac OS X port in August 2003.\nNeverwinter Nights is set in the fantasy world of the Forgotten Realms campaign setting, with the game mechanics based on the Dungeons & Dragons 3rd edition rules. The game engine was designed around an Internet-based model for running a massively multiplayer online game (MMOG), which would allow end users to host game servers. Up to 64 players could connect to a single server. The intent was to create a potentially infinite massively multiplayer game framework. This game was named after the original Neverwinter Nights online game, the first graphical massively multiplayer online role-playing game (MMORPG), which operated from 1991 to 1997 on AOL.\nThe original release of Neverwinter Nights includes the game engine, a game campaign that can be played as single player or in multiplayer mode, and on Windows releases, the Aurora toolset used for creating custom content that would run in the same engine. Three expansion packs were subsequently released for the game: Shadows of Undrentide in June 2003; Hordes of the Underdark in December 2003; and Kingmaker in November 2004. BioWare began selling premium modules through an online store in late 2004. The game's success led to a sequel, Neverwinter Nights 2, released on October 31, 2006.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2002-06-18"}, "Neverwinter Nights 2": {"composer": null, "description": "Neverwinter Nights 2 is a role-playing video game developed by Obsidian Entertainment and published by Atari, Inc. It is the sequel to BioWare's Neverwinter Nights, based on the Dungeons & Dragons pencil and paper fantasy role-playing game. Neverwinter Nights 2 utilizes an adaptation of the Dungeons & Dragons 3.5 edition rules. Players create player characters to represent themselves in the game, using the same character creation rules as found in the Dungeons & Dragons game. They may gain the assistance of additional party members, and they eventually acquire a keep that can be used as a base of operations. Neverwinter Nights 2 is set in the Forgotten Realms campaign setting—in and around the city of Neverwinter. The story is mostly unrelated to Neverwinter Nights and follows the journey of an orphaned adventurer investigating a group of mysterious artifacts known as \"silver shards\" and their connection to an ancient, evil spirit known as the King of Shadows.\nNeverwinter Nights 2 went into development in July 2004. This sequel was designed with the Aurora Engine, also used by its predecessor, and the game's toolset was included in the game's release for players to use in designing their own adventures. The game's design team drew upon older role-playing video games, and decided that the player character would have to earn the respect of others by the things the character does. The game was also designed to be playable with other players online in a cooperative fashion. The game was released in October and November 2006. Official multiplayer support for the game was suspended in December 2012. In response, the Neverwinter Nights 2 community developed several initiatives by which players can continue to play the game online.\nReviews of Neverwinter Nights 2 were generally positive. Reviewers were pleased with the changes that had been made from the first game in the series, especially regarding the storyline and party management. The game won GameSpot's Best Story award for 2006. One of the most commonly raised complaints about the game was the presence of numerous technical glitches in its initial release. Two official expansions and one official adventure pack have been released for the game: Mask of the Betrayer in 2007, Storm of Zehir in 2008, and Mysteries of Westgate in 2009.", "developer": ["Obsidian Entertainment"], "genre": "RPG", "date_release": "2006-10-31"}, "Neverwinter Nights: Hordes of the Underdark": {"producer": "Trent Oster", "composer": "Jeremy Soule", "description": "Neverwinter Nights: Hordes of the Underdark is an expansion pack for the role-playing video game Neverwinter Nights produced by BioWare and published by Atari, Inc. The followup to the Shadows of Undrentide expansion, Hordes of the Underdark adds a campaign, prestige classes, and other features. The Windows version also includes new scripting options for the Aurora toolkit.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2003-12-02"}, "Neverwinter Nights: Shadows of Undrentide": {"producer": "Trent Oster", "composer": "Kemal Amarasingham", "description": "Neverwinter Nights: Shadows of Undrentide is an expansion pack for Neverwinter Nights developed by Floodgate Entertainment and BioWare, and published by Atari, Inc. and was released in June 2003. The expansion pack adds a new campaign and new features including new character classes, creatures, feats, and spells, and other nuances such as allowing the player to access and modify their henchman's inventory. The Windows version also included scripting options for the Aurora toolkit.", "developer": ["BioWare", "Floodgate Entertainment"], "genre": "Role-playing", "date_release": "2003-06-21"}, "Next Car Game: Wreckfest": {"description": "Wreckfest is a racing video game developed by Bugbear Entertainment and published by THQ Nordic. Wreckfest is described as the spiritual successor to the FlatOut series and a cross between FlatOut, Destruction Derby and cult 1989 PC racer Street Rod. A notable feature of the game engine is the use of soft-body damage modelling, which enables location-based damage that affects the driving dynamics of vehicles in a realistic fashion. After a four-year long early access phase, the Microsoft Windows version was released in June 2018, with PlayStation 4 and Xbox One versions were released on August 27, 2019 after multiple delays.", "developer": ["Bugbear Entertainment"], "genre": "Racing", "date_release": null}, "Nickelodeon Party Blast": {"description": "Nickelodeon Party Blast is a party game developed by English developer Data Design Interactive and published by French game company Infogrames. Party Blast was released for Xbox in North America on October 30, 2002, and later in PAL regions on December 6, 2002. The Windows version was released in one day later after the release of the Xbox version in North America. The GameCube version was released worldwide on December 6, 2002. A PlayStation 2 version of the game was planned to be released, but it was cancelled for unknown reasons. The game features characters from Nicktoons, including SpongeBob SquarePants, Rugrats, The Adventures of Jimmy Neutron: Boy Genius, Invader Zim, Rocket Power, and The Wild Thornberries, with CatDog as the hosts.", "genre": "Party", "date_release": "2002-10-30"}, "Nier: Automata": {"producer": [null, null], "composer": null, "description": "Nier: Automata is an  action role-playing hack and slash video game developed by PlatinumGames and published by Square Enix. The game was released for the PlayStation 4 and Microsoft Windows in early 2017, with an Xbox One port later in June 2018. Nier: Automata is a sequel to the 2010 video game NieR, a spin-off sequel of the Drakengard series. Set in the midst of a proxy war between machines created by otherworldly invaders and the remnants of humanity, the story follows the battles of a combat android, her companion, and a fugitive prototype. Gameplay combines role-playing elements with action-based combat and mixed genre gameplay similar to that of Nier.\nProduction began in 2014, with series creator Yoko Taro, producer Yosuke Saito, and lead composer Keiichi Okabe returning to their respective roles, as well as Square Enix artist Akihiko Yoshida in charge of character design. The story is based around themes similar to Yoko's earlier works, such as people's impulse to kill and nihilism, while also incorporating issues such as confronting prejudice and escaping difficult situations. The goal was to make a Nier game true to the spirit of the original, while simultaneously crafting a better combat system. As a project entirely new to the developers, the staff at PlatinumGames faced multiple challenges when developing its gameplay and open world environment.\nNier: Automata was met with critical acclaim, with critics praising the game's narrative, characterization, thematic depth, music design, combat system, and mixture of different gameplay genres. Minor criticism was leveled at some of the game's visual and technical problems. By May 2019, the game had sold over four million copies worldwide.", "developer": ["PlatinumGames"], "genre": "Action role-playing", "date_release": "2017-03-17"}, "Night in the Woods": {"composer": null, "description": "Night in the Woods (abbreviated as NITW) is a single-player adventure game. It was developed by Infinite Fall, a studio founded by game designer Alec Holowka and animator/artist Scott Benson, and published by Finji. Secret Lab, an Australian studio, built the game's narrative engine, and are creating the mobile version of the game using their sprite compression systems.It is a story-focused exploration game in which players control a young woman named Mae, who recently dropped out of college and has returned to her hometown to find unexpected changes. The game was funded via the crowdfunding platform Kickstarter, where it eventually earned over 400% of its US$50,000 funding goal.A companion game titled Longest Night was released in December 2013 by Holowka and Benson, along with co-writer Bethany Hockenberry. In December 2014, a second supplemental game was released, titled Lost Constellation.The game was released for Microsoft Windows, macOS, Linux, and PlayStation 4 on February 21, 2017. The Xbox One version was released on December 13, 2017, while a version for the Nintendo Switch was released on February 1, 2018. Versions for iOS are scheduled to arrive in 2019.\nAn extended version of the game, titled the Weird Autumn edition, was released for PC, macOS, Linux, PlayStation 4 and Xbox One on December 13, 2017 and for Nintendo Switch on February 1, 2018. It features new content not seen in the original game, as well as the supplemental games. Night in the Woods received notable critical praise, mostly for its soundtrack, story, dialogue and characters.", "genre": "Adventure", "date_release": "2017-02-21"}, "Ninjabread Man": {"description": "Ninjabread Man is a platform video game by developer and publisher Data Design Interactive. The game was released on the PlayStation 2 and Microsoft Windows in Europe in July 2005. A port for the Wii was released in September 2007 in Europe and Australia, and 3 October in North America. Ninjabread Man was published as part of Data Design Interactive's 'Popcorn Arcade' brand of Wii games.\nThe development of Ninjabread Man began as a re-imagining of the Commodore Amiga classic Zool: Ninja of the Nth Dimension which was largely favourably received on its initial release in 1992.  Zoo Digital Publishing commissioned DDI to re-imagine Zool as a 3D game for eventual release on the PlayStation 2 and the GameCube, however, the publisher was unimpressed with the results and canned the project.  DDI opted to continue with the game, but changing the theme and character for Ninjabread Man.\nNinjabread Man received unanimously negative reviews from critics, being heavily criticized for its controls, camera system, graphics, story, and short length.", "genre": "Platformer", "date_release": "2005-07-23"}, "Nioh": {"producer": "Hisashi Koinuma", "composer": "Yugo Kanno", "description": "Nioh (Japanese: 仁王, Hepburn: Niō, \"benevolent king\") is an action role-playing video game developed by Team Ninja for the PlayStation 4 (PS4). It was first released worldwide in February 2017, and was published by Sony Interactive Entertainment internationally, and Koei Tecmo in Japan. An edition for both PS4 and Microsoft Windows, containing all the game's downloadable content (DLC), was released in November 2017 by Koei Tecmo.\nSet during a fictionalised version of the year 1600, the plot follows the journeys of William, an Irish sailor who pursues the sorcerer Edward Kelley into the final battles of the Sengoku period during Tokugawa Ieyasu's efforts to unify Japan, an effort complicated by the emergence of yōkai that are flourishing in the chaos of war. Gameplay revolves around navigating levels and defeating monsters that have infested an area; combat revolves around stamina or \"Ki\" management and different sword stances that are strong or weak against different enemies.\nNioh began development in 2004 for the PlayStation 3 as part of a multimedia project based on an unfinished Akira Kurosawa script. The project went through a turbulent and prolonged pre-production period, going through multiple revisions until its final version began development in 2014 for the PS4. The story was based on the life of historic Western samurai William Adams, although it was embellished with supernatural elements. Development information was sporadic until 2015, when it was reintroduced to the public.\nAlpha and beta demos were released during 2016, to both gauge public reaction to the title and make adjustments based on feedback. Initially scheduled for a 2016 release, the adjustments pushed the release into the following year. Upon release, Nioh received positive reviews, with praise going to the gameplay and graphics while the story was criticised as lacking or confusing. It reached high positions in sales charts, going on to ship 2.5 million copies worldwide. A sequel for PS4, Nioh 2, is in development.", "developer": ["Team Ninja"], "genre": "Action role-playing", "date_release": "2017-11-07"}, "No More Room in Hell": {"description": "No More Room in Hell is a cooperative first person survival horror video game, created by Matt \"Maxx\" Kazan and initially developed as a modification on Valve Corporation's Source game engine. Set in a zombie apocalypse, the player assumes the role of one of eight remaining survivors, with a focus on co-operation and survival. The game can be played through \"Objective\" or \"Survival\" mode. It is heavily inspired by George Romero's Living Dead series, with the title being a reference to Dawn of the Dead, specifically the line \"When there's no more room in hell, the dead will walk the earth.\", and some characters being references to other films such as American Psycho and The Big Lebowski.\nThe game was first released on October 31, 2011 as a Half-Life 2 mod. It was later officially re-released as a standalone title on October 31, 2013 via Steam Greenlight after having been in development since 2004. It was met with positive reviews.", "genre": "Survival horror", "date_release": "2013-10-31"}}