{"L.A. Noire": {"producer": "Naresh Hirani", "composer": null, "description": "L.A. Noire is a neo-noir detective action-adventure video game developed by Team Bondi and published by Rockstar Games. It was released in May 2011 for PlayStation 3 and Xbox 360, in November 2011 for Microsoft Windows, and in November 2017 for Nintendo Switch, PlayStation 4 and Xbox One. The story is set in Los Angeles in 1947 and follows a Los Angeles Police Department (LAPD) officer, who solves a range of cases across five divisions. Players must investigate crime scenes for clues, follow up leads, and interrogate suspects; the player's success at these activities will impact how much of each case's story is revealed.\nThe open-world design lets players freely roam Los Angeles' open landscape, and its world is navigated on foot or by vehicle. The story is centred on the case sequences, and many missions involve shooting and driving gameplay. It is played through a third-person perspective. L.A. Noire also contains elements found in action-adventure games, such as side missions and a branching storyline. The game uses licensed music provided by an in-game radio, and features an original score.The development of L.A. Noire began in 2004, shortly after the founding of Team Bondi, and was shared between the multiple Rockstar studios around the world. The game was delayed numerous times through its seven-year development, which included a change of publisher and platforms. The working hours and managerial style of the studio was met with public complaints from staff members, and Team Bondi closed shortly after the game's initial release. The development team found influence from the plot and aesthetic elements of film noir—stylistic films made popular in the 1940s and 1950s that share similar visual styles and themes, including crime and moral ambiguity—along with drawing inspiration from real-life crimes of the time for its in-game cases.The game is notable for being the first to use the newly developed MotionScan technology developed by Depth Analysis. MotionScan uses 32 surrounding cameras to capture actors' facial expressions from every angle. The technology is central to the game's interrogation mechanic, as the player is required to use the suspects' reactions to questioning to judge whether or not they are lying. Over twenty hours of voice work was recorded for the game.\nExtensively marketed, L.A. Noire was the first video game to be shown at the Tribeca Film Festival, and received widespread critical acclaim for its advances in storytelling, presentation, and facial animation technology. It had been reported to ship over five million copies worldwide. L.A. Noire: The VR Case Files, a subset of the game's cases for virtual reality supported through the HTC Vive, was released on 15 December 2017.", "developer": ["Team Bondi"], "genre": "Action-adventure", "date_release": "2011-05-17"}, "Lands of Lore: Guardians of Destiny": {"composer": null, "description": "Lands of Lore: Guardians of Destiny, colloquially referred to as Lands of Lore 2, is the critically acclaimed second installment of the Lands of Lore series, a sequel to Lands of Lore: The Throne of Chaos. It brought about a drastic change in gameplay style from its enormously successful predecessor, opting away from the original's D&D turn-based style in favor of more action RPG elements. Guardians of Destiny was released in 1997 and is a real-time, first-person RPG. A sequel, Lands of Lore III, was released in 1999.", "developer": ["Westwood Studios"], "genre": "RPG", "date_release": "1997-09-30"}, "Lands of Lore: The Throne of Chaos": {"producer": "Rick Gush", "composer": null, "description": "Lands of Lore: The Throne of Chaos is a 1993 role-playing video game developed by Westwood Studios and published by Virgin Games for MS-DOS, the NEC PC-9801, and FM Towns. It was the first installment of the Lands of Lore series. The player travels around various environments, collecting items and battling monsters in an attempt to save the kingdom from a witch named Scotia, who has acquired shapeshifting abilities. \nWestwood wanted to create something new after being acquired by Virgin, and it was intended that the game outperform Eye of The Beholder II. Lands of Lore: The Throne of Chaos received generally positive reviews, with reviewers complimenting the graphics and the skill system, but some criticized its combat and repetitiveness. In 1994, the game was re-released on CD, adding voice-overs, including some by Patrick Stewart. Lands of Lore: The Throne of Chaos was followed by a sequel, Lands of Lore: Guardians of Destiny, in 1997.", "developer": ["Westwood Studios"], "genre": "RPG", "date_release": "1993-01-01"}, "Lands of Lore III": {"composer": null, "description": "Lands of Lore III is the third game in the Lands of Lore video game series, a sequel to Lands of Lore: Guardians of Destiny. The game was released after much delay in 1999, by Electronic Arts. The game set uses a first person perspective.", "developer": ["Westwood Studios"], "genre": "RPG", "date_release": "1999-03-03"}, "Lara Croft and the Guardian of Light": {"description": "Lara Croft and the Guardian of Light is an action-adventure game developed by Crystal Dynamics and published by Square Enix for Microsoft Windows, PlayStation 3, Xbox 360, Android and, iOS through digital distribution. It is part of the Tomb Raider series, but unlike previous games, the game does not carry the Tomb Raider brand and has a heavy emphasis on cooperative gameplay. In multiplayer, players take the role as either Lara Croft or a 2,000-year-old Mayan warrior named Totec. They must work together in order to stop the evil spirit Xolotl and retrieve the Mirror of Smoke. A single-player campaign mode is available that does not include the non-playable character AI following or helping Lara.\nIn the United States and United Kingdom, Guardian of Light was released for the Xbox Live Arcade on 18 August 2010; it was released a month later on 28 September for PlayStation Network and Steam. Though local cooperative was available at the initial release for all versions, online cooperative was later added. In North America, on 16 December 2010, the video game was released for iOS devices which included cooperative with Wi-Fi and Bluetooth options. The first downloadable content (DLC) map pack was released for free for a limited time.\nLara Croft and the Guardian of Light was well received by critics. The Xbox 360 version of the game holds an average score of 85/100 and 86.36% on the game aggregate sites Metacritic and GameRankings, respectively. In September 2010, IGN listed Lara Croft and the Guardian of Light fourteenth in their top twenty-five Xbox Live Arcade titles of all time. Critics felt that the game was an excellent fit for Lara Croft. Guardian of Light sold 98,000 copies on Xbox Live in its first six weeks, and as of 22 August 2013, the game has sold more than 1 million copies on all platforms. A sequel titled Lara Croft and the Temple of Osiris was released in 2014 for Microsoft Windows, PlayStation 4 and Xbox One.Lara Croft and the Guardian of Light was the first game in the series to be published by Square Enix.", "developer": ["Crystal Dynamics"], "genre": "Action-adventure", "date_release": "2010-08-18"}, "Layers of Fear": {"composer": "Arkadiusz Reikowski", "description": "Layers of Fear is a psychological horror video game developed and published by Bloober Team for Linux, Microsoft Windows, OS X, PlayStation 4, and Xbox One, which was released worldwide on 16 February 2016.\nIn Layers of Fear, the player controls a psychologically disturbed painter who is trying to complete his magnum opus, as he navigates through a Victorian mansion, with disturbing secrets about the painter being discovered. The gameplay, presented in first person perspective, is heavily story driven and often revolves mostly around puzzle-solving and exploration, as the game intensifies after each level while jump scares occur often. Layers of Fear: Inheritance was released on 2 August 2016 as a direct follow up to the first game. Here the player controls the painter's daughter with the DLC focusing on her apparent relapse into trauma after returning to her old house.\nA definitive port for the Nintendo Switch, entitled Layers of Fear: Legacy, was released on 21 February 2018 and it features, in addition to the Inheritance DLC, Joy-Con, touchscreen, and HD Rumble support. A limited physical retail release for the Nintendo Switch and PlayStation 4, published by Limited Run Games in North America, will be available starting October 2018. In October 2018, a sequel titled Layers of Fear 2  was announced.", "developer": ["Bloober Team"], "genre": "Survival horror", "date_release": "2016-02-16"}, "League of Legends": {"producer": [null, null], "composer": "Christian Linke", "description": "League of Legends (abbreviated LoL) is a multiplayer online battle arena video game developed and published by Riot Games for Microsoft Windows and macOS. The game follows a freemium model and is supported by microtransactions, and was inspired by the Warcraft III: The Frozen Throne mod, Defense of the Ancients.In League of Legends, players assume the role of an unseen \"summoner\" that controls a \"champion\" with unique abilities and battle against a team of other players or computer-controlled champions. The goal is usually to destroy the opposing team's \"Nexus\", a structure that lies at the heart of a base protected by defensive structures, although other distinct game modes exist as well. Each League of Legends match is discrete, with all champions starting off fairly weak but increases in strength by accumulating items and experience over the course of the game. The champions and setting blend a variety of elements, including high fantasy, steampunk, and Lovecraftian horror.\nLeague of Legends was generally well received upon its release in 2009, and has since grown in popularity, with an active and expansive fanbase. By July 2012, League of Legends was the most played PC game in North America and Europe in terms of the number of hours played. In January 2014, over 67 million people played League of Legends per month, 27 million per day, and over 7.5 million concurrently during peak hours. League has among the largest footprints of any game in streaming media communities on platforms such as YouTube and Twitch.tv; it routinely ranks first in the most-watched hours. In September 2016, the company estimated that there are over 100 million active players each month. The game's popularity has led it to expand into merchandise, with toys, accessories, apparel, as well as tie-ins to other media through music videos, web series, documentaries, and books.\nLeague of Legends has an active and widespread competitive scene. In North America and Europe, Riot Games organizes the League Championship Series (LCS), located in Los Angeles and the League of Legends European Championship (LEC), located in Berlin, respectively, each of which consist of 10 professional teams. Similar regional competitions exist in China (LPL), South Korea (LCK), Taiwan/Hong Kong/Macau (LMS), and various other regions. These regional competitions culminate with the annual World Championship. The 2017 World Championship had 60 million unique viewers and a total prize pool of over US$4 million. The 2018 Mid-Season Invitational had an overall peak concurrent viewership of 19.8 million, while the finals had an average concurrent viewership of 11 million.", "developer": ["Riot Games"], "genre": "MOBA", "date_release": "2009-10-27"}, "Legends of Callasia": {"description": null, "developer": ["Boomzap Entertainment"], "genre": "Turn-based strategy", "date_release": "2016-06-10"}, "Lego Batman: The Videogame": {"producer": "Kieran Gaynor", "composer": null, "description": "Lego Batman: The Videogame is a Lego-themed action-adventure video game developed by Traveller's Tales and published by Warner Bros. Interactive Entertainment, released in 2008 for the Xbox 360, PlayStation 2, PlayStation 3, PlayStation Portable, Nintendo DS, OS X, Microsoft Windows and Wii video gaming platforms. It is the first Lego Batman video game. The game is based on the comic book character Batman and the Lego Batman toy line, who also handled marketing and financial aspects of the game.\nThe game is similar to the Lego Star Wars series and Lego Indiana Jones: The Original Adventures, in that it is both a game based on a licensed property, and has environments, objects, and creatures made out of Lego. However, Lego Batman is the first to have an original story. The Mac OS X version of the game was released in April 2009 by Feral Interactive. The game spawned two sequels: Lego Batman 2: DC Super Heroes and Lego Batman 3: Beyond Gotham.", "developer": ["Traveller's Tales"], "genre": "Action-adventure", "date_release": "2008-09-23"}, "Lego Batman 2: DC Super Heroes": {"composer": "Rob Westwood", "description": "Lego Batman 2: DC Super Heroes is a Lego-themed action-adventure video game developed by Traveller's Tales, for the PlayStation 3, PlayStation Vita, Nintendo 3DS, Wii U, Wii, Nintendo DS, Xbox 360, Microsoft Windows, Mac OS X, and iOS. The game is a standalone sequel to Lego Batman: The Videogame and the second Lego Batman video game. Numerous DC characters within the Batman continuity and outside it are playable characters. Lego Batman 2: DC Super Heroes also featured dialogue and an open world to explore, the first in the Traveller's Tales' Lego series to do so. The game was released in North America on 19 June 2012. The Mac OS X version of the game, published by Feral Interactive, was released on 6 September 2012. The Wii U version was released on 21 May 2013.\nA direct sequel titled Lego Batman 3: Beyond Gotham was released in November 2014.", "developer": ["Traveller's Tales"], "genre": "Action-adventure", "date_release": "2012-06-23"}, "Lego Batman 3: Beyond Gotham": {"composer": "Rob Westwood", "description": "Lego Batman 3: Beyond Gotham is a Lego-themed action-adventure video game developed by Traveller's Tales and published by Warner Bros. Interactive Entertainment in November 2014 for multiple platforms. It is the third installment in the Lego Batman video game series and a sequel to Lego Batman: The Videogame and Lego Batman 2: DC Super Heroes. A port was released to mobile phones, excluding the numeral in the title.\nLego Batman 3: Beyond Gotham was met with a generally mixed reception upon release. Praise was directed at the amount of content, the game's humour, and the characters, while criticism was directed at technical issues, poor AI, celebrity cameos, conflicting gameplay aspects, and the game's overall direction.\nA spin-off, Lego DC Super-Villains was released on October 16, 2018.", "developer": ["Traveller's Tales"], "genre": "Action-adventure", "date_release": "2014-11-11"}, "Lego Rock Raiders": {"producer": "Stewart Green", "composer": null, "description": "Lego Rock Raiders was a Lego theme focused on mining equipment that released in 1999 and 2000. It was the only underground-based Lego theme before Lego Power Miners. The theme, while short-lived, featured sixteen construction sets and numerous story-related media, including three books and a video game.\nThe premise of the theme involves the crew of the space ship LMS Explorer. The vessel is damaged and drained of power after wandering into an asteroid field, and is pulled into a wormhole that flings it into a distant galaxy. The Rock Raiders scan the nearest planet and find that it is abundant with energy crystals. The Rock Raiders, while repairing the ship, must venture down inside the dangerous caverns in the planet to mine the precious energy crystals to power the ship.\n\n", "genre": "Real-time strategy", "date_release": "1999-11-15"}, "Lego Star Wars: The Video Game": {"composer": "David Whittaker", "description": "Lego Star Wars: The Video Game is a Lego-themed, action-adventure video game based on the Lego Star Wars line of toys, and the first installment in the Lego video game franchise developed by Traveller's Tales, which would develop all future Lego titles from that point on. It was first released on 29 March 2005, and is a video game adaptation of the Star Wars prequel trilogy: The Phantom Menace (1999), Attack of the Clones (2002) and Revenge of the Sith (2005), with a bonus segment from A New Hope (1977).\nIt is the only Traveller's Tales developed Lego title that was rated Everyone by the ESRB for consoles, with most subsequent handheld versions of Traveller's Tales LEGO video games receiving such a rating; while further console versions of Traveller's Tales LEGO video games received the Everyone 10+ rating.\nIt was developed by Traveller's Tales for the Microsoft Xbox,  Sony PlayStation 2 video game consoles, and Microsoft Windows personal computers, with Griptonite Games developing the Nintendo Game Boy Advance version. These initial versions were published in April 2005. A Mac version, developed by Aspyr, was released in August 2005. A Nintendo GameCube version of the game was released on 26 October 2005. All versions were published by Eidos Interactive and Giant Interactive Entertainment, with Star Wars assets licensed through LucasArts.", "developer": ["Traveller's Tales"], "genre": "Action-adventure", "date_release": "2005-03-29"}, "Leisure Suit Larry": {"description": "Leisure Suit Larry is an adult-themed video game series created by Al Lowe. It was published by Sierra from 1987 to 2009, then by Codemasters starting in 2009. The first six Leisure Suit Larry titles, along with Magna Cum Laude and Love for Sail Mobile, were distributed by Universal Pictures Home Entertainment (previously distributed by Activision Blizzard), while Box Office Bust and Reloaded were distributed by Codemasters. Currently the games are being published and distributed by Assemble Entertainment.\nThe games follow Larry Laffer, a balding, double entendre-speaking, leisure suit-wearing man in his 40s. The stories generally revolve around him attempting, usually unsuccessfully, to seduce attractive women.\n\n", "developer": ["Sierra Entertainment", "High Voltage Software", "Team17"], "genre": "Graphic adventure", "date_release": "1987-06-05"}, "Lineage": {"composer": "Joey Newman", "description": null, "developer": ["NCSOFT"], "genre": "MMORPG", "date_release": "1998-09-03"}, "London Taxi: Rush Hour": {"description": "London Taxi: Rush Hour (stylized as London Taxi: RusHour) is a budget title from Data Design Interactive and Metro 3D released across multiple platforms.", "genre": "Driving\n", "date_release": "2006-06-23"}, "Lovely Planet": {"composer": "Calum Bowen", "description": "Lovely Planet is a first-person shooter platform video game developed by Indian indie developer Quicktequila and published by tinyBuild. It was released for Microsoft Windows, OS X and Linux in July 2014, and later for Xbox One in January 2016, and the PlayStation 4 and Wii U in April 2016.The game received mixed reviews from critics, with praise given its visuals and soundtrack, but criticism for its presentation and level of difficulty.", "genre": "First-person shooter", "date_release": "2014-07-31"}, "Luftrausers": {"composer": "Jukio \"Kozilek\" Kallio", "description": "Luftrausers is a shoot 'em up video game developed by Netherlands-based indie developer studio Vlambeer and published by Devolver Digital for Microsoft Windows, OS X, Linux, PlayStation 3 and PlayStation Vita. It was released on March 18, 2014 and ported to Android by General Arcade on December 20, 2014. A demake of the game, titled LuftrauserZ, was developed by Paul Koller for Commodore 64, Commodore 128 and Commodore 64 Games System, and released by RGCD and Vlambeer on 8 December 2017.", "developer": ["Vlambeer"], "genre": "Shoot 'em Up", "date_release": "2014-03-18"}}