{"The Elder Scrolls: Arena": {"producer": null, "composer": "Eric Heberling", "description": "The Elder Scrolls: Arena is an action role-playing video game developed and published by Bethesda Softworks. The first game in the Elder Scrolls series, it was released for MS-DOS on March 25, 1994. Like its sequels, Arena takes place on the continent of Tamriel, complete with wilderness, dungeons, and a spell creation system that allows players to mix various spell effects.\nIn 2004, a downloadable version of the game was made available free of charge as part of the tenth anniversary of the series.", "developer": ["Bethesda Softworks"], "genre": "Action role-playing", "date_release": "1994-01-01"}, "The Elder Scrolls Adventures: Redguard": {"composer": null, "description": "The Elder Scrolls Adventures: Redguard is an action-adventure video game developed and published by Bethesda Softworks with a third person style, set in the world of The Elder Scrolls.", "developer": ["Bethesda Softworks"], "genre": "Action role-playing", "date_release": "1998-10-31"}, "The Elder Scrolls II: Daggerfall": {"producer": "Christopher Weaver", "composer": "Eric Heberling", "description": "The Elder Scrolls II: Daggerfall is an open-world action role-playing video game developed and published by Bethesda Softworks. The sequel to The Elder Scrolls: Arena and the second installment in the Elder Scrolls series, it was released on September 20, 1996 for MS-DOS. On July 9, 2009, the game was made available as a free, legal download on Bethesda's website to commemorate the fifteenth anniversary of The Elder Scrolls franchise.", "developer": ["Bethesda Softworks"], "genre": "Action role-playing", "date_release": "1996-08-31"}, "The Elder Scrolls III: Bloodmoon": {"description": "The Elder Scrolls III: Bloodmoon is the second expansion pack for The Elder Scrolls III: Morrowind, developed by Bethesda Game Studios. It was originally released as an expansion set for Microsoft Windows and is included within the Morrowind: Game of the Year edition for Xbox.\nUnlike the first expansion Tribunal, which added a city separate from the world map consisting of interior cells, Bloodmoon adds a large new island to the original world map, a cold northern territory named Solstheim. Rather than the Dunmer (dark elves) that are the indigenous race in the nearby Vvardenfell, Solstheim is populated largely by the Nord race. This is largely because the island sits more or less astride the border between Morrowind and the Nord homeland of Skyrim.\nThis expansion adds new enemies, the East Empire Company as a joinable guild, and the possibility to become a werewolf, akin to the inclusion of vampires seen in Morrowind. Bloodmoon also uses larger and more detailed environments, including snowfall, thus raising the computer hardware requirements, though the ash storms of the original game are much more graphically demanding than the snow of Bloodmoon.\nAs with Morrowind and Tribunal, Bloodmoon has many side-quests to finish and many caves to explore aside from its main quest. Unlike Tribunal, which is intended to be played after the completion of Morrowind's main quest, Bloodmoon's main-quest is self-contained within the expansion.", "developer": ["Bethesda Game Studios"], "genre": "Action role-playing", "date_release": "2003-07-03"}, "The Elder Scrolls III: Morrowind": {"producer": null, "composer": "Jeremy Soule", "description": "The Elder Scrolls III: Morrowind is an open-world action role-playing video game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the third installment in The Elder Scrolls series, following The Elder Scrolls II: Daggerfall, and was released in 2002 for Microsoft Windows and Xbox. The main story takes place on Vvardenfell, an island in the Dunmer (Dark Elf) province of Morrowind, part of the continent of Tamriel. The central quests concern the deity Dagoth Ur, housed within the volcanic Red Mountain, who seeks to gain power and break Morrowind free from Imperial reign.Although primarily a fantasy game, with many gameplay elements and Western medieval and fantasy fiction tropes inspired by Dungeons & Dragons and previous RPGs, it also features some steampunk elements and drew much inspiration from Middle Eastern and East Asian art, architecture, and cultures. Morrowind was designed with an open-ended, freeform style of gameplay in mind, with less of an emphasis on the main plot than its predecessors. This choice received mixed reviews by some members of the gaming press, though such feelings were tempered by reviewers' appreciation of Morrowind's expansive, detailed game world.\nMorrowind achieved both critical and commercial success, winning various awards including Game of the Year and selling over four million copies worldwide by 2005. The game spawned two expansion packs: Tribunal and Bloodmoon. Both were repackaged into a full set (along with several minor add-ons) and titled Morrowind: Game of the Year Edition, which was released in October 2003. The open-source, free software alternative game engine OpenMW permits users of Linux and macOS, as well as Windows, to play the game natively, and with support for optional higher-end graphics than the original Bethesda engine. It requires an installation of the original game, as it uses the Bethesda game data files, and supports many third-party mods.", "developer": ["Bethesda Game Studios"], "genre": "Action role-playing", "date_release": "2002-05-01"}, "The Elder Scrolls III: Tribunal": {"producer": "Ashley Cheng", "description": "The Elder Scrolls III: Tribunal is the first expansion for Bethesda Game Studios' The Elder Scrolls III: Morrowind. It takes place in the temple-city of Mournhold, the capital of Morrowind, located in the larger city of Almalexia. The title refers to the three \"Living Gods\", known as the Tribunal.", "developer": ["Bethesda Game Studios"], "genre": "Action role-playing", "date_release": "2002-11-06"}, "The Elder Scrolls IV: Oblivion": {"producer": null, "composer": "Jeremy Soule", "description": "The Elder Scrolls IV: Oblivion is an open-world action role-playing video game developed by Bethesda Game Studios and published by Bethesda Softworks and the Take-Two Interactive division 2K Games. It is the fourth installment in The Elder Scrolls action fantasy series, following The Elder Scrolls III: Morrowind and preceding The Elder Scrolls V: Skyrim. The game was released for Microsoft Windows and Xbox 360 in March 2006, and on PlayStation 3 in March 2007, with a mobile version of the game released on May 2, 2006. Taking place within the fictional province of Cyrodiil, Oblivion's main story revolves around the player character's efforts to thwart a fanatical cult known as the \"Mythic Dawn\" that plans to open portal gates to a demonic realm known as \"Oblivion\". The game continues the open-world tradition of its predecessors by allowing the player to travel anywhere in the game world at any time and to ignore or postpone the main storyline indefinitely. A perpetual objective for players is to improve their character's skills, which are numerical representations of certain abilities. Early in the game, seven skills are selected by the player as major skills for their character, with those remaining termed as minor skills.\nDevelopment for Oblivion began in 2002, directly after the release of Morrowind, opting for tighter pacing in gameplay and greater plot focus than in past titles. To design the graphics, Bethesda used an improved Havok physics engine, high-dynamic-range lighting, procedural content generation tools that allowed developers to quickly create detailed terrains, and the Radiant AI system, which enabled non-player characters (NPCs) to make choices and engage in behaviors more complex than in past titles. The game features fully voiced NPCs—a first for the series—and the music of award-winning composer Jeremy Soule.\nUpon release, Oblivion was well received by critics and has won a number of industry and publication awards. It was praised for its impressive graphics, expansive game world, and schedule-driven NPCs, and is now considered one of the greatest games ever made. It was successful both commercially and critically. Following a number of smaller content releases, Bethesda released two expansion packs for the game, Knights of the Nine and Shivering Isles, which were bundled with The Elder Scrolls IV: Oblivion Game of the Year Edition which was released in 2007, and later re-released as a fifth-anniversary edition in 2011.", "developer": ["Bethesda Game Studios", "4J Games", "Superscape"], "genre": "Action role-playing", "date_release": "2006-03-20"}, "The Elder Scrolls V: Skyrim": {"producer": [null, null], "composer": "Jeremy Soule", "description": "The Elder Scrolls V: Skyrim is an action role-playing video game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the fifth main installment in The Elder Scrolls series, following The Elder Scrolls IV: Oblivion, and was released worldwide for Microsoft Windows, PlayStation 3, and Xbox 360 on November 11, 2011.\nThe game's main story revolves around the player character's quest to defeat Alduin the World-Eater, a dragon who is prophesied to destroy the world. The game is set 200 years after the events of Oblivion and takes place in Skyrim, the northernmost province of Tamriel. Over the course of the game, the player completes quests and develops the character by improving skills. The game continues the open-world tradition of its predecessors by allowing the player to travel anywhere in the game world at any time, and to ignore or postpone the main storyline indefinitely.\nSkyrim was developed using the Creation Engine, rebuilt specifically for the game. The team opted for a unique and more diverse open world than Oblivion's Imperial Province of Cyrodiil, which game director and executive producer Todd Howard considered less interesting by comparison. The game was released to critical acclaim, with reviewers particularly mentioning the character advancement and setting, and is considered to be one of the greatest video games of all time. Nonetheless it received some criticism, predominantly for its melee combat and numerous technical issues present at launch. The game shipped over seven million copies to retailers within the first week of its release, and over 30 million copies on all platforms as of November 2016, making it one of the highest selling video games in history.\nThree downloadable content (DLC) add-ons were released—Dawnguard, Hearthfire, and Dragonborn—which were repackaged into The Elder Scrolls V: Skyrim – Legendary Edition and released in June 2013. The Elder Scrolls V: Skyrim – Special Edition is a remastered version of the game released for Windows, Xbox One, and PlayStation 4 in October 2016. It includes all three DLC expansions and a graphical upgrade, along with additional features such as modding capabilities on consoles. Versions were released in November 2017 for the Nintendo Switch and PlayStation VR, and a stand-alone virtual reality (VR) version for Windows was released in April 2018.", "developer": ["Bethesda Game Studios"], "genre": "Action role-playing", "date_release": "2011-11-11"}, "An Elder Scrolls Legend: Battlespire": {"description": "An Elder Scrolls Legend: Battlespire is an action role-playing video game developed and published by Bethesda Softworks, set in the world of The Elder Scrolls.", "developer": ["Bethesda Softworks"], "genre": "Action role-playing", "date_release": "1997-11-30"}, "Emily Wants to Play": {"description": "Emily Wants To Play is a survival horror video game created by indie developer Shawn Hitchcock. The game was released for Microsoft Windows and OS X on December 10, 2015. It was then released for iOS and Android on January 31, 2016, PlayStation 4 on August 9, 2016, and Xbox One on September 9, 2016. Emily Wants to Play was adapted to play in virtual reality by using the HTC Vive or Oculus Rift on August 25, 2016. A sequel titled Emily Wants to Play Too was released on December 2017.The player takes the role of a pizza delivery man that has been trapped in a house by a young girl named Emily and her three dolls. Each level of the game is represented by a different hour of the night from 11pm until 6am. During these levels, various combinations of the dolls and Emily appear. The player must learn how to interact with Emily and her dolls in order to survive the night.", "genre": "Survival horror", "date_release": "2015-12-10"}, "Empire: Total War": {"producer": "Ross Manton", "composer": "Richard Beddow", "description": "Empire: Total War is a turn-based strategy and real-time tactics video game developed by Creative Assembly and published by Sega. The fifth installment in the Total War series, the game was released in 2009. The game, which focuses on the early modern period of the 18th century, was announced at the Leipzig Games Convention in August 2007. The Mac OS X version of the game was released by Feral Interactive on 10 June 2014. The Linux version was released, also by Feral Interactive, on 8 December 2014.\nPlayers choose an 18th-century faction and set out to achieve domination over the known world through military force, diplomacy, espionage and economics. The interface and play are similar to earlier Total War titles: although the campaign element of the game is turn-based, players can direct battles in real-time. Empire: Total War is the first game in the series to allow naval battles to be conducted in real-time. In addition to the standard campaign mode, a special campaign follows the development of the United States from the settlement of Jamestown to the American War of Independence. Players may also recreate several historical battles from the early modern era, such as the Battle of Fontenoy, Battle of Rossbach, Battle of Brandywine Creek and Battle of Lagos.\nEmpire: Total War was met with universal acclaim; several critics commended it as one of the foremost strategy titles of recent times. Praise was bestowed upon the extensive strategic breadth, accurate historical challenges and visual effects. The real-time land battles, with a far greater focus on gunpowder weaponry than earlier Total War titles, were considered successful. Criticisms focused on shortcomings with the game's artificial intelligence and on the real-time naval battles being difficult to control and co-ordinate. The game was a commercial success, topping sales charts within a week of release; nevertheless, several Creative Assembly employees later commented on various issues caused by a perceived early release.\nOn November 18, 2018, Empire: Total War (along with Medieval II and Napoleon) was rebranded as Total War: EMPIRE – Definitive Edition, making all DLC free alongside the core game, and thus giving access to players who already owned a copy.", "developer": ["The Creative Assembly", "Feral Interactive"], "genre": "RTS", "date_release": "2009-03-03"}, "Empire Earth": {"description": "Empire Earth is a series of real-time strategy video games developed by Stainless Steel Studios and Mad Doc Software, and published by Sierra Entertainment, Activision, and Vivendi. The games in the series are historical RTS games that are similar to Age of Empires. Rick Goodman, who designed Empire Earth and Empires: Dawn of the Modern World, was one of the lead designers of Age of Empires. The games use the Titan and Titan 2.0 engine, which was sold after SSSI closed.", "developer": ["Stainless Steel Studios"], "genre": "RTS", "date_release": "2001-11-12"}, "Empire Earth II": {"composer": "Michael G. Shapiro", "description": "Empire Earth II is a real-time strategy video game developed by Mad Doc Software and published by Vivendi Universal Games on April 26, 2005. It is a sequel to Empire Earth, which was developed by the now-defunct Stainless Steel Studios. The game features 15 epochs, 14 different civilizations and has three playable campaigns: a Korean, German, and American one, as well as several other playable scenarios. The game received a positive reaction, earning a 79% average rating on GameRankings.", "developer": ["Mad Doc Software"], "genre": "RTS", "date_release": "2005-04-26"}, "Empire Earth III": {"composer": "Michael Gordon Shapiro", "description": "Empire Earth III is a real-time strategy video game developed by Mad Doc Software and published by Vivendi Games, released on November 6, 2007. It is the latest installment of the Empire Earth series.\nEmpire Earth III contains five epochs, fewer than other games in the series but covering roughly the same time period. The game features three factions: Middle Eastern, Western, and Far Eastern. Each faction comprises unique buildings, units, and technologies.\nThe game has generally received widespread negative reviews.", "developer": ["Mad Doc Software"], "genre": "RTS", "date_release": "2007-11-06"}, "Empires Apart": {"description": "Empires Apart is a real-time strategy game developed by Italian studio DESTINYbit and published by Slitherine. Empires Apart was released March 29, 2018.", "genre": "RTS\n", "date_release": "2018-03-29"}, "Enclave": {"producer": "Nick Kyriakidis", "composer": null, "description": "An enclave is a territory, or a part of a territory, that is entirely surrounded by the territory of one other state. Territorial waters have the same sovereign attributes as land, and enclaves may therefore exist within territorial waters.An exclave is a portion of a state or territory geographically separated from the main part by surrounding alien territory (of one or more states). Many exclaves are also enclaves. Enclave is sometimes used improperly to denote a territory that is only partly surrounded by another state. Vatican City and San Marino, enclaved by Italy, Lesotho, enclaved by South Africa, and Nagorno-Karabakh, enclaved by Azerbaijan, are completely enclaved states. Unlike an enclave, an exclave can be surrounded by several states. The Azerbaijani exclave of Nakhchivan is an example of an exclave.\nSemi-enclaves and semi-exclaves are areas that, except for possessing an unsurrounded sea border (a coastline contiguous with international waters), would otherwise be enclaves or exclaves. Enclaves and semi-enclaves can exist as independent states (Monaco, Gambia and Brunei are semi-enclaves), while exclaves always constitute just a part of a sovereign state (like the Kaliningrad Oblast).A pene-enclave is a part of the territory of one country that can be conveniently approached—in particular, by wheeled traffic—only through the territory of another country. Pene-enclaves are also called functional enclaves or practical enclaves. Many pene-exclaves partially border their own territorial waters (i.e., they are not surrounded by other nations' territorial waters), such as Point Roberts, Washington. A pene-enclave can also exist entirely on land, such as when intervening mountains render a territory inaccessible from other parts of a country except through alien territory. A commonly cited example is the Kleinwalsertal, a valley part of Vorarlberg, Austria, that is accessible only from Germany to the north.", "developer": ["Starbreeze Studios"], "genre": "Action", "date_release": "2003-03-10"}, "Endless Space": {"description": "Endless Space is a turn-based strategy, science fiction 4X game  developed by Amplitude Studios released on July 4, 2012, for Microsoft Windows and August 31, 2012 for Mac OS X. It sold over 500,000 units.", "developer": ["Amplitude Studios"], "genre": "4X", "date_release": "2012-07-04"}, "Epic Battle Fantasy": {"description": null, "genre": "Role-playing", "date_release": "2009-03-01"}, "Epic Battle Fantasy 2": {"description": null, "genre": "Role-playing", "date_release": "2009-08-20"}, "Epic Battle Fantasy 3": {"description": null, "genre": "Role-playing", "date_release": "2010-09-12"}, "Epic Battle Fantasy 4": {"description": "Final Fantasy VII Remake is an upcoming action role-playing game developed and published by Square Enix for the PlayStation 4. It is the first part of a series of multiple releases and is scheduled for 3 March 2020. The game is a remake of the 1997 PlayStation game Final Fantasy VII, following mercenary Cloud Strife as he, and eco-terrorist group AVALANCHE, battle against the corrupt Shinra megacorporation and the rogue, former Shinra soldier, Sephiroth. Gameplay is planned to combine real-time action similar to Dissidia Final Fantasy with other strategic elements.\nThe remake was announced following years of rumors and fan requests. Key staff members returned to help with Remake: original character designer Tetsuya Nomura returned as both director and main character designer, original director Yoshinori Kitase acted as producer, and Kazushige Nojima returned to write new material. Due to the scale of the project, the team decided to release Remake as a series of games so no original content would be cut. They also decided to add new content and adjust the original character designs to balance between realism and stylization.", "genre": "Role-playing", "date_release": "2013-09-12"}, "Euro Truck Simulator": {"description": "Euro Truck Simulator 2 (commonly abbreviated as ETS 2) is a vehicle simulation game developed and published by SCS Software for Microsoft Windows, Linux, and macOS and was initially released as open development on 19 October 2012. The game is a direct sequel to the 2008 game Euro Truck Simulator and it is the second video game in the Truck Simulator series. The player can drive one of a choice of articulated trucks across a depiction of Europe, picking up cargo from various locations and delivering it. As the game progresses, it is possible for the player to buy more vehicles and depots, as well as hire other drivers to work for them.\nThe game has sold over 5 million units on Steam as of July 2019, according to the metrics website Steam Spy.", "developer": ["SCS Software"], "genre": "Simulator", "date_release": "2008-08-29"}, "Euro Truck Simulator 2": {"description": "Euro Truck Simulator 2 (commonly abbreviated as ETS 2) is a vehicle simulation game developed and published by SCS Software for Microsoft Windows, Linux, and macOS and was initially released as open development on 19 October 2012. The game is a direct sequel to the 2008 game Euro Truck Simulator and it is the second video game in the Truck Simulator series. The player can drive one of a choice of articulated trucks across a depiction of Europe, picking up cargo from various locations and delivering it. As the game progresses, it is possible for the player to buy more vehicles and depots, as well as hire other drivers to work for them.\nThe game has sold over 5 million units on Steam as of July 2019, according to the metrics website Steam Spy.", "developer": ["SCS Software"], "genre": "Simulator", "date_release": "2012-10-19"}, "Europa Universalis": {"producer": "Henrik Strandberg", "description": "Europa Universalis is a grand strategy video game developed by Paradox Development Studio and published in 2000 by Strategy First.", "developer": ["Paradox Development Studio"], "genre": "Grand strategy", "date_release": "2000-03-14"}, "Europa Universalis II": {"producer": null, "description": "Europa Universalis II is a grand strategy game developed by Paradox Development Studio and published by Strategy First, based on world history spanning a timeline between 1419 through 1820. It was released on December 11, 2001.", "developer": ["Paradox Development Studio"], "genre": "Grand strategy", "date_release": "2001-11-12"}, "Europa Universalis III": {"producer": "Johan Andersson", "composer": "Andreas Waldetoft", "description": "Europa Universalis III is a grand strategy video game developed by Paradox Development Studio and published by Paradox Interactive. The game was released for Microsoft Windows in January 2007, and was later ported to OS X by Virtual Programming in November 2007.The player controls a nation and handles matters concerning war, diplomacy, trade, and economy. The original game without expansions starts in 1453, right after the Fall of Constantinople, and continues to 1789, just past the beginning of the French Revolution. The expansion Napoleon's Ambition extends the end game year forward to 1821, whereas the expansion In Nomine moves the starting year back to 1399, making it the longest as far as gameplay time in the series thus far.\nEuropa Universalis III was the first to use Paradox's new 3D engine, Clausewitz Engine, that required user systems to meet the Pixel Shader 2.0 specification. The map has 1,700 land and sea provinces encompassing most of the world, with 250 playable historical nations. The game also uses elements of other Paradox games such as Crusader Kings, Victoria, and Hearts of Iron II.", "developer": ["Paradox Development Studio"], "genre": "Grand strategy", "date_release": "2007-01-23"}, "Europa Universalis IV": {"producer": "Linda Kiby", "composer": "Andreas Waldetoft", "description": "Europa Universalis IV is a grand strategy video game in the Europa Universalis series, developed by Paradox Development Studio and published by Paradox Interactive. The game was released on 13 August 2013. It is a strategy game where players can control a nation from the Late Middle Ages through the Early modern period (1444 to 1821 AD), conducting trade, administration, diplomacy, colonization and warfare.", "developer": ["Paradox Development Studio"], "genre": "Grand strategy", "date_release": "2013-08-13"}, "Eve Online": {"producer": "Andie Nordgren", "description": "Eve Online (stylised EVE Online) is a space-based, persistent world massively multiplayer online role-playing game (MMORPG) developed and published by CCP Games. Players of Eve Online can participate in a number of in-game professions and activities, including mining, piracy, manufacturing, trading, exploration, and combat (both player versus environment and player versus player). The game contains a total of 7,800 star systems that can be visited by players.The game is renowned for its scale and complexity with regards to player interactions –  in its single, shared game world, players engage in unscripted economic competition, warfare, and political schemes with other players. The Bloodbath of B-R5RB, a battle involving thousands of players in a single star system, took 21 hours and was recognized as one of the largest and most expensive battles in gaming history. Eve Online was exhibited at the Museum of Modern Art with a video including the historical events and accomplishments of the playerbase.Eve Online was released in North America and Europe in May 2003. It was published from May to December 2003 by Simon & Schuster Interactive, after which CCP purchased the rights and began to self-publish via a digital distribution scheme. On January 22, 2008, it was announced that Eve Online would be distributed via Steam. On March 10, 2009, the game was again made available in boxed form in stores, released by Atari, Inc.  In February 2013, Eve Online reached over 500,000 subscribers. On November 11, 2016, Eve Online added a limited free-to-play version.", "developer": ["CCP Games"], "genre": "Space flight simulator game", "date_release": "2003-05-06"}, "Event 0": {"description": "Event[0] is a first-person science fiction exploration video game developed and published by Ocelot Society. It was released on September 14, 2016 for both Microsoft Windows and macOS.", "developer": ["Ocelot Society"], "genre": "Adventure", "date_release": "2016-09-14"}, "Eye of the Beholder": {"composer": null, "description": "Eye of the Beholder is a role-playing video game for personal computers and video game consoles developed by Westwood Associates. It was published by Strategic Simulations, Inc. in 1991 for the DOS operating system and later ported to the Amiga, the Sega CD and the SNES. The Sega CD version features a soundtrack composed by Yuzo Koshiro. A port to the Atari Lynx handheld was developed by NuFX in 1993, but was not released. In 2002 the game was an adaptation of the same name was developed by Pronto Games for the Game Boy Advance.\nThe game has two sequels, Eye of the Beholder II: The Legend of Darkmoon, also released in 1991, and Eye of the Beholder III: Assault on Myth Drannor, released in 1993. The third game, however, was not developed by Westwood, which had been acquired by Virgin Interactive in 1992 and created the Lands of Lore series instead.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1990-04-16"}, "Eye of the Beholder II: The Legend of Darkmoon": {"composer": "Frank Klepacki", "description": "Eye of the Beholder II: The Legend of Darkmoon is a 1991 role-playing video game and the sequel to the first Eye of the Beholder. It used a modified version of the first game's engine, added outdoor areas and greatly increased the amount of interaction the player had with their environment, along with substantially more role-playing aspects to the game. A sequel, Eye of the Beholder III: Assault on Myth Drannor, was released in 1993.", "developer": ["Westwood Associates"], "genre": "Fantasy", "date_release": "1991-12-12"}, "Eye of the Beholder III: Assault on Myth Drannor": {"producer": "Nicholas Beliaeff", "composer": "Mason Fisher", "description": "Eye of the Beholder III: Assault on Myth Drannor is a 1993 role-playing video game and the sequel to Eye of the Beholder and Eye of the Beholder II: The Legend of Darkmoon.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1992-08-03"}}