{"I.G.I.-2: Covert Strike": {"composer": "Kim M. Jensen", "description": "I.G.I.-2: Covert Strike, known in the PAL region as Project I.G.I. 2, is a tactical shooter computer game developed by Innerloop Studios and released by Codemasters in 2003. The game is a stealth-based first person shooter. It is the sequel to Innerloop's Project I.G.I.. The original, published by Eidos Interactive, offered only single-player play, and no game saves. Covert Strike added multiplayer play and limited save game capability. Chris Ryan, a former Special Air Service operative best known for being the lone successful escapee of Bravo Two Zero, served as a consultant to the game.\nThe game's plot features a rogue Chinese General, \"Wu Xing\" as the primary antagonist. Xing orchestrates various events (such as armed robbery of advanced prototype technology from the Russian mafia) in order to get electromagnetic pulse (EMP) weaponry on a space rocket that he has launch control over.\nThe game was banned in China after six months of sales (having passed censor inspection with an incomplete copy of the game that lacked the final six levels of Chinese content), because it was perceived to damage the Chinese army's image.", "developer": ["Innerloop Studios"], "genre": "Stealth", "date_release": "2003-03-03"}, "Icewind Dale": {"producer": null, "composer": "Jeremy Soule", "description": "Icewind Dale is a role-playing video game developed by Black Isle Studios and originally published by Interplay Entertainment for Windows in 2000 and by MacPlay for the Macintosh in 2002 (both the Classic Mac OS and OS X). The game takes place in the Dungeons & Dragons Forgotten Realms campaign setting and the region of Icewind Dale, and utilises the 2nd edition ruleset. The story follows a different set of events than those of R. A. Salvatore's The Icewind Dale Trilogy novels: in the game, an adventuring party becomes enlisted as a caravan guard while in Icewind Dale, in the wake of strange events, and eventually discover a plot that threatens the Ten Towns of Icewind Dale and beyond.\nIcewind Dale received positive reviews, being praised for its musical score and gameplay. It was a commercial success, with sales above 400,000 units worldwide by early 2001. An expansion, Icewind Dale: Heart of Winter, was released in 2001, and a sequel, Icewind Dale II, followed in 2002. A remake by Overhaul Games, entitled Icewind Dale: Enhanced Edition, was published for several platforms in 2014.", "developer": ["Black Isle Studios"], "genre": "RPG", "date_release": "2000-06-29"}, "Icewind Dale II": {"producer": "Darren Monahan", "composer": "Inon Zur", "description": "Icewind Dale II is a role-playing video game developed by Black Isle Studios and published by Interplay Entertainment, released on August 27, 2002. Like its 2000 predecessor Icewind Dale, the game is set in the Forgotten Realms fantasy setting in the Icewind Dale region. The player assumes control of a group of mercenaries in a war between the Ten Towns of Icewind Dale and a coalition of persecuted races and religions.\nThe game is designed as an action-oriented alternative to other Infinity Engine games, with less emphasis on exploration and story. It uses a real-time adaptation of the Dungeons & Dragons (D&D) Third Edition ruleset. The Infinity Engine was modified to comply with the Third Edition, but the team was forced to remove certain rules because of the engine's outdated nature. It was the final game to be developed using the Infinity Engine.\nThe game was well received by critics, who praised its combat, pacing, and use of the Third Edition rules. However, some reviewers felt that the graphics and engine had become outdated, and could not compete with its contemporaries.", "developer": ["Black Isle Studios"], "genre": "RPG", "date_release": "2002-08-27"}, "Identity": {"description": null, "genre": "MMORPG"}, "Insurgency": {"composer": "Rich Douglas", "description": "An insurgency is a rebellion against authority (for example, an authority recognized as such by the United Nations) when those taking part in the rebellion are not recognized as belligerents (lawful combatants). An insurgency can be fought via counter-insurgency warfare, and may also be opposed by measures to protect the population, and by political and economic actions of various kinds and propaganda aimed at undermining the insurgents' claims against the incumbent regime. As a concept, insurgency's nature is ambiguous.\nNot all rebellions are insurgencies. There have been many cases of non-violent rebellions, using civil resistance, as in the People Power Revolution in the Philippines in the 1980s that ousted President Marcos and the Egyptian Revolution of 2011. Where a revolt takes the form of armed rebellion, it may not be viewed as an insurgency if a state of belligerency exists between one or more sovereign states and rebel forces. For example, during the American Civil War, the Confederate States of America was not recognized as a sovereign state, but it was recognized as a belligerent power, and thus Confederate warships were given the same rights as United States warships in foreign ports.When insurgency is used to describe a movement's unlawfulness by virtue of not being authorized by or in accordance with the law of the land, its use is neutral. However, when it is used by a state or another authority under threat, \"insurgency\" often also carries an implication that the rebels' cause is illegitimate, whereas those rising up will see the authority of the state as being illegitimate. Criticisms of widely held ideas and actions about insurgency started to occur in works of the 1960s; they are still common in recent studies.Sometimes there may be one or more simultaneous insurgencies (multipolar) occurring in a country. The Iraq insurgency is one example of a recognized government versus multiple groups of insurgents. Other historic insurgencies, such as the Russian Civil War, have been multipolar rather than a straightforward model made up of two sides. During the Angolan Civil War there were two main sides: MPLA and UNITA. At the same time, there was another separatist movement for the independence of the Cabinda region headed up by FLEC. Multipolarity extends the definition of insurgency to situations where there is no recognized authority, as in the Somali Civil War, especially the period from 1998 to 2006, where it broke into quasi-autonomous smaller states, fighting among one another in changing alliances.", "developer": ["New World Interactive"], "genre": "First-person shooter", "date_release": "2014-01-22"}, "Insurgency: Sandstorm": {"description": "Insurgency: Sandstorm is a multiplayer tactical first-person shooter video game developed by New World Interactive and published by Focus Home Interactive. It was officially announced in February 2016, for Linux, macOS, Microsoft Windows, PlayStation 4 and Xbox One. The game is a sequel to the 2014 video game Insurgency. It was released on 12 December 2018 for Windows, with a delayed release for console, macOS and Linux builds of the game. The game received critical acclaim for its realistic gameplay, level design, sound design, atmosphere, graphics and fluid animations, but was criticized for its technical issues and optimization.", "developer": ["New World Interactive"], "genre": "First-person shooter", "date_release": "2018-12-12"}}