{"OneShot": {"composer": "Casey Gu", "description": "OneShot is a puzzle and adventure indie game developed by Little Cat Feet and published by Degica. Based on a 2014 free version, it was released for Steam on December 8, 2016. The game is centered around metafictional concepts, which have been described by the developers as \"the world knows you exist\". This affects its story, which depicts the player as a separate character from Niko, the protagonist. Both characters arrive in an unfamiliar world, and aim to replace its sun at the top of a tower. OneShot received largely positive reviews, most of which focused on its narrative aspects.", "genre": "Adventure", "date_release": "2016-12-08"}, "Operation Flashpoint: Cold War Crisis": {"composer": "Ondřej Matějka", "description": "Operation Flashpoint: Cold War Crisis is a tactical shooter and battlefield simulator video game developed by Bohemia Interactive Studio and published by Codemasters in 2001. In 2011, Bohemia Interactive re-released the game under the title ARMA: Cold War Assault.", "developer": ["Bohemia Interactive"], "genre": "Tactical shooter", "date_release": "2001-06-22"}, "Operation Flashpoint: Resistance": {"composer": "Ondrej Matejka", "description": "Operation Flashpoint (also Arma: Cold War Assault) is a series of military simulation games. The first game, Operation Flashpoint: Cold War Crisis and its expansion Operation Flashpoint: Resistance, was developed by Bohemia Interactive Studio. The second games, comprising Operation Flashpoint: Dragon Rising and Operation Flashpoint: Red River, were developed by Codemasters. There are also three spiritual sequels to the original game made by Bohemia Interactive Studio; ArmA: Armed Assault, ARMA 2 and ARMA 3.", "developer": ["Bohemia Interactive"], "genre": "Tactical shooter", "date_release": "2002-07-10"}, "Orcs Must Die 2": {"description": "Orcs Must Die! 2 is a trap based action-tower defense video game that Robot Entertainment developed as the follow-up to the original Orcs Must Die!, with Microsoft Game Studios publishing the sequel for Microsoft Windows on July 30, 2012 in the United States. On April 2, 2012, Microsoft announced the development of Orcs Must Die! 2 at the Penny Arcade Expo in Boston (PAX East), with their emphasis on co-operative gameplay as the principal addition over the original.", "developer": ["Robot Entertainment"], "genre": "Action", "date_release": "2012-07-30"}, "Order of War": {"composer": null, "description": "Order of War is a World War II Strategy video game developed by Wargaming and published by Square Enix. It was released on September 22, 2009.", "developer": ["Wargaming"], "genre": "Strategy", "date_release": "2009-09-22"}, "osu!": {"description": "Osu! (stylized as osu!) is a free and open-source rhythm game primarily developed, published and created by Dean \"peppy\" Herbert. Originally released for Microsoft Windows on September 16, 2007, the game has also been ported to macOS. Its gameplay is based on titles including Osu! Tatakae! Ouendan, Elite Beat Agents, Taiko no Tatsujin, Beatmania IIDX, O2Jam, and DJMax. The game has an active esports community, and is also sometimes recommended by professional players of other games to practice or warm-up.", "developer": ["Dean Herbert"], "genre": "Rhythm, music\n", "date_release": "2007-09-16"}, "Out of the Park Baseball": {"description": "Out of the Park Baseball, abbreviated as OOTP, is a text-based baseball simulation for career, historical, and fictional play. OOTP was originally written in 1998, when lead developer Markus Heinsohn sought to combine realistic replay baseball simulation with career play to satisfy hardcore fans and casual gamers alike. \"A friend of mine brought home a bat and a glove from a trip to Miami, so we started hitting tennis balls into the neighbor's gardens. That was in 1991,\" Heinsohn told Inside Mac Games in a July 2012 interview. \"We then formed a baseball club and started playing in organized baseball leagues in 1994. In the meantime I played all sorts of baseball computer games, but there was no management-related game that I liked, so in 1998 I decided to simply develop my own game, just for fun. When it was done in 1999, I figured it was probably good enough to earn some money with it, and that's when it all started.\"\nStarting with OOTP 16, the game has licenses for Major League Baseball and Minor League Baseball. The license covers historical MLB teams too. The mobile version is covered by the license too, and was renamed from iOOTP Baseball to MLB Manager.In September 2013, OOTP Developments branched out into ice hockey with the release of Franchise Hockey Manager, which features 23 leagues, including the NHL, KHL, and many others. In January 2014, the company announced that an American football sim named Beyond the Sideline Football was in development with a release date to be announced.", "developer": ["Sports Interactive"], "genre": "Sports", "date_release": "2006-03-26"}, "Outcast": {"producer": null, "composer": null, "description": null, "genre": "Adventure", "date_release": "1999-08-31"}, "Outlast": {"composer": "Samuel Laflamme", "description": "Outlast is a first-person survival horror video game developed and published by Red Barrels. The game revolves around a freelance investigative journalist, Miles Upshur, who decides to investigate a remote psychiatric hospital named Mount Massive Asylum, located deep in the mountains of Lake County, Colorado. The downloadable content, Outlast: Whistleblower, centers on Waylon Park, the man who led Miles there in the first place.\nOutlast was released for Microsoft Windows on September 4, 2013, PlayStation 4 on February 4, 2014 and for Xbox One on June 19, 2014.  Linux and OS X versions were later released on March 31, 2015. A Nintendo Switch version was released in February 2018.\nOutlast received generally positive reviews from critics, with praise directed at its atmosphere, horror elements and gameplay. As of October 2016, the game has sold four million copies overall.A sequel, Outlast 2, was released on April 25, 2017.", "developer": ["Red Barrels"], "genre": "Action", "date_release": "2013-09-04"}, "Overgrowth": {"composer": null, "description": "Small intestine bacterial overgrowth (SIBO), also termed bacterial overgrowths, or small bowel bacterial overgrowth syndrome (SBBOS), is a disorder of excessive bacterial growth in the small intestine. Unlike the colon (or large bowel), which is rich with bacteria, the small bowel usually has fewer than 10,000 organisms per millilitre. Patients with bacterial overgrowth typically develop symptoms including nausea, bloating, vomiting, diarrhea, malnutrition, weight loss and malabsorption, which is caused by a number of mechanisms.\nThe diagnosis of bacterial overgrowth is made by a number of techniques, with the gold standard being an aspirate from the jejunum that grows in excess of 105 bacteria per millilitre. Risk factors for the development of bacterial overgrowth include dysmotility; anatomical disturbances in the bowel, including fistulae, diverticula and blind loops created after surgery, and resection of the ileo-cecal valve; gastroenteritis-induced alterations to the small intestine; and the use of certain medications, including proton pump inhibitors.\nSmall bowel bacterial overgrowth syndrome is treated with an elemental diet or antibiotics, which may be given in a cyclic fashion to prevent tolerance to the antibiotics, sometimes followed by prokinetic drugs to prevent recurrence if dysmotility is a suspected cause.", "developer": ["Wolfire Games"], "genre": "Action", "date_release": "2008-09-17"}, "Overwatch": {"composer": "Derek Duke", "description": "Overwatch is a team-based multiplayer first-person shooter developed and published by Blizzard Entertainment. Described as a \"hero shooter,\" Overwatch assigns players into two teams of six, with each player selecting from a roster of over 30 characters, known as \"heroes,\" each with a unique style of play that is divided into three general roles that fit their purpose. Players on a team work together to secure and defend control points on a map or escort a payload across the map in a limited amount of time. Players gain cosmetic rewards that do not affect gameplay, such as character skins and victory poses, as they play the game. The game was initially launched with casual play, with a competitive ranked mode, various 'arcade' game modes, and a player-customizable server browser subsequently included following its release. Additionally, Blizzard has added new characters, maps, and game modes post-release, all free of charge, with the only additional cost to players being optional loot boxes to earn cosmetic items. It was released for PlayStation 4, Xbox One, and Windows in May 2016, with an upcoming Nintendo Switch version in October 2019.\nOverwatch is Blizzard's fourth major franchise and came about following the 2014 cancellation of the ambitious massively multiplayer online role-playing game Titan. A portion of the Titan team came up with the concept of Overwatch, based on the success of team-based first-person shooters like Team Fortress 2 and the popularity of multiplayer online battle arena games, creating a hero-based shooter that emphasized teamwork. Some elements of Overwatch borrow assets and concepts from the canceled Titan project. After establishing the narrative of an optimistic near-future Earth setting after a global crisis, the developers aimed to create a diverse cast of heroes that spanned genders and ethnicities as part of this setting. Significant time is spent adjusting the balance of the characters, making sure that new players would still be able to have fun while skilled players would present each other with a challenge.\nOverwatch was unveiled at BlizzCon 2014 and was in a closed beta from late 2015 through early 2016. An open beta before release drew in nearly 10 million players. The release of the game was promoted with short animated videos to introduce the narrative and characters. Overwatch received universal acclaim from critics, who praised the game for its accessibility, diverse appeal of its hero characters, bright cartoonish art style, and enjoyable gameplay. Blizzard reported over US$1 billion in revenue during the first year of its release and had more than 40 million players after two years. Overwatch is considered to be among the greatest video games of all time, receiving numerous game of the year awards and other accolades. The game is also a popular esport, with Blizzard funding and producing the global Overwatch League.", "developer": ["Blizzard Entertainment"], "genre": "Action", "date_release": "2016-05-24"}, "Oxenfree": {"composer": "Andrew Rohrmann", "description": "Oxenfree is a supernatural mystery graphic adventure game developed and published by Night School Studio. The game was released for Microsoft Windows, OS X and Xbox One in January 2016. PlayStation 4 and Linux versions were released later in 2016, followed by iOS, Android, and Nintendo Switch versions in 2017. In Oxenfree, players assume the role of teenage girl Alex on a weekend trip to a local island. After seemingly supernatural events occur, Alex and her friends must unravel the secrets of the island.\nThe game is Night School Studio's first. Influenced by classic teen films and coming-of-age shows, the developers wanted to create a story-driven game without cutscenes, allowing players to freely roam the environment. Oxenfree's visual presentation marries dark, organic, and analog elements with bright, geometric, and digital ones. Musician scntfc composed the game's soundtrack, which features digital music production techniques alongside the use of vintage analog tape recorders and receivers.\nOxenfree's release was accompanied by development documentaries, an alternate reality game, and a collector's edition. The game received generally positive reviews on release. Critics praised the presentation and characters, although some reviewers were left wanting more. The game was nominated for multiple awards including \"Best Narrative\" at The Game Awards 2016.", "developer": ["Night School Studio"], "genre": "Graphic adventure", "date_release": "2016-01-15"}}