{"Half-Life": {"composer": "Kelly Bailey", "description": "Half-life (symbol t1⁄2) is the time required for a quantity to reduce to half of its initial value. The term is commonly used in nuclear physics to describe how quickly unstable atoms undergo, or how long stable atoms survive, radioactive decay. The term is also used more generally to characterize any type of exponential or non-exponential decay. For example, the medical sciences refer to the biological half-life of drugs and other chemicals in the human body. The converse of half-life is doubling time.\nThe original term, half-life period, dating to Ernest Rutherford's discovery of the principle in 1907, was shortened to half-life in the early 1950s. Rutherford applied the principle of a radioactive element's half-life to studies of age determination of rocks by measuring the decay period of radium to lead-206.\nHalf-life is constant over the lifetime of an exponentially decaying quantity, and it is a characteristic unit for the exponential decay equation. The accompanying table shows the reduction of a quantity as a function of the number of half-lives elapsed.", "developer": ["Valve Corporation", "Gearbox Software"], "genre": "First-person shooter", "date_release": "1998-11-19"}, "Half-Life 2": {"composer": "Kelly Bailey", "description": "Half-Life 2 (stylized as HλLF-LIFE2) is a first-person shooter video game developed and published by Valve Corporation. It is the sequel to 1998's Half-Life and was released in November 2004 following a five-year $40 million development. During development, a substantial part of the project was leaked and distributed on the Internet. The game was developed alongside Valve's Steam software and the Source engine.\nTaking place some years after the events of Half-Life, protagonist Gordon Freeman is awakened by the enigmatic G-Man to find the world has been taken over by the alien Combine. Joined by allies including resistance fighter Alyx Vance, Gordon searches for a way to free humanity using a variety of weapons, including the object-manipulating Gravity Gun. All retail copies of the game, as well as all initial digital versions, were bundled with Counter-Strike: Source, which some game journalists referred to as part of Half-Life 2's \"multiplayer component.\"Half-Life 2 received critical acclaim, with praise directed towards its advanced physics, animation, sound, AI, graphics, and narrative, and is widely considered to be one of the greatest games of all time. The game won 39 \"Game of the Year\" awards and the title of \"Game of the Decade\" at the 2012 Spike Video Game Awards, in addition to sales of 12 million copies by 2011. It was followed by two episodic sequels: Episode One (2006) and Episode Two (2007).", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2004-11-16"}, "Half-Life: Blue Shift": {"producer": "Randy Pitchford", "composer": null, "description": "Half-Life: Blue Shift is an expansion pack for Valve Software's science fiction first-person shooter video game Half-Life. The game was developed by Gearbox Software with Valve Corporation and published by Sierra On-Line on June 12, 2001. Blue Shift is the second expansion for Half-Life, originally intended as part of a Dreamcast version of the original game. Although the Dreamcast port was later cancelled, the PC version continued development and was released as a standalone product. The game was released on Steam on August 24, 2005.\nAs with Gearbox's previous expansion pack Opposing Force, Blue Shift returns to the setting and events of the original game, but portrays the story through the eyes of another person. The protagonist in Blue Shift is a security guard, Barney Calhoun, employed by the Black Mesa Research Facility. After a scientific mishap causes Black Mesa to be invaded by aliens, Calhoun must fight his way to safety. The game received mostly positive reception. Many reviewers were critical of the short length of the game and the lack of new content, although the inclusion of a High Definition pack that upgraded the models and textures in both Blue Shift and the preceding Half-Life games was praised.", "developer": ["Valve Corporation", "Gearbox Software"], "genre": "First-person shooter", "date_release": "2001-06-12"}, "Half-Life Deathmatch: Source": {"composer": "Kelly Bailey", "description": "Half-Life (stylized as HλLF-LIFE) is a first-person shooter video game developed by Valve and published by Sierra Studios for Microsoft Windows in 1998. It was Valve's debut title and the first in the Half-Life series. Players assume the role of Gordon Freeman, a scientist who must find his way out of the Black Mesa Research Facility after an experiment with an alien material goes wrong. The core gameplay consists of fighting alien and human enemies with a variety of weapons and solving puzzles. Unlike many other games at the time, the player has almost complete uninterrupted control of Freeman, and the story is told mostly through scripted sequences seen through his eyes.\nValve co-founder Gabe Newell said the team aimed to create an immersive world rather than a \"shooting gallery\". Half-Life received critical acclaim for its graphics, realistic gameplay, and seamless narrative. It won over fifty PC \"Game of the Year\" awards and is considered one the most influential titles of the first-person shooter genre, as well as one of the greatest video games of all time. By 2008, the game had sold over 9 million copies.\nHalf-Life received the expansion packs Half-Life: Opposing Force (1999) and Half-Life: Blue Shift (2001). The game was ported to the PlayStation 2 in 2001, along with another expansion Half-Life: Decay, as well as to macOS and Linux in 2013. The game's engine, GoldSrc, is a heavily modified version of the Quake engine, licensed from id Software, the framework of which would become the heavily utilized Source engine. Half-Life itself was remade as Half-Life: Source in 2004.\nHalf-Life sparked numerous fan-made mods, several of them becoming standalone games, notably Counter-Strike, Day of Defeat and Sven Co-op. A sequel, Half-Life 2, was released in 2004. An unofficial remake of Half-Life titled Black Mesa was released in 2012 as a mod of Half-Life 2.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2006-05-01"}, "Half-Life: Opposing Force": {"producer": "Randy Pitchford", "composer": "Chris Jensen", "description": "Half-Life: Opposing Force is an expansion pack for Valve Software's science fiction first-person shooter video game Half-Life. The game was developed by Gearbox Software and Valve Corporation and published by Sierra On-Line on November 19, 1999. Opposing Force is the first expansion for Half-Life and was announced in April 1999. Randy Pitchford, the lead designer on the game, later noted that he believed Gearbox was selected to develop Opposing Force because Valve wanted to concentrate on their future projects. Over the course of development, Gearbox brought in a variety of outside talent from other areas of the video games industry to help bolster various aspects of design.\nOpposing Force returns to the same setting as Half-Life, but instead portrays the events from the perspective of a U.S. Marine, one of the enemy characters in the original game. The player character, Adrian Shephard, is sent in to neutralize the Black Mesa Research Facility when a scientific mishap causes it to be invaded by aliens, but quickly finds that the Marines are outnumbered and slowly being beaten back by a second alien race and black operations units.\nOpposing Force was received well by critics, many describing it as the new benchmark title for expansion packs, in a similar fashion to how Half-Life revolutionized the first-person shooter genre. Other reviewers, however, thought that the game still had many of the negative aspects of other expansion packs, although it was still regarded as an exceptional add-on.", "developer": ["Valve Corporation", "Gearbox Software"], "genre": "First-person shooter", "date_release": "1999-11-10"}, "Half-Life: Source": {"composer": "Kelly Bailey", "description": "Half-Life (stylized as HλLF-LIFE) is a first-person shooter video game developed by Valve and published by Sierra Studios for Microsoft Windows in 1998. It was Valve's debut title and the first in the Half-Life series. Players assume the role of Gordon Freeman, a scientist who must find his way out of the Black Mesa Research Facility after an experiment with an alien material goes wrong. The core gameplay consists of fighting alien and human enemies with a variety of weapons and solving puzzles. Unlike many other games at the time, the player has almost complete uninterrupted control of Freeman, and the story is told mostly through scripted sequences seen through his eyes.\nValve co-founder Gabe Newell said the team aimed to create an immersive world rather than a \"shooting gallery\". Half-Life received critical acclaim for its graphics, realistic gameplay, and seamless narrative. It won over fifty PC \"Game of the Year\" awards and is considered one the most influential titles of the first-person shooter genre, as well as one of the greatest video games of all time. By 2008, the game had sold over 9 million copies.\nHalf-Life received the expansion packs Half-Life: Opposing Force (1999) and Half-Life: Blue Shift (2001). The game was ported to the PlayStation 2 in 2001, along with another expansion Half-Life: Decay, as well as to macOS and Linux in 2013. The game's engine, GoldSrc, is a heavily modified version of the Quake engine, licensed from id Software, the framework of which would become the heavily utilized Source engine. Half-Life itself was remade as Half-Life: Source in 2004.\nHalf-Life sparked numerous fan-made mods, several of them becoming standalone games, notably Counter-Strike, Day of Defeat and Sven Co-op. A sequel, Half-Life 2, was released in 2004. An unofficial remake of Half-Life titled Black Mesa was released in 2012 as a mod of Half-Life 2.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2004-06-01"}, "Half-Life 2: Deathmatch": {"description": "Half-Life 2: Deathmatch is a multiplayer first-person shooter video game developed by Valve Corporation. Released on Steam on November 30, 2004, it uses many of the assets from Half-Life 2 and its Source engine. It features new levels, optimized for multiplayer arena play, and a few new weapons. Also included are portions of the game's source code, which were the basis for many early Source-based multiplayer modifications. The game is the successor to the popular multiplayer component of the original Half-Life, but is offered as a separate product from Half-Life 2. Deathmatch, like Half-Life's multiplayer, does not develop any part of the plot or story of the Half-Life series.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2004-11-30"}, "Half-Life 2: Episode One": {"composer": "Kelly Bailey", "description": "Half-Life 2: Episode One (stylized as HλLF-LIFE2: EPISODE ONE) is a first-person shooter video game, the first in an intended series of episodes that would serve as the sequels to Half-Life 2 (2004). It was developed by Valve Corporation and released on June 1, 2006. Initially called Half-Life 2: Aftermath, the game was renamed Episode One after Valve became confident in using an episodic structure for the game. Episode One uses the same game engine, Source, as Half-Life 2. The game debuted new lighting and animation technologies, as well as AI sidekick enhancements.\nThe game's events take place immediately after those in Half-Life 2, in and around war-torn City 17. Episode One follows scientist Gordon Freeman and his companion Alyx Vance in humanity's continuing struggle against the alien civilization known as the Combine. When the story begins, Gordon wakes up outside the enemy's base of operations, the Citadel, after being left unconscious from the concluding events of Half-Life 2. During the course of the game, Gordon travels with Alyx as they attempt to evacuate the city. As the game comes to an end, Gordon and Alyx are caught in a major accident, and their fates are revealed in the sequel, Episode Two.\nValve views episodes One through Three tantamount to a standalone release. Episode One is available as part of a bundle package known as The Orange Box, which also includes Half-Life 2, Episode Two, Team Fortress 2, and Portal. Episode One received a generally positive critical reaction, and the co-operative aspects of the gameplay received particular praise, although the game's short length was criticized.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2006-06-01"}, "Half-Life 2: Episode Two": {"composer": "Kelly Bailey", "description": "Half-Life 2: Episode Two (stylized as HλLF-LIFE2: EPISODE TWO) is a first-person shooter game, the second in a series of episodic sequels to Half-Life 2 (2004). It was developed by Valve in tandem with Episode One and released in 2007 via Valve's Steam distribution platform. The episode was released separately and as a part of a bundled package, The Orange Box.Gameplay consists of expansive environments, travel and reduced linear play, continuing Valve's policy of orienting each episode around a particular theme or set of technologies. Following the closing events of Episode One, it sees Gordon Freeman and the series' other major characters moving away from City 17 to the surrounding countryside.The retail version was released on October 10, 2007, in North America and Russia for Windows and Microsoft's Xbox 360 after repeated delays. The version for the PlayStation 3 was to be released \"around two or three weeks later\", as it was produced separately at the Electronic Arts UK studio, according to Valve marketing director Doug Lombardi. This version was further delayed. For the rest of the world, the release date was October 18.  The Steam version was released worldwide on October 10, 2007.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2007-10-10"}, "Half-Life 2: Lost Coast": {"description": "Half-Life 2: Lost Coast (stylized as HλLF-LIFE2: LOST COAST) is an additional level for the 2004 first-person shooter video game Half-Life 2. Developed by Valve Corporation, it was released on October 27, 2005, through the Steam content delivery service as a free download to owners of the Microsoft Windows version of Half-Life 2. Lost Coast serves as a technology demonstration, specifically showcasing the high-dynamic-range rendering implemented in the Source engine. The level was designed with a variety of appropriate environments to emphasize these effects. Lost Coast was the first video game developed by Valve to allow developers to explain various elements of design as the player progresses through the level.\nLost Coast follows Half-Life protagonist Gordon Freeman as he travels up a coastal cliff to destroy a Combine headcrab artillery launcher in a monastery, which is firing on a nearby town, Saint Olga. The Lost Coast level was initially created for Half-Life 2, but was ultimately removed from the game. As a result, it has several minor story details that were not included in Half-Life 2. The level received a generally positive reception, and there was consensus among reviewers that the new features included in Lost Coast should be integrated into future games released by Valve.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2005-10-27"}, "Halo: Combat Evolved": {"composer": null, "description": "Halo: Combat Evolved Anniversary is a first-person shooter video game set in the Halo universe and is an enhanced remake of Halo: Combat Evolved. Microsoft announced the game alongside Halo 4 at the 2011 Electronic Entertainment Expo. The game was released on November 15, 2011—the 10th anniversary of the original title's launch—for the Xbox 360 game console, and re-released as part of Halo: The Master Chief Collection for the Xbox One on November 11, 2014.\nHalo: Combat Evolved Anniversary was developed as a partnership between development studios 343 Industries, Saber Interactive, and Certain Affinity. 343 Industries, the Halo series' franchise overseers, approached Saber Interactive to develop a remake of the original Halo in time for its tenth anniversary. After considering whether to remake the game entirely or to adapt and add features to the existing PC version, Saber decided to use its game engine for reproducing the original's appearance and the original Halo's engine for gameplay. A development tool for toggling between the old and new visuals became a game feature. Anniversary's enhancements include a complete high-definition visual overhaul, support for cooperative and multiplayer gameplay via the Xbox Live online service, new and remastered sound effects and music, and extras such as achievements and hidden in-game collectibles. The game is the first in the series to include Kinect support.\nCritical reception to Anniversary was generally positive. The updated graphics, sounds, and ability to toggle between the remastered and original visuals were praised. Complaints included technical glitches, faults with the original game's level design, and the multiplayer mode's implementation.", "developer": ["Bungie", "Gearbox Software"], "genre": "First-person shooter", "date_release": "2003-09-30"}, "Halo 2": {"composer": null, "description": "Halo 2 is a 2004 first-person shooter video game developed by Bungie. Released for the Xbox video game console on November 9, 2004, the game is the second installment in the Halo franchise and the sequel to 2001's critically acclaimed Halo: Combat Evolved. A Microsoft Windows version of the game was released on May 31, 2007, developed by an internal team at Microsoft Game Studios known as Hired Gun. The game features a new game engine, as well as using the Havok physics engine; added weapons and vehicles, and new multiplayer maps. The player alternately assumes the roles of the human Master Chief and the alien Arbiter in a 26th-century conflict between the human United Nations Space Command, the genocidal Covenant, and the parasitic Flood.\nAfter the success of Combat Evolved, a sequel was expected and highly anticipated. Bungie found inspiration in plot points and gameplay elements that had been left out of their first game, including multiplayer over the Internet through Xbox Live. Time constraints forced a series of cutbacks in the size and scope of the game, including a cliffhanger ending to the game's campaign mode that left many in the studio dissatisfied. Among Halo 2's marketing efforts was an alternate reality game called \"I Love Bees\" that involved players solving real-world puzzles.\nOn release, Halo 2 was the most popular video game on Xbox Live, holding that rank until the release of Gears of War for the Xbox 360 nearly two years later. By June 20, 2006, more than 500 million games of Halo 2 had been played and more than 710 million hours have been spent playing it on Xbox Live; by May 9, 2007, the number of unique players had risen to over five million. Halo 2 is the best-selling first-generation Xbox game with at least 6.3 million copies sold in the United States alone. The game received critical acclaim, with most publications lauding the strong multiplayer component. The campaign however, was the focus of criticism for its cliffhanger ending.\nA high-definition remastered version of Halo 2 was released as part of Halo: The Master Chief Collection on November 11, 2014, for the Xbox One titled Halo 2 Anniversary. The collection itself is planned to be released for Windows in 2019.", "developer": ["Bungie", "Microsoft Game Studios", "Pi Studios"], "genre": "First-person shooter", "date_release": "2007-05-17"}, "Hard Truck Apocalypse": {"description": "Hard Truck: Apocalypse (Ex Machina) is a vehicular combat post-apocalyptic science fiction video game developed by Russian game developer Targem Games. It is a Privateer-like game on vehicles instead of spaceships set in a post-apocalyptic Europe. The player controls an armored truck and roams between settlements trading with locals, completing quests and fighting numerous enemies to upgrade his truck and acquire better weapons to progress through the main storyline.", "developer": ["Targem Games"], "genre": "Vehicular combat", "date_release": "2006-06-19"}, "Harvester": {"producer": "Lee Jacobson", "description": null, "developer": ["DigiFX Interactive"], "genre": "Adventure", "date_release": "1996-09-25"}, "A Hat in Time": {"producer": "Simon Roth", "composer": "Pascal Michael Stiefel", "description": "A Hat in Time is a platform action-adventure video game developed by Gears for Breakfast and published by Humble Bundle. The game was developed using Unreal Engine 3 and funded through a Kickstarter campaign, which doubled its fundraising goals within its first two days.  It is inspired by earlier 3D platformers such as Super Mario 64, Banjo-Kazooie, Spyro the Dragon and Psychonauts. The game was self-published for Microsoft Windows and macOS in October 2017, and by Humble Bundle for the PlayStation 4 and Xbox One consoles two months later. Bundled with the Seal the Deal DLC pack, a Nintendo Switch port will be released on October 18th, 2019, with the physical retail release of the Switch port releasing November 8th, 2019.", "genre": "Adventure"}, "Hatoful Boyfriend: A School of Hope and White Wings": {"producer": [null, null, null], "description": "Hatoful Boyfriend: A School of Hope and White Wings (Japanese: はーとふる彼氏 〜希望の学園と白い翼〜, Hepburn: Hātofuru kareshi ~kibō no gakuen to shiroi tsubasa~) is a Japanese dōjin soft otome visual novel released in 2011 for Microsoft Windows and OS X. It was developed by manga artist Hato Moa's dōjin circle PigeoNation Inc., and is the successor of a Flash game of the same name she created for April Fools' Day in 2011. A free demo version of Hatoful made with the FamousWriter engine was released later that year, followed by a full commercial version released on 30 October 2011 at COMITIA 98, and an English version released in February 2012. An international remake by developer Mediatonic and publisher Devolver Digital, dubbed Hatoful Boyfriend HD in Japan, was released on 4 September 2014 for Microsoft Windows, OS X, and Linux and for PlayStation 4 and PlayStation Vita on 21 July 2015 in North America, and on 22 July 2015 in Europe, respectively. A port for iOS was released on 25 May 2016.\nHatoful Boyfriend received generally positive reception; reviewers praised the game's replay value as well as its writing and characterization, while repetitive gameplay and the accessibility of the game's Bad Boys Love mode received a more mixed response. A sequel, Hatoful Boyfriend: Holiday Star, was released on 29 December 2011, with an English version being released on Christmas Day the following year. In addition to the main games in the series, Hatoful Boyfriend has made transitions into other media: a monthly webcomic was serialized in the anthology Manga Life WIN+, several supplementary materials and official dōjin works have been released, and four drama CDs based on the series have been made. An episodic web series began in 2014.", "developer": ["Mediatonic"], "genre": "Visual novel", "date_release": "2014-08-24"}, "Hearts of Iron": {"producer": "Johan Andersson", "description": "Hearts of Iron IV is a grand strategy video game developed by Paradox Development Studio and published by Paradox Interactive. It was released worldwide on June 6, 2016. It is the sequel to 2009's Hearts of Iron III and the fourth main installment in the Hearts of Iron series. Like previous games in the series, Hearts of Iron IV is a grand strategy wargame that focuses on World War II. The player may take control of any nation in the world in either 1936 or 1939 and lead them to victory or defeat against other countries.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2002-11-24"}, "Hearts of Iron II": {"description": "Hearts of Iron II is a grand strategy computer war game for the PC based upon its predecessor, Hearts of Iron, which was developed by Paradox Development Studio and published by Paradox Interactive.\nIt takes place in the period from 1 January 1936 through 30 December 1947 (1964 with the expansion), and allows the player to assume control of any one of over 175 nations of the time and guide its development through the years before, during and after the Second World War. It was developed by Paradox Interactive and released in 2005. The lead game programmer was Johan Andersson.\nA sequel, Hearts of Iron III, was released in August 2009.\nArsenal of Democracy, a grand strategy wargame based on Hearts of Iron II, was released in February 2010. Iron Cross, a Hearts of Iron II expansion, was released on October 7, 2010, and Darkest Hour, a stand-alone strategy game based on Hearts of Iron II, was released on April 5, 2011.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2005-01-04"}, "Hearts of Iron III": {"producer": "Johan Andersson", "composer": "Andreas Waldetoft", "description": "Hearts of Iron III is a grand strategy video game developed by Paradox Development Studio and published by Paradox Interactive. The Microsoft Windows version of the game was released on August 7, 2009, while the Mac OS X version was released on December 7, 2009. A grand strategy wargame that focuses on World War II, it is the sequel to 2005's Hearts of Iron II and the third main installment in the Hearts of Iron series.\nInitially, the game received a mixed reception, largely because of the large number of bugs present in the game at release. After several patches, the game's reception improved. In December 2009, it had an average score of 77 on Metacritic.\nA sequel, Hearts of Iron IV, was released on June 6, 2016.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2009-08-07"}, "Hello Neighbor": {"description": "Hello Neighbor is a survival horror stealth game developed by Dynamic Pixels and published by tinyBuild. The goal of the game is to successfully sneak into the basement of the neighbor's house to uncover a secret. The game's artificial intelligence (AI) modifies the neighbor's behavior based on the player's past actions, such as setting traps along paths the player followed in a previous attempt.", "genre": "Stealth", "date_release": "2017-12-08"}, "Heroes of the Lance": {"composer": null, "description": "Advanced Dungeons & Dragons: Heroes of the Lance is a video game released in January 1988 for various home computer systems and consoles. The game is based on the first Dragonlance campaign module for the Dungeons & Dragons fantasy role-playing game, Dragons of Despair, and the first Dragonlance novel Dragons of Autumn Twilight. Heroes of the Lance focuses on the journey of eight heroes through the ruined city of Xak Tsaroth, where they must face the ancient dragon Khisanth and retrieve the relic, the Disks of Mishakal.", "developer": ["U.S. Gold"], "genre": "RPG", "date_release": "1988-11-01"}, "Heroes of Might and Magic: A Strategic Quest": {"composer": "Paul Romero", "description": "Heroes of Might and Magic: A Strategic Quest is a turn-based strategy game developed and published by New World Computing in 1995 for DOS. A spin-off of New World Computing's Might and Magic series of role-playing video games, the success of Heroes of Might and Magic led to a number of sequels.\nIn 1996, NWC released an updated version of the game, ported to Windows 95. This new version included a map editor, random map generator, CD audio, and new scenarios. As a bonus, King's Bounty was also included on the CD.", "developer": ["New World Computing"], "genre": "Turn-based strategy", "date_release": "1995-08-31"}, "Heroes of Might and Magic II": {"producer": "Walter Hochbrueckner", "composer": null, "description": "Heroes of Might and Magic II: The Succession Wars  is a turn-based strategy video game developed by Jon Van Caneghem through New World Computing and published in 1996 by the 3DO Company. The game is the second installment of the Heroes of Might and Magic series and is typically credited as the breakout game for the series. Heroes II was voted the sixth-best PC game of all time by PC Gamer in May 1997.\nAn expansion pack, The Price of Loyalty, was released in 1997. Later, 3DO bundled Heroes II and its expansion pack in one box, released as Heroes of Might and Magic II Gold in 1998.", "developer": ["New World Computing"], "genre": "Turn-based strategy", "date_release": "1996-10-01"}, "Heroes of Might and Magic III": {"composer": null, "description": "Heroes of Might and Magic III: The Restoration of Erathia (commonly referred to as Heroes of Might & Magic 3, or simply Heroes 3) is a turn-based strategy game developed by Jon Van Caneghem through New World Computing originally released for Microsoft Windows by the 3DO Company in 1999. Its ports to several computer and console systems followed in 1999-2000. It is the third installment of the Heroes of Might and Magic series. The game's story is first referenced throughout Might and Magic VI: The Mandate of Heaven and serves as a prequel to Might and Magic VII: For Blood and Honor. The player can choose to play through seven different campaigns telling the story, or play in a scenario against computer or human opponents.\nThe gameplay is very similar to its predecessors in that the player controls a number of heroes that command an army of creatures inspired by myth and legend. The gameplay is divided into two parts,  tactical overland exploration and a turn based combat system. The player creates an army by spending resources at one of the eight town types in the game. The hero will progress in experience by engaging in combat with enemy heroes and monsters. The conditions for victory vary depending on the map, including conquest of all enemies and towns, collection of a certain amount of a resource, or finding the grail artifact.\nHeroes III was released to universal acclaim and was praised by critics. The game received the expansion packs Heroes of Might and Magic III: Armageddon's Blade and Heroes of Might and Magic III: The Shadow of Death. Heroes Chronicles, a series of short introductory games based on the Heroes III engine, was also released. A special version of Heroes III titled Heroes III Complete, which included the original game and both expansion packs, was released in 2000. On December 10, 2014, Ubisoft announced an HD version of the game. The new version features updated graphics as well as wide screen compatibility and was released on January 29, 2015 for Microsoft Windows, iOS and Android. However, the expansions have not been re-released because their source code is lost.", "developer": ["New World Computing"], "genre": "Turn-based strategy", "date_release": "1999-02-28"}, "Heroes of Newerth": {"composer": "Arnej Šećerkadić", "description": "Heroes of Newerth (HoN) is a multiplayer online battle arena (MOBA) video game originally developed by S2 Games for Microsoft Windows, Mac OS X, and Linux. The game idea was derived from the Warcraft III: The Frozen Throne custom map Defense of the Ancients and was S2 Games' first MOBA title. The game was released on May 12, 2010, and re-released as a free-to-play game on July 29, 2011. On May 5, 2015, Heroes of Newerth development duties passed to Frostburn Studios, with the development team moving over to the new company.", "developer": ["S2 Games"], "genre": "MOBA", "date_release": "2010-05-12"}, "Heroes of the Storm": {"producer": "Kaéo Milker", "composer": null, "description": "Heroes of the Storm is a crossover multiplayer online battle arena video game developed and published by Blizzard Entertainment and released on June 2, 2015, for Microsoft Windows and macOS. The game features various characters from Blizzard's franchises as playable heroes, as well as different battlegrounds based on Warcraft, Diablo, StarCraft, and Overwatch universes. The game is free-to-play, based on freemium business model, and is supported by microtransactions which can be used to purchase heroes, visual alterations for the heroes in the game, mounts, and other cosmetic elements. Blizzard does not call the game a \"multiplayer online battle arena\" or an \"action real-time strategy\" because they feel it is something different with a broader playstyle; they refer to it as an online \"hero brawler\".", "developer": ["Blizzard Entertainment"], "genre": "MOBA", "date_release": "2015-06-02"}, "Hitman: Absolution": {"producer": "Hakan B. Abrak", "composer": null, "description": "Hitman: Absolution is a stealth video game developed by IO Interactive and published by Square Enix. It is the fifth installment in the Hitman series. Before release, the developers stated that Absolution would be easier to play and more accessible, while still retaining hardcore aspects of the franchise. The game was released on 20 November 2012 (which is in the 47th week of the year in reference to the protagonist, Agent 47) for Microsoft Windows, PlayStation 3, and Xbox 360. On 15 May 2014 Hitman: Absolution — Elite Edition was released for OS X by Feral Interactive; it contained all previously released downloadable content, including Hitman: Sniper Challenge, a \"making of\" documentary, and a 72-page artbook.Hitman: Absolution was met with a polarized reception. Most positive comments were concerning the game's graphics, environments and locations, and the varied gameplay options. However, many critics disliked the game for its linear structure as opposed to the open ended nature of previous installments. As of March 2013, the game has sold over 3.6 million copies. A sequel, Hitman, was released episodically in 2016. Warner Bros. Interactive Entertainment released the remastered versions of Absolution and its predecessor, Hitman: Blood Money, were released for PlayStation 4 and Xbox One as part of the Hitman HD Enhanced Collection.", "developer": ["IO Interactive", "Feral Interactive"], "genre": "Action-adventure", "date_release": "2012-11-19"}, "Hitman: Blood Money": {"producer": "Helle Marijnissen", "composer": "Jesper Kyd", "description": "Hitman: Blood Money is a 2006 stealth video game developed by IO Interactive and published by Eidos Interactive for Microsoft Windows, PlayStation 2, Xbox and Xbox 360. It is the fourth installment in the Hitman video game series.\nThe story follows the life of professional hitman, Agent 47, as narrated in cutscenes by a former director of the FBI to a journalist who is interviewing him. The game was a critical and commercial success for Eidos, selling more than 2.1 million copies. High-definition ports of Blood Money and its predecessors, Silent Assassin and Contracts, were released on PlayStation 3 and Xbox 360 in January 2013 as the Hitman HD Trilogy. Remastered versions of Blood Money and its successor, Hitman: Absolution, were released for PlayStation 4 and Xbox One as part of the Hitman HD Enhanced Collection.", "developer": ["IO Interactive"], "genre": "Action-adventure", "date_release": "2006-05-30"}, "Hitman: Codename 47": {"composer": "Jesper Kyd", "description": "Hitman: Codename 47 is a 2000 stealth video game, developed by IO Interactive and published by Eidos Interactive for Microsoft Windows. It is the first installment in the Hitman video game series.\nThe story centers on Agent 47, a genetically enhanced human clone branded with a barcode tattooed on the back of his head, who is rigorously trained in methods of murder. Upon escaping from a test facility, 47 is hired by the Agency, a European contract killing organization. His missions take him to locations in Asia and Europe to assassinate wealthy and decadent criminals.", "developer": ["IO Interactive"], "genre": "Action-adventure", "date_release": "2000-11-19"}, "Hitman: Contracts": {"composer": "Jesper Kyd", "description": "Hitman: Contracts is a 2004 stealth video game developed by IO Interactive and published by Eidos Interactive for Microsoft Windows, PlayStation 2 and Xbox. It is the third installment in the Hitman video game series. As of April 2009, the game has sold around 2 million copies. High-definition ports of Contracts and its predecessor and successor, Silent Assassin and Blood Money, were released on PlayStation 3 and Xbox 360 in January 2013 as the Hitman HD Trilogy.", "developer": ["IO Interactive"], "genre": "Action-adventure", "date_release": "2004-04-20"}, "Hitman 2: Silent Assassin": {"composer": "Jesper Kyd", "description": "Hitman 2: Silent Assassin is a 2002 stealth video game developed by IO Interactive and published by Eidos Interactive for Microsoft Windows, PlayStation 2, Xbox and GameCube. It is the second installment in the Hitman video game series and the sequel to Hitman: Codename 47. The game was re-released for Windows through the Steam online distribution service and later a DRM-free version was available through GOG.com. A commercial success, the game has sold more than 3.7 million copies as of 23 April 2009 and is the best selling Hitman game to date. High-definition ports of Silent Assassin and its successors, Contracts and Blood Money, were released on PlayStation 3 and Xbox 360 in January 2013 as the Hitman HD Trilogy.In the game, players assume the role of a hired assassin known as Agent 47, who works for a secret agency that specializes in carrying out assassinations of wealthy and decadent criminals. Missions involve contract killings. The game allows the player try choose their own style of gameplay.", "developer": ["IO Interactive"], "genre": "Action-adventure", "date_release": "2002-10-01"}, "Hogs of War": {"description": "Hogs of War is a turn-based tactics artillery video game developed by Infogrames Sheffield House and published by Infogrames, released for the PlayStation in Europe on 6th June 2000, and North America on 29th September 2000, and later for Microsoft Windows in Europe only on 3 November 2000. The game is set in the First World War-era where anthropomorphic pigs engage in combat. Hogs of War is turn-based, featuring 3D graphics, and both a single-player career mode, and offline multiplayer. The game featured voice artistry by British comedic actor Rik Mayall and Marc Silk.\nThe tune for the game is John Philip Sousa's Liberty Bell March. The design of the game was later discussed in the book The Game Maker's Apprentice.", "developer": ["Infogrames Studios"], "genre": "Turn-based tactics", "date_release": "2000-11-03"}, "Homeworld": {"producer": "Curtis Terry", "composer": "Paul Ruskay", "description": "Homeworld is a real-time strategy video game developed by Relic Entertainment and published by Sierra Studios on September 28, 1999, for Microsoft Windows. Set in space, the science fiction game follows the Kushan exiles of the planet Kharak after their home planet is destroyed by the Taiidan Empire in retaliation for developing hyperspace jump technology. The survivors journey with their spacecraft-constructing mothership to reclaim their ancient homeworld of Hiigara from the Taiidan, encountering a variety of pirates, mercenaries, traders, and rebels along the way. In each of the game's levels, the player gathers resources, builds a fleet, and uses it to destroy enemy ships and accomplish mission objectives. The player's fleet carries over between levels, and can travel in a fully three-dimensional space within each level rather than being limited to a two-dimensional plane.\nHomeworld was created over two years, and was the first game developed by Relic. Studio co-founders Alex Garden and Luke Moloney served as the director and lead programmer for the game, respectively. The initial concept for the game's story is credited to writer David J. Williams, while the script itself was written by Martin Cirulis and the background lore was written by author Arinn Dembo. The music of the game was written by composer Paul Ruskay as the first title from his Studio X Labs, with the exception of Samuel Barber's 1936 Adagio for Strings, considered the defining theme of the game, and a licensed track from English rock band Yes, \"Homeworld (The Ladder)\".\nHomeworld is listed by review aggregator Metacritic as the highest rated computer game of 1999, and the fourth-highest on any platform for the year. Critics praised the game's graphics, unique gameplay elements, and multiplayer system, though opinions were divided on the game's plot and high difficulty. The game sold over 500,000 copies in its first six months, and received several awards and nominations for best strategy game of the year and best game of the year. A release of the game's source code in 2003 sparked unofficial ports to macOS and Linux, and three more games in the Homeworld series have been produced: Homeworld: Cataclysm (2000), Homeworld 2 (2003), and Homeworld: Deserts of Kharak (2016). Gearbox Software purchased the rights to the series from then-owners THQ in 2013, and released a remastered collection of Homeworld and Homeworld 2 in 2015 for Windows and macOS which was also highly regarded. Gearbox announced the fifth game in the series, Homeworld 3, on August 30, 2019; the game development is being crowdfunded through Fig, and is slated for a Q4 2022 release.", "developer": ["Relic Entertainment"], "genre": "Real-time strategy", "date_release": "1999-09-28"}, "Homeworld: Cataclysm": {"composer": null, "description": "Homeworld: Cataclysm was originally developed in 2000 as an expansion of Homeworld, but was released as a stand-alone game. It was published by Sierra Studios, as was the original, but it was developed by Barking Dog Studios. The game reappeared on the gaming website GOG.com in June 2017 as Homeworld: Emergence, as the name \"Cataclysm\" was trade marked by Blizzard Entertainment for its third expansion to World of Warcraft.", "developer": ["Barking Dog Studios"], "genre": "Real-time strategy", "date_release": "2000-06-30"}, "Homeworld 2": {"producer": "Daniel Irish", "composer": "Paul Ruskay", "description": "Homeworld 2 is a real-time strategy video game sequel to Homeworld, developed by Relic Entertainment and released in 2003 by now defunct publisher Sierra Entertainment. Its story concerns Hiigara's response to a new enemy called the Vaygr. Its gameplay takes a new direction with the enhancement of its graphics and audio. In contrast to the closely equivalent Kushan and Taiidan forces of the original game, Vaygr and Hiigaran spaceships differ significantly in design and application.", "developer": ["Relic Entertainment"], "genre": "Real-time strategy", "date_release": "2003-09-16"}, "Homeworld: Deserts of Kharak": {"composer": "Paul Ruskay", "description": "Homeworld: Deserts of Kharak is a real-time strategy video game developed by Blackbird Interactive and published by Gearbox Software. The game was released on January 20, 2016, and is a prequel to the 1999 space-based real-time strategy video game Homeworld.", "developer": ["Blackbird Interactive"], "genre": "Real-time strategy", "date_release": "2016-01-20"}, "Hotline Miami": {"description": "Hotline Miami is a top-down shooter video game by Jonatan Söderström and Dennis Wedin, collectively known as Dennaton Games. The game was published by Devolver Digital and released on 23 October 2012 for Microsoft Windows.Set in 1989 Miami, the game revolves primarily around an unnamed silent protagonist—dubbed \"Jacket\" by fans—who has been receiving messages on his answering machine instructing him to commit massacres against the local Russian Mafia. The game blends top-down perspective with stealth, extreme violence and surreal storytelling, along with a soundtrack and visuals inspired by 1980s culture. The game itself was influenced in part by Nicolas Winding Refn's 2011 neo-noir crime film Drive, as well as the 2006 documentary Cocaine Cowboys.At release, the game received critical acclaim, with praise regarding its narrative, themes, music and gameplay. Hotline Miami has since become a cult video game. A sequel, Hotline Miami 2: Wrong Number, was released on 10 March 2015.", "developer": ["Dennaton Games"], "genre": "Action", "date_release": "2012-10-23"}, "Hotline Miami 2: Wrong Number": {"description": "Hotline Miami 2: Wrong Number is a top-down shooter video game co-developed by Dennaton Games and Abstraction Games, and published by Devolver Digital. It takes place before and after the events of its predecessor, Hotline Miami, as it focuses on the backstory and aftermath of the previous protagonist, Jacket, slaying parts of the Russian mafia at the behest of anonymous voices leaving mysterious messages on his answering machine.The game was first released worldwide for Microsoft Windows, OS X, Linux on 10 March 2015. It then saw its release for PlayStation 3, PlayStation 4 and PlayStation Vita on 10 March 2015 in North America, on 11 March 2015 in Europe, and on 25 June 2015 in Japan. An Android port was released on 4 August 2015. A Nintendo Switch version was released in August 2019 alongside the first game as part of the Hotline Miami Collection.", "developer": ["Dennaton Games"], "genre": "Action", "date_release": "2015-03-10"}, "Hugo's House of Horrors": {"description": "Hugo's House of Horrors is a computer game released in 1990. Gray Design Associates (GDA) created a parser-based adventure game, reminiscent of the Sierra Entertainment \"Quest\" games (such as King's Quest) and thematically similar to Maniac Mansion.  The game also features tongue-in-cheek comedy.", "genre": "Adventure", "date_release": "1990-01-01"}}