{"Call of Cthulhu: Dark Corners of the Earth": {"producer": null, "composer": "Greg Chandler", "description": "Call of Cthulhu: Dark Corners of the Earth is a survival horror video game developed by Headfirst Productions and published by Bethesda Softworks with 2K Games and Ubisoft for the Xbox and Microsoft Windows systems. The game was published for the Xbox in 2005 and Microsoft Windows in 2006. Call of Cthulhu: Dark Corners of the Earth combines an action-adventure game with a relatively realistic first-person shooter and elements of a stealth game.\nThe game is based on the works of H. P. Lovecraft, author of \"The Call of Cthulhu\" and progenitor of the Cthulhu Mythos. It is a reimagining of Lovecraft's 1936 novella The Shadow over Innsmouth. Set mostly in the year 1922, the story follows Jack Walters, a mentally unstable private detective hired to investigate in Innsmouth, a strange and mysterious town that has cut itself off from the rest of the United States.\nIn development since 1999, the project was repeatedly delayed, going through several revisions and having some of its most ambitious and immersive features abandoned and the initially planned PlayStation 2 version cancelled. Although well received by most critics and regarded by some as one of the best horror video games of all time, Dark Corners of the Earth was a commercial failure. At least two additional Cthulhu Mythos games were planned by Headfirst Productions, including a direct sequel titled Call of Cthulhu: Destiny's End, but neither were completed due to Headfirst's bankruptcy.", "developer": ["Headfirst Productions"], "genre": "Survival horror", "date_release": "2005-10-24"}, "Call of Duty": {"producer": "Vince Zampella", "composer": null, "description": "Call of Duty  is a first-person shooter video game franchise published by Activision. Starting out in 2003, it first focused on games set in World War II, but over time, the series has seen games set in modern times, the midst of the Cold War, futuristic worlds, and outer space. The games were first developed by Infinity Ward, then also by Treyarch and  Sledgehammer Games. Several spin-off and handheld games were made by other developers. The most recent title, Call of Duty: Black Ops 4, was released on October 12, 2018. The next title, Call of Duty: Modern Warfare, will be released on October 25, 2019.\nThe series originally focused on the World War II setting, with Infinity Ward developing the first (2003) and second (2005) titles in the series and Treyarch developing the third (2006). Call of Duty 4: Modern Warfare (2007) introduced a new, modern setting, and proved to be the breakthrough title for the series, creating the Modern Warfare sub-series. The game's legacy also influenced the creation of a remastered version, released in 2016. Two other entries, Modern Warfare 2 (2009) and 3 (2011), were made. The sub-series received a soft-reboot with Modern Warfare in 2019. Infinity Ward have also developed two games outside of the Modern Warfare sub-series, Ghosts (2013) and Infinite Warfare (2016). Treyarch made one last World War II-based game, World at War (2008), before releasing Black Ops (2010) and subsequently creating the Black Ops sub-series. Three other entries, Black Ops II (2012), III (2015), and 4 (2018), were made. Sledgehammer Games, who were co-developers for Modern Warfare 3, have also developed two titles, Advanced Warfare (2014) and WWII (2017).\nAs of February 2016, the series has sold over 250 million copies. Sales of all Call of Duty games topped US$15 billion. Other products in the franchise include a line of action figures designed by Plan-B Toys, a card game created by Upper Deck Company, Mega Bloks sets by Mega Brands, and a comic book mini-series published by WildStorm Productions.", "developer": ["Infinity Ward"], "genre": "Action", "date_release": "2003-10-29"}, "Call of Duty 2": {"producer": "Vince Zampella", "composer": "Graeme Revell", "description": "Call of Duty 2 is a first-person shooter video game developed by Infinity Ward and published by Activision in most regions of the world. It is the second installment of the Call of Duty series. Announced by Activision on April 7, 2005, the game was released on October 25, 2005 for Microsoft Windows, and on November 22, 2005 as a launch title for the Xbox 360. Other versions were eventually released for OS X, mobile phones, and Pocket PCs.\nThe game is set during World War II and the campaign mode is experienced through the perspectives of four soldiers: one in the Red Army, one in the United States Army, and two in the British Army. It contains four individual campaigns, split into three stories, with a total of 27 missions. Many features were added and changed from the original Call of Duty, notably regenerating health and an icon that indicates a nearby grenade about to explode.\nThe game drew critical praise, particularly for the graphics, sound and the regenerating health system. As a launch game, the Xbox 360 version sold over 250,000 copies in its first week, and had sold over 2 million copies by January 2008. By November 2013, the game had sold over 5.9 million copies.", "developer": ["Infinity Ward"], "genre": "Action", "date_release": "2005-10-25"}, "Call of Duty 4: Modern Warfare": {"producer": "Mark Rubin", "composer": "Stephen Barton", "description": "Call of Duty 4: Modern Warfare is a first-person shooter developed by Infinity Ward and published by Activision. The fourth main installment in the Call of Duty series, it was released in November 2007 for the PlayStation 3, Xbox 360, and Microsoft Windows, and was ported to the Wii as Call of Duty: Modern Warfare – Reflex Edition in 2009. The game breaks away from the World War II setting of previous entries in the series and is instead set in modern times. Developed for over two years, the game uses a proprietary game engine.\nThe story takes place in the year 2011, where a radical leader has executed the president of an unnamed country in the Middle East, and an ultranationalist movement ignites a civil war in Russia. The conflicts are seen from the perspectives of a U.S. Force Reconnaissance Marine and a British SAS commando, and are set in various locales, such as the United Kingdom, the Middle East, Azerbaijan, Russia, and Ukraine. The multiplayer portion of the game features various game modes, and contains a leveling system that allows the player to unlock additional weapons, weapon attachments, and camouflage schemes as they advance.\nThe game received universal acclaim from critics, with the gameplay and story receiving particular praise, while criticism targeted the failure of the game to substantially innovate the first-person shooter genre. The game won numerous awards from gaming websites, including IGN's Best Xbox 360 Game. It was the top-selling game worldwide for 2007, selling around seven million copies by January 2008 and almost sixteen million by November 2013. It was followed by two sequels that continue the storyline: Call of Duty: Modern Warfare 2 and Call of Duty: Modern Warfare 3.\nA remastered version of Modern Warfare, Call of Duty: Modern Warfare Remastered, was released as part of special edition bundles of Call of Duty: Infinite Warfare in November 2016, and as a standalone game in June 2017. A soft reboot of the Modern Warfare games, Call of Duty: Modern Warfare, is set to be released in October 2019.", "developer": ["Infinity Ward"], "genre": "Action", "date_release": "2007-11-05"}, "Call of Duty: Black Ops": {"producer": "Pat Dwyer", "composer": "Sean Murray", "description": "Call of Duty: Black Ops is a first-person shooter video game, developed by Treyarch and published by Activision. It was released worldwide on November 9, 2010 for Microsoft Windows, the PlayStation 3, Xbox 360, and Wii, with a separate version for Nintendo DS developed by n-Space. Aspyr later released the game for OS X on September 27, 2012. It is the seventh title in the Call of Duty series and the third to be developed by Treyarch. It serves as the sequel to Call of Duty: World at War.Set in the 1960s during the Cold War, the game's campaign follows CIA operative Alex Mason as he attempts to recall certain memories in combat in order to locate a numbers station. This station is due to transmit broadcasts to sleeper agents who are bound to use chemical weapons across the United States. Mason and CIA operative Jason Hudson are the game's main playable characters, as well as Red Army soldier Viktor Reznov in only one mission. Locations featured in the game include Cuba, Russia, United States, Kazakhstan, Hong Kong, Laos, Vietnam, and the Arctic Circle. The multiplayer of Black Ops features multiple objective-based game modes that are playable on 14 different maps included with the game. Improvements to loadout options and killstreak rewards are made. A form of virtual currency, COD Points, allows players to purchase weapons and customization options for their in-game character, as well as attachments and customization options for their weapon.\nDevelopment for the game began in 2009. It runs an enhanced version of the IW 3.0 engine used in Treyarch's past title, World at War. The improvements made allowed for bigger campaign levels to be made as well as enhanced lighting. Treyarch focused specifically on Black Ops during development; they were developing two games at once while making World at War. Different teams within the company focused on a certain game mode. Music was composed by Sean Murray, with music by The Rolling Stones, Creedence Clearwater Revival, Eminem and Avenged Sevenfold appearing in the game. Marketing of the game began in April 2010. Multiple trailers promoting the game and its modes were released from May until October.\nThe game received generally positive reviews from critics. Within 24 hours of going on sale, the game had sold more than 5.6 million copies, 4.2 million in the U.S. and 1.4 million in the UK, breaking the record set by its predecessor Modern Warfare 2 by some 2.3 million copies. After six weeks on release, Activision reported that Black Ops had exceeded $1 billion in sales. On August 3, 2011, Activision confirmed that the game had sold over 25 million copies worldwide, making it one of the best-selling games of all time in the US, UK and Europe. A sequel, Call of Duty: Black Ops II, was released on November 13, 2012.Call of Duty: Black Ops III was released on November 6, 2015 as the sequel to Black Ops II.", "developer": ["Treyarch", "n-Space"], "genre": "Action", "date_release": "2010-11-09"}, "Call of Duty: Black Ops 2": {"producer": "Pat Dwyer", "composer": "Jack Wall", "description": "Call of Duty: Black Ops II is a first-person shooter developed by Treyarch and published by Activision. It was released for Microsoft Windows, PlayStation 3, and the Xbox 360 on November 13, 2012, and for the Wii U on November 18 in North America and November 30 in PAL regions. Black Ops II is the ninth game in the Call of Duty franchise of video games, a sequel to the 2010 game Call of Duty: Black Ops and the first Call of Duty game for the Wii U. A corresponding game for the PlayStation Vita, Call of Duty: Black Ops: Declassified, was developed by nStigate Games and also released on November 13.\nThe game's campaign follows up the story of Black Ops and is set in two different time periods; the late 1980s and 2025. In the '80s, the player switches control between Alex Mason and Frank Woods, two of the protagonists from Black Ops, while in 2025, the player assumes control of Mason's son, David (codenamed \"Section\"). Both time periods involve the characters pursuing Raul Menendez, a Nicaraguan cartel leader, who is responsible for kidnapping Woods in the 80s and later sparking a second Cold War in 2025. The campaign features nonlinear gameplay and has multiple endings.Development for the game began soon after the release of Black Ops, with Activision promising that the follow-up would bring \"meaningful innovation\" to the Call of Duty franchise. Black Ops II is the first game in the series to feature futuristic warfare technology and the first to present branching storylines driven by player choice as well as selecting weapons before starting story mode missions. It also offers a 3D display option. The game was officially revealed on May 1, 2012, following a set of leaked information released during the previous months.\nBlack Ops II received generally positive reviews from critics. The game was a commercial success; within 24 hours of going on sale, the game grossed over $500 million. It had remained the largest entertainment launch of all time until September 2013, when Take-Two Interactive announced that Grand Theft Auto V had grossed $800 million in its first day of release. It went on to sell 7.5 million copies in the U.S. in November 2012, making it the highest-grossing game of the month. A sequel, Call of Duty: Black Ops III, was released in 2015. Black Ops II was made backwards compatible for the Xbox One in April 2017.", "developer": ["Treyarch"], "genre": "Action", "date_release": "2012-12-12"}, "Call of Duty: Black Ops 3": {"producer": null, "composer": null, "description": "Call of Duty: Black Ops III is a first-person shooter video game, developed by Treyarch and published by Activision. It is the twelfth entry in the Call of Duty series and the sequel to the 2012 video game Call of Duty: Black Ops II. It was released on Microsoft Windows, PlayStation 4, and Xbox One on November 6, 2015. A feature-limited version developed by Beenox and Mercenary Technology that only supports multiplayer modes was released on PlayStation 3 and Xbox 360 and was also the final Call of Duty title released on those platforms.\nBlack Ops III takes place in 2065, 40 years after the events of Black Ops II, in a world facing upheaval from climate change and new technologies. Similar to its predecessors, the story follows a group of black ops soldiers. The game's campaign is designed to support 4-player cooperative gameplay, allowing for bigger, more open level design and less corridor shooting. As the player character is cybernetically enhanced, players have access to various special activities. The game also features a standalone Zombies mode, and a \"Nightmares\" mode which replaces all enemies as zombies.\nAnnounced on April 26, 2015, the game is the first Call of Duty video game released after Activision parted with Microsoft Studios and partnered with Sony Computer Entertainment, which secured the timed exclusivity of the game's downloadable content. Upon release, the game received generally positive reviews from critics, albeit slightly lower than the previous two games in the sub-series, with critics praising the gameplay, Zombies mode, and amount of content. However, it was criticized for its story, absence of fan favorite story mode characters, and lack of innovation. The seventh-generation console versions in particular were criticized for the lack of a campaign and numerous features, as well as it being online-only. It was a commercial success, with it becoming the top-selling retail game in the US in 2015, and one of the most successful titles released for the eighth generation of video game consoles. A sequel, Call of Duty: Black Ops 4, was released in October 2018.", "developer": ["Treyarch"], "genre": "FPS", "date_release": "2015-11-06"}, "Call of Duty: Black Ops 4": {"composer": null, "description": "Call of Duty: Black Ops 4 (stylized as Call of Duty: Black Ops IIII) is a multiplayer first-person shooter developed by Treyarch and published by Activision. It was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on October 12, 2018. It is a sequel to the 2015 game Call of Duty: Black Ops III, the fifth entry in the Black Ops sub-series, and the 15th installment in the Call of Duty series overall.\nBlack Ops 4 is the first Call of Duty title without a traditional single-player campaign mode. Instead, it features the Solo Missions mode, which focuses on the backstories of the game's multiplayer characters, known as \"Specialists\". The missions take place between Black Ops II and III chronologically. Some of the Specialists also carried over from Black Ops III. The multiplayer mode is the first in the series to not feature automatic health regeneration and introduces both predictive recoil and a new ballistics system. The game included three Zombies maps on release day, four if a special edition of the game, or the Black Ops Pass, was purchased. The locations of the maps include the RMS Titanic, an arena in Ancient Rome, and Alcatraz Federal Penitentiary. The game also introduced a battle royale mode called Blackout, which features up to 100 players in each match. Many characters from this and other Black Ops titles can be used as the player's character model in this mode.\nDevelopment for the game started shortly after the release of Black Ops III. Treyarch chose not to create a campaign mode for the game at the beginning of development, instead putting all of their focus on the multiplayer aspect. They cited an increased interest for multiplayer and lack of time spent by the playerbase on the campaign mode as reasons why they shifted their focus. Black Ops 4 utilizes Blizzard's Battle.net platform for the Windows version instead of Steam, the first game in the series to do so. Teasing of the game began in March 2018, with a full reveal taking place later in May. Two betas were held for the game; one for the multiplayer in August and one for Blackout in September. The release date was moved up to October instead of the series' usual November in an attempt to avoid coinciding with the release of other high-profile games.\nPre-release reception of the game was mixed. Fans of the series expressed disappointment at the game's lack of a campaign mode. The Black Ops Pass, a season pass that distributes downloadable content (DLC), also received heavy backlash due to the map packs only being made available through the pass and not separately, which had been an option with the DLCs of previous titles. Nonetheless, upon release, Black Ops 4 received positive reviews, with particular praise towards its Blackout mode, although it received criticism for the design of its microtransactions implemented in updates. Despite physical retail sales for the game being the lowest in the series in a decade, it was the best-selling digital launch in Activision's history, surpassing 2017's Call of Duty: WWII.", "developer": ["Treyarch"], "genre": "FPS", "date_release": "2018-10-12"}, "Call of Duty: Ghosts": {"composer": "David Buckley", "description": "Call of Duty: Ghosts is a first-person shooter video game developed by Infinity Ward and published by Activision, it is the tenth major installment in the Call of Duty series and the sixth developed by Infinity Ward. It was released for Microsoft Windows, PlayStation 3, Xbox 360, and Wii U on November 5, 2013. The game was released with the launch of the PlayStation 4 and Xbox One.\nGhosts received generally positive reviews from critics, with most praising its multiplayer gameplay and introduction of the new game mode Extinction, but criticizing it for its single-player campaign, rehashing of familiar concepts, general lack of innovation, and storyline ending.", "developer": ["Infinity Ward"], "genre": "Action", "date_release": "2013-11-05"}, "Call of Duty: Infinite Warfare": {"composer": null, "description": "Call of Duty: Infinite Warfare is a first-person shooter video game developed by Infinity Ward and published by Activision. It is the thirteenth primary installment in the Call of Duty series and was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on November 4, 2016.\nDevelopment of Infinite Warfare began during 2014. It is the first title by Infinity Ward under the new three-year development cycle for the Call of Duty series. The game's campaign is centered around a battle for the Solar System, which the Settlement Defense Front (SDF), a hostile force who are the main antagonists, are attempting to take over. The player takes control of Lieutenant Nick Reyes of the Special Combat Air Recon (SCAR). They have their own transforming fighter, named \"Jackal\", that they can customize as well as a central hub ship named Retribution.\nSpecial editions of Infinite Warfare were released with a remastered version of Call of Duty 4: Modern Warfare, entitled Modern Warfare Remastered. Infinite Warfare's announcement trailer was met with a mixed reception from game critics and journalists and a negative reception from the Call of Duty community. The announcement trailer was the second-most disliked video on YouTube at the time, in part due to a campaign by fans of rival game Battlefield 1 and disgruntled Call of Duty fans expressing frustration at the direction the series had taken. Nevertheless, the game received generally positive reviews upon release; critics praised the single-player campaign, which was seen as a considerable improvement over the game's predecessor Black Ops III, the greater player freedom approach in missions, the Zombies mode, and the visuals, while the multiplayer mode was criticized for its lack of innovation. Infinite Warfare underperformed in sales compared to previous Call of Duty titles.\n\n", "developer": ["Infinity Ward"], "genre": "FPS", "date_release": "2016-11-04"}, "Call of Duty: Modern Warfare 2": {"producer": "Mark Rubin", "composer": null, "description": "Call of Duty: Modern Warfare 2 is a first-person shooter video game developed by Infinity Ward and published by Activision. It is the sixth installment in the Call of Duty series and the direct sequel to Call of Duty 4: Modern Warfare, continuing the same storyline. It was released worldwide on November 10, 2009 for Microsoft Windows, the PlayStation 3, and Xbox 360. A separate version for the Nintendo DS, titled Modern Warfare: Mobilized, was also released on the same day. A version for macOS was developed by Aspyr and released on May 20, 2014. The Xbox 360 version was made backward compatible for the Xbox One in 2018.\nThe game's campaign follows the Task Force 141, a special forces unit fronted by Captain Soap MacTavish, as they hunt Vladimir Makarov, leader of the Russian Ultranationalist party, and the United States Army Rangers, who are defending the country from a Russian invasion. The game's main playable characters are Sergeant Gary \"Roach\" Sanderson, of the 141, and Private James Ramirez, of the Army Rangers, with Captain MacTavish becoming playable later in the campaign. An expansive multiplayer mode is featured in the game, with several new features and modes that were not seen in its predecessor.\nDevelopment for the game began in 2008, when it was still known as Call of Duty 6. It uses the IW 4.0 engine, an improved version of Call of Duty 4's IW 3.0. Infinity Ward was inspired by real-life conflicts when developing the campaign mode. They initially tested the multiplayer mode by playing an in-house beta version of the game. Modern Warfare 2 was officially announced on February 11, 2009. Teasing of the game began in March, with short trailers being released for the game and, eventually, a full reveal trailer. The multiplayer mode was revealed shortly after. Two downloadable content packs were released for it post-release, each containing five new multiplayer maps, with some being remastered maps from Call of Duty 4.\nModern Warfare 2 received universal acclaim. Within 24 hours of release, the game sold approximately 4.7 million copies in North America and the United Kingdom. As of 2013, the game has sold 22.7 million copies. In addition to its release, a comic book series based on one of the game's characters was also produced, entitled Modern Warfare 2: Ghost. Despite the game's success, it was subject to some controversies, with one surrounding a playable level that had the player carry out a terror attack on an airport. A sequel, Call of Duty: Modern Warfare 3, was released in 2011 and finishes the original Modern Warfare storyline.", "developer": ["Infinity Ward"], "genre": "Action", "date_release": "2009-11-10"}, "Call of Duty: Modern Warfare 3": {"producer": null, "composer": "Brian Tyler", "description": "Call of Duty: Modern Warfare 3 (also known as Call of Duty: MW3) is a first-person shooter video game, jointly developed by Infinity Ward and Sledgehammer Games, with assistance from Raven Software, and published by Activision. The game was released worldwide in November 2011 for Microsoft Windows, the Xbox 360, PlayStation 3, and Wii. It is the third and final installment in the original Modern Warfare saga, a direct sequel to 2009's Call of Duty: Modern Warfare 2, and the eighth Call of Duty installment overall. A separate version for the Nintendo DS was developed by n-Space, while Treyarch developed the game's Wii port. In Japan, Square Enix published the game with a separate subtitled and dubbed version.\nThe game's campaign follows Modern Warfare 2 and begins right after the events of its final mission. Similar to Modern Warfare 2, it is centered around the Task Force 141, which contains Captain Price, Soap MacTavish, and Yuri, one of the playable characters. Alongside the Delta Force and Special Air Service, they hunt Vladimir Makarov (antagonist of Modern Warfare 2), a Russian terrorist who leads the Russian Ultranationalist party. He leads several terror attacks across Europe, triggering a large-scale war between the Ultranationalists and friendly forces. For the game's multiplayer mode, new mode types and killstreak choices were brought in. Improvements were also made to the mode that solved issues that appeared in Modern Warfare 2.\nUsing an enhanced version of Modern Warfare 2's IW engine, development for the game began in 2010 with more than one developer. Prior to development, Infinity Ward co-founders Jason West and Vince Zampella left the company to form Respawn Entertainment. Other members had been fired or had left the company following the duo's departure. Sledgehammer Games had joined the Modern Warfare 3 development force, with Raven Software also developing the game's multiplayer mode. Following a large leak containing detailed information about the game, multiple teaser trailers were released with each showcasing a location featured in the game's campaign, leading up to a full reveal.\nModern Warfare 3 received positive reviews from critics. It won the award for Best Shooter at the 2011 Spike Video Game Awards. It was also a massive commercial success. Within 24 hours of going on sale, the game sold 6.5 million copies in the United States and United Kingdom and grossed $400 million, making it the biggest entertainment launch of all time (at the time). While Modern Warfare 3 was the final installment for the original Modern Warfare timeline, a new timeline will begin with the release of Call of Duty: Modern Warfare in late 2019, a soft reboot of the sub-series.", "developer": ["Sledgehammer Games", "Treyarch", "Infinity Ward", "Raven Software"], "genre": "Action", "date_release": "2011-11-08"}, "Call of Duty Online": {"description": "Call of Duty  is a first-person shooter video game franchise published by Activision. Starting out in 2003, it first focused on games set in World War II, but over time, the series has seen games set in modern times, the midst of the Cold War, futuristic worlds, and outer space. The games were first developed by Infinity Ward, then also by Treyarch and  Sledgehammer Games. Several spin-off and handheld games were made by other developers. The most recent title, Call of Duty: Black Ops 4, was released on October 12, 2018. The next title, Call of Duty: Modern Warfare, will be released on October 25, 2019.\nThe series originally focused on the World War II setting, with Infinity Ward developing the first (2003) and second (2005) titles in the series and Treyarch developing the third (2006). Call of Duty 4: Modern Warfare (2007) introduced a new, modern setting, and proved to be the breakthrough title for the series, creating the Modern Warfare sub-series. The game's legacy also influenced the creation of a remastered version, released in 2016. Two other entries, Modern Warfare 2 (2009) and 3 (2011), were made. The sub-series received a soft-reboot with Modern Warfare in 2019. Infinity Ward have also developed two games outside of the Modern Warfare sub-series, Ghosts (2013) and Infinite Warfare (2016). Treyarch made one last World War II-based game, World at War (2008), before releasing Black Ops (2010) and subsequently creating the Black Ops sub-series. Three other entries, Black Ops II (2012), III (2015), and 4 (2018), were made. Sledgehammer Games, who were co-developers for Modern Warfare 3, have also developed two titles, Advanced Warfare (2014) and WWII (2017).\nAs of February 2016, the series has sold over 250 million copies. Sales of all Call of Duty games topped US$15 billion. Other products in the franchise include a line of action figures designed by Plan-B Toys, a card game created by Upper Deck Company, Mega Bloks sets by Mega Brands, and a comic book mini-series published by WildStorm Productions.", "developer": ["Tencent", "Raven Software"], "genre": "Action", "date_release": "2013-01-14"}, "Call of Duty: United Offensive": {"producer": "Ken Turner", "composer": "Michael Giacchino", "description": "Call of Duty: United Offensive is an expansion pack for the first-person shooter video game Call of Duty. It was developed by Gray Matter Interactive, with contributions from Pi Studios, and published by Activision. It was released for Microsoft Windows on September 14, 2004.", "developer": ["Gray Matter Interactive", "MediaQuest", "Aspyr"], "genre": "Action", "date_release": "2004-09-14"}, "Call of Duty: World at War": {"producer": [null, null, null], "composer": "Sean Murray", "description": "Call of Duty: World at War is a first-person shooter video game developed by Treyarch and published by Activision. It was released for Microsoft Windows, the PlayStation 3, Wii and Xbox 360, in November 2008. It is the fifth main installment of the Call of Duty series and returns the setting to World War II. The game is also the first title in the Black Ops story line. World at War received ports featuring different storyline versions, while remaining in the World War II setting, for the Nintendo DS and PlayStation 2. It was the first game in the series to feature the zombies mode featured in later sequels. A Windows Mobile version was also made available by Glu Mobile.\nThe narrative for the campaign mode focuses on the Pacific and Eastern Front theaters of World War II, involving the United States, Empire of Japan, Soviet Union, and Nazi Germany. It is told from the perspectives of Marine Raider Private C. Miller, US Navy Petty Officer Locke and Red Army soldier Private Dimitri Petrenko, and is based on several historical battles. The multiplayer component of the game contains various game modes and a leveling system that allows the player to unlock additional weapons and rewards as they progress, similar to Call of Duty 4 and repeated in many following Call of Duty entries. Vehicles, in the form of tanks, that players can control appear on certain multiplayer maps. The game also contains downloadable content called \"map packs\", which can be purchased online. A new feature to the series was the addition of a cooperative mode, which supports up to two players locally and four players online.\nDevelopment for World at War took two years and began after the release of Treyarch's previous title, Call of Duty 3, which was also set in World War II and was their first title they developed for the series. The game is based on an enhanced version of the IW engine game engine developed by Infinity Ward with increased development on audio and visual effects. Treyarch utilized the engine to make more parts of certain environments destructible and introduce limb dismemberment and realistic burns to character models. The game was announced by Activision on June 23, 2008.\nWorld at War received positive reviews from critics and was a commercial success. It sold over 3 million copies in the United States within the first two months of its release, becoming one of the best-selling titles of 2008. In 2010, a sequel, Call of Duty: Black Ops was released. Three other sequels followed: Call of Duty: Black Ops II in 2012, Call of Duty: Black Ops III in 2015, and Call of Duty: Black Ops 4 in 2018. The Xbox 360 version of World at War became backwards compatible on the Xbox One in September 2016.", "developer": ["Exakt Entertainment", "Rebellion Developments", "Treyarch", "n-Space"], "genre": "Action", "date_release": "2008-11-11"}, "CarneyVale: Showtime": {"description": "CarneyVale: Showtime is a vertical platformer developed by Singapore-MIT GAMBIT Game Lab and published by Microsoft Game Studios. It was initially released on Xbox Live Indie Games (then Xbox Live Community Games) on Xbox 360. Players play as Slinky, \"a circus acrobat trying to rise up the ranks by performing acrobatic tricks and death-defying stunts through increasingly complex arenas\".The game won the  2008 Dream-Build-Play Challenge, was declared a finalist in the 2008 Independent Games Festival, and was featured as one of the PAX 10 top games at the 2009 Penny Arcade Expo.", "genre": "Platformer", "date_release": "2010-11-11"}, "Castlevania: Lords of Shadow": {"producer": null, "composer": "Óscar Araujo", "description": "Castlevania: Lords of Shadow is an action-adventure video game developed by MercurySteam and Kojima Productions, published by Konami and released on October 5, 2010 for the PlayStation 3 and Xbox 360. The PC version was released on August 27, 2013. The game is a reboot of the Castlevania series. Set in Southern Europe during the Middle Ages, the story focuses on Gabriel Belmont and his quest to defeat a malevolent order known as the Lords of Shadow and resurrect his wife. The player controls Gabriel in 3D environments as he uses melee skills to defeat enemies and solves puzzles to move through the game.\nThe game was originally announced as Lords of Shadow with no connection to the Castlevania series mentioned. This was done to keep their plans to radically change the direction of the Castlevania mythos a secret and to prevent the announcement of the game from upstaging another series release, Castlevania Judgment. Hideo Kojima, creator of the Metal Gear series, helped produce the title. The music was composed by Spanish composer Óscar Araujo, who was acclaimed for his work on the game.\nThe game sold well and received positive reviews from video game publications. It was praised for new elements it provided to the franchise, although this was also the subject of criticism as it did not retain traits from previous Castlevania games. Konami requested that the development team produce more titles related to Lords of Shadow. This includes two sequels titled Castlevania: Lords of Shadow – Mirror of Fate and Castlevania: Lords of Shadow 2.", "developer": ["MercurySteam", "Kojima Productions", "Climax Studios"], "genre": "Action-adventure", "date_release": "2010-10-05"}, "Champions of Krynn": {"composer": "John Halbleib", "description": "Champions of Krynn is role-playing video game, the first in a three-part series of Dragonlance Advanced Dungeons & Dragons \"Gold Box\" games.  The game was released in 1990. The highest graphics setting supported in the MS-DOS version was EGA graphics. It also supported the Adlib sound card and either a mouse or joystick.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1990-06-01"}, "Chaos Island: The Lost World": {"description": "Chaos Island: The Lost World (also known as Chaos Island and Chaos Island: The Lost World: Jurassic Park) is a real-time strategy video game for the PC, developed and published by DreamWorks Interactive, and based on the 1997 film The Lost World: Jurassic Park. Chaos Island  was released in North America on October 30, 1997. In Chaos Island, the player controls characters displayed on a map, directing where they move with the mouse and giving them commands either with the mouse or from a menu.", "developer": ["DreamWorks Interactive"], "genre": "Real-time strategy", "date_release": "1997-10-30"}, "Chivalry: Medieval Warfare": {"producer": "Steve Piggott", "composer": "Ryan Patrick Buckley", "description": "Chivalry: Medieval Warfare is a multiplayer-focused hack and slash developed by Torn Banner Studios as their first commercial title. The game is set in a fictional world resembling the Middle Ages and offers similar gameplay combat to the Half-Life 2 mod, Age of Chivalry. On September 20, 2012, a trailer was released which set the release date to October 16, 2012. The developers had confirmed that the game would be PC exclusive initially, but in October 2014, they confirmed that the game would be coming to PlayStation 3 and Xbox 360 in December 2014. A standalone expansion pack called Chivalry: Deadliest Warrior was announced on August 23, 2013 as a tie-in for the television series Deadliest Warrior. It was released on November 14, 2013.", "developer": ["Torn Banner Studios"], "genre": "Action", "date_release": "2012-10-16"}, "Cities in Motion": {"description": "Cities in Motion is a business simulation game developed by Colossal Order and published by Paradox Interactive. It was released for Microsoft Windows on February 23, 2011, with OS X and Linux ports coming at later dates. The goal of the game is to implement and improve a public transport system in 4 European cities - Amsterdam, Berlin, Helsinki and Vienna. This can be achieved by building lines for metro trains, trams, boats, buses and helicopters.\nThe game is available for purchase on a digital disc, downloaded via Steam, and a DRM-free download via various other distributors.", "developer": ["Colossal Order"], "genre": "Business simulation", "date_release": "2011-02-23"}, "Cities in Motion 2": {"description": "Cities in Motion 2 is a 2013 business simulation game that was developed by Colossal Order and published by Paradox Interactive and is the sequel to the popular mass transit simulation game Cities in Motion. As with its predecessor, the goal of the game is to create efficient public transport systems in different major cities of the world. In this edition, there are several new features that the developers introduced based on community feedback about the previous game, including day/night cycles, rush hours and the ability to create timetables. The additions also include dynamic cities where players' decisions have a notable impact on city growth, and the inclusion of cooperative and competitive multi-player.", "developer": ["Colossal Order"], "genre": "Business simulation", "date_release": "2013-04-02"}, "Cities: Skylines": {"producer": "Mariina Hallikainen", "composer": null, "description": "Cities: Skylines is a city-building game developed by Colossal Order and published by Paradox Interactive. The game is a single-player open-ended city-building simulation. Players engage in urban planning by controlling zoning, road placement, taxation, public services, and public transportation of an area. Players work to maintain various elements of the city, including its budget, health, employment, and pollution levels. Players are also able to maintain a city in a sandbox mode, which provides unrestricted creative freedom for the player.\nCities: Skylines is a progression of development from Colossal Order's previous Cities in Motion titles, which focused on designing effective transportation systems. While the developers felt they had the technical expertise to expand to a full city simulation game, their publisher Paradox held off on the idea, fearing the market dominance of SimCity. After the critical failure of the 2013 SimCity game, however, Paradox greenlit the title. The developer's goal was to create a game engine capable of simulating the daily routines of nearly a million unique citizens, while presenting this to the player in a simple way, allowing the player to easily understand various problems in their city's design. This includes realistic traffic congestion, and the effects of congestion on city services and districts. Since the game's release, various expansions and other DLC has been released for the game. The game also has built-in support for user-generated content.\nThe game was first released for the Windows, macOS, and Linux operating systems in March 2015, with ports to the Xbox One and PlayStation 4 game consoles being released in 2017 and for the Nintendo Switch in September 2018 developed by Tantalus Media. The game received favourable reviews from critics, and was a commercial success, with more than six million copies sold on all platforms as of March 2019.", "developer": ["Colossal Order"], "genre": "City-building", "date_release": "2015-03-10"}, "Cities XL": {"description": "Cities XL (originally Cities Unlimited) is a city-building video game developed by Monte Cristo as a sequel to their earlier title City Life. It was originally scheduled for release in the first quarter of 2009, but was eventually released on October 8, 2009. The game allowed players to play online and interact with others on massive persistent planets, and to work together by trading resources or building blueprints in order to satisfy the needs of city inhabitants. However, on March 8, 2010 the online service was closed and the game became single-player only.\nFocus Home Interactive acquired the franchise in June 2010 and released Cities XL 2011 on October 14, 2010. The third installment, Cities XL Platinum, was released on February 14, 2013. A new version, Cities XXL, was announced on November 15, 2014, and released on February 5, 2015.", "developer": ["Monte Cristo"], "genre": "City-building game", "date_release": "2009-10-08"}, "Civilization III": {"producer": null, "composer": null, "description": "Sid Meier's Civilization III is the third installment of the Sid Meier's Civilization turn-based strategy video game series. It was preceded by Civilization II and followed by Civilization IV, and it was released in 2001. Unlike the original game, Civilization III was not designed by Sid Meier, but by Jeff Briggs, a game designer, and Soren Johnson, a game programmer.\nCivilization III, like the other Civilization games, entails building an empire, from the ground up, beginning in 4,000 BC and continuing slightly beyond the modern day. The player must construct and improve cities, train military and non-military units, improve terrain, research technologies, build Wonders of the World, make war or peace with neighboring civilizations, and so on. The player must balance a good infrastructure, resources, diplomatic and trading skills, technological advancement, city and empire management, culture, and military power to succeed.", "developer": ["Firaxis Games", "Westlake Interactive", "Aspyr"], "genre": "Turn-based strategy", "date_release": "2001-10-30"}, "Civilization III: Conquests": {"description": "Civilization III: Conquests is the second and final expansion pack for the video game Civilization III (2001) , first released in 2003. Like the first expansion pack, Play the World, it added eight more playable civilizations, introduced new gameplay concepts, and added two new types of government.", "developer": ["Firaxis Games", "BreakAway Games"], "genre": "Turn-based strategy", "date_release": "2003-11-04"}, "Civilization III: Play the World": {"description": "Civilization III: Play the World is the first expansion pack for Civilization III, released in October 2002. Play the World added more civilizations, a new multiplayer feature, new Wonders of the World, new units and new game modes, including: elimination, regicide, and capture the flag.", "developer": ["Firaxis Games"], "genre": "Turn-based strategy", "date_release": "2002-10-31"}, "Civilization IV": {"producer": null, "composer": null, "description": "Civilization IV (also known as Sid Meier's Civilization IV) is a turn-based strategy computer game and the fourth installment of the Civilization series. It was designed by Soren Johnson under the direction of Sid Meier and his video game development studio Firaxis Games. It was preceded by Civilization III and followed by Civilization V, and it was released in North America, Europe, and Australia, between October 25 and November 4, 2005.\nCivilization IV uses the 4X empire-building model for turn-based strategy gameplay, in which the player's main objective is to construct a civilization from limited initial resources. Most standard full-length games start the player with a settler unit and/or a city unit in the year 4000 BC. As with other games in the series, there are by default five objectives the player can pursue in order to finish the game: conquering all other civilizations, controlling a supermajority of the game world's land and population, building and sending the first sleeper ship to the Alpha Centauri star system, increasing the \"Culture ratings\" of at least three different cities to \"legendary\" levels, or winning a \"World Leader\" popularity contest by the United Nations. If the time limit for the game is reached and none of the previous goals has been fulfilled by any players including game AI players, the civilization with the highest total game score is declared winner. A large departure from earlier Civilization games is a new graphics engine created from scratch, based on the Gamebryo engine by Numerical Design Limited (NDL).\nThe game has received critical acclaim and was hailed as an exemplary product of one of the leading video game producers in the turn-based strategy genre. Civilization IV sold over 3 million copies by 2008 and won multiple awards, including several Game of the Year awards. Its title song, \"Baba Yetu\", was the first piece of video game music to win a Grammy Award. Two major expansions were released, Civilization IV: Warlords and Civilization IV: Beyond the Sword, as well as the standalone game Civilization IV: Colonization, which were all combined in 2009 into one release edition titled Sid Meier's Civilization IV: The Complete Edition.", "developer": ["Firaxis Games"], "genre": "Turn-based strategy", "date_release": "2005-10-25"}, "Civilization V": {"producer": null, "composer": null, "description": "Sid Meier's Civilization V is a 4X video game in the Civilization series developed by Firaxis Games. The game was released on Microsoft Windows in September 2010, on OS X on November 23, 2010, and on Linux on June 10, 2014.\nIn Civilization V, the player leads a civilization from prehistoric times into the future on a procedurally generated map, attempting to achieve one of a number of different victory conditions through research, exploration, diplomacy, expansion, economic development, government and military conquest. The game is based on an entirely new game engine with hexagonal tiles instead of the square tiles of earlier games in the series. Many elements from Civilization IV and its expansion packs have been removed or changed, such as religion and espionage (although these were reintroduced in its subsequent expansions). The combat system has been overhauled, by removing stacking of military units and enabling cities to defend themselves by firing directly on nearby enemies. In addition, the maps contain computer-controlled city-states and non-player characters that are available for trade, diplomacy and conquest. A civilization's borders also expand one tile at a time, favoring more productive tiles, and roads now have a maintenance cost, making them much less common. The game features community, modding, and multiplayer elements. It is available for download on Steam.\nIts first expansion pack, Civilization V: Gods & Kings, was released on June 19, 2012, in North America and June 22 internationally. It includes features such as religion, espionage, enhanced naval combat and combat AI, as well as nine new civilizations.A second expansion pack, Civilization V: Brave New World, was announced on March 15, 2013. It includes features such as international trade routes, a world congress, tourism, great works, as well as nine new civilizations, eight additional wonders, and three ideologies. It was released on July 9, 2013, in North America and in the rest of the world three days later.", "developer": ["Firaxis Games"], "genre": "Turn-based strategy", "date_release": "2010-09-21"}, "Civilization V: Brave New World": {"description": "Sid Meier's Civilization V: Brave New World is the second official expansion pack for the turn-based strategy video game Civilization V. It was released on July 9, 2013 in North America, and on July 12, 2013 in the rest of the world.", "developer": ["Firaxis Games"], "genre": "Turn-based strategy", "date_release": "2013-03-15"}, "Civilization V: Gods & Kings": {"description": "Sid Meier's Civilization V: Gods & Kings is the first official expansion pack for the turn-based strategy video game Civilization V. It was released on June 19, 2012 in North America, and on June 22, 2012 in the rest of the world. It adds both religion and espionage mechanics to the game as well as reworking the combat and diplomacy features. It is available either in disc form or as download content via Steam.", "developer": ["Firaxis Games"], "genre": "Turn-based strategy", "date_release": "2012-02-16"}, "Civilization VI": {"composer": "Geoff Knorr", "description": "Sid Meier's Civilization VI is a turn-based strategy 4X video game developed by Firaxis Games, published by 2K Games, and distributed by Take-Two Interactive. The latest entry into the Civilization series, it was released on Microsoft Windows and macOS in October 2016, with later ports for Linux in February 2017, iOS in December 2017, and Nintendo Switch, the game's only console release, in November 2018. PlayStation 4 and Xbox One ports are planned in November 2019.\nSimilarly to previous installments, the goal for the player is to develop a civilization from an early settlement through many millennia to become a world power and achieve one of several victory conditions, such as through military domination, technological superiority, or cultural influence, over the other human and computer-controlled opponents. Players do this by exploring the world, founding new cities, building city improvements, deploying military troops to attack and defend from others, researching new technologies and cultural civics, and engaging in trade and negotiations with other world leaders.\nA critical design focus was to avoid having the player follow a pre-set path of improvements towards their civilization which they had observed from earlier games. Civilization VI places more emphasis on the terrain by \"unstacking\" city improvements from the main city space and giving bonuses for placing improvements near certain terrains. Other new features include research on the game's technology tree based on nearby terrain, a similar technology tree for cultural improvements and a better government civics structure for those playing on a cultural victory path, and new artificial intelligence mechanics for computer-controlled opponents that include secret goals and randomized engagements to disrupt an otherwise stable game. The game's first major expansion, Civilization VI: Rise and Fall, was released in February 2018, and a second expansion, Civilization VI: Gathering Storm, followed in February 2019.", "developer": ["Firaxis Games"], "genre": "Turn-based strategy", "date_release": "2016-10-21"}, "Clans to Kingdoms": {"description": null, "genre": "4X", "date_release": "2019-04-15"}, "Classic British Motor Racing": {"producer": "Stewart Green, John Brooks", "description": "Classic British Motor Racing is a racing video game developed by budget developer Data Design Interactive. It was published by Bold Games (Destineer) in North America in early 2008, and in PAL regions 2–4 months later. The game features 13 tracks and 13 classic British cars licensed by the developer, and players drive around famous areas of Britain. The game is playable with up to two people. Reviews were critically negative, which the Wii version holds a score of 35.50% from GameRankings, while the PS2 holds a score of 35%, respectively. The PlayStation 2 and Windows versions were released on 10 February 2006.", "genre": "Racing", "date_release": "2008-01-02"}, "The Club": {"composer": null, "description": null, "developer": ["Bizarre Creations"], "genre": "Third-person shooter", "date_release": "2008-02-07"}, "Cobalt": {"composer": "Mattias Häggström Gerdt", "description": "Cobalt is a chemical element with the symbol Co and atomic number 27. Like nickel, cobalt is found in the Earth's crust only in chemically combined form, save for small deposits found in alloys of natural meteoric iron. The free element, produced by reductive smelting, is a hard, lustrous, silver-gray metal.\nCobalt-based blue pigments (cobalt blue) have been used since ancient times for jewelry and paints, and to impart a distinctive blue tint to glass, but the color was later thought to be due to the known metal bismuth. Miners had long used the name kobold ore (German for goblin ore) for some of the blue-pigment producing minerals; they were so named because they were poor in known metals, and gave poisonous arsenic-containing fumes when smelted. In 1735, such ores were found to be reducible to a new metal (the first discovered since ancient times), and this was ultimately named for the kobold.\nToday, some cobalt is produced specifically from one of a number of metallic-lustered ores, such as cobaltite (CoAsS). The element is however more usually produced as a by-product of copper and nickel mining. The copper belt in the Democratic Republic of the Congo (DRC) and Zambia yields most of the global cobalt production. The DRC alone accounted for more than 50% of world production in 2016 (123,000 tonnes), according to Natural Resources Canada.Cobalt is primarily used in lithium-ion batteries, and in the manufacture of magnetic, wear-resistant and high-strength alloys. The compounds cobalt silicate and cobalt(II) aluminate (CoAl2O4, cobalt blue) give a distinctive deep blue color to glass, ceramics, inks, paints and varnishes. Cobalt occurs naturally as only one stable isotope, cobalt-59. Cobalt-60 is a commercially important radioisotope, used as a radioactive tracer and for the production of high energy gamma rays.\nCobalt is the active center of a group of coenzymes called cobalamins. Vitamin B12, the best-known example of the type, is an essential vitamin for all animals. Cobalt in inorganic form is also a micronutrient for bacteria, algae, and fungi.", "developer": ["Oxeye Game Studio", "[1]"], "genre": "Action", "date_release": "2016-02-02"}, "Command & Conquer": {"description": "Command & Conquer (C&C) is a real-time strategy (RTS) video game franchise, first developed by Westwood Studios. The first game was one of the earliest of the RTS genre, itself based on Westwood Studios' influential strategy game Dune II and introducing trademarks followed in the rest of the series. This includes full-motion video cutscenes with a notable ensemble cast to progress the story, as opposed to digitally in-game rendered cutscenes. Westwood Studios was taken over by Electronic Arts in 1998 and closed down in 2003. The studio and some of its members were absorbed into EA Los Angeles, which continued development on the series.", "developer": ["Westwood Studios"], "genre": "RTS", "date_release": "1995-08-01"}, "Command & Conquer: Generals": {"composer": null, "description": "Command & Conquer: Generals is a real-time strategy video game and the seventh installment in the Command & Conquer series. It was released for Microsoft Windows and Mac OS operating systems in 2003 and 2004. While the Windows version of Generals was developed by EA Pacific and published by EA Games, the Mac OS X version was developed and published by Aspyr Media. The Mac OS X version was re-released by Aspyr for the Mac App Store on March 12, 2015. In the game, the player can choose from three different factions: the United States, China and the Global Liberation Army (GLA).\nGenerals utilizes SAGE (Strategy Action Game Engine), an extended version of the Command & Conquer: Renegade's 3D engine. An expansion pack, entitled Command & Conquer: Generals – Zero Hour, was additionally released for PC in 2003, and for Mac OS in 2005. Both Generals and Zero Hour were met with highly positive reviews. A sequel, Command & Conquer: Generals 2, was in development, until it was repurposed to a free-to-play game known as simply Command & Conquer. The new game was part of the Generals franchise and was cancelled on October 29, 2013 by EA after negative feedback during the closed alpha test.", "developer": ["EA Pacific"], "genre": "RTS", "date_release": "2003-02-14"}, "Command & Conquer: Red Alert 2": {"composer": "Frank Klepacki", "description": "Command & Conquer: Red Alert 2 is a real-time strategy video game by Westwood Studios, which was released for Microsoft Windows on October 23, 2000 as the follow-up to Command & Conquer: Red Alert. Red Alert 2  picks up at the conclusion of the Allied campaign of the first game. Its expansion is Command & Conquer: Yuri's Revenge.\nCommand and Conquer: Red Alert 2 contains two playable factions, the Soviets and the Allies, which both previously appeared in Command & Conquer: Red Alert. The single player campaign is structured in an alternate-ending mode as opposed to a progressive story mode. Like its predecessor, Red Alert 2 features a large amount of full motion video cutscenes between missions and during gameplay, with an ensemble cast including Ray Wise, Udo Kier, Kari Wuhrer, and Barry Corbin.\nRed Alert 2 was a commercial and critical success, receiving a rating of 86% from GameRankings. A sequel, Command & Conquer: Red Alert 3, was released in 2008.", "developer": ["Westwood Pacific"], "genre": "RTS", "date_release": "2000-10-26"}, "Command & Conquer: Red Alert 3": {"producer": "Amer Ajami", "composer": null, "description": "Command & Conquer: Red Alert 3 is a real-time strategy video game developed by EA Los Angeles and published by Electronic Arts. It was released on October 28, 2008 in the United States for Microsoft Windows and October 30, 2008 in Europe. An Xbox 360 version was released on November 11. On January 21, 2009 EA announced Command & Conquer: Red Alert 3 – Ultimate Edition, the PlayStation 3 version which contains additional material was released on March 23, 2009 along with the OS X version by TransGaming. The game is a continuation of the Red Alert games within the Command & Conquer series. Command & Conquer: Red Alert 3 – Uprising, a stand-alone expansion pack, was released for Microsoft Windows in March 2009. It was offered via digital distribution.Like the previous entries in the Red Alert series, the game is set in an alternate reality from World War II, in which the Western Allies fight the Soviet Union. In Red Alert 3 the Soviet leadership, facing defeat, goes back in time to kill Albert Einstein and prevent his assistance to the allies, paving the way for Soviet domination in the present. However, as an unintended consequence, a third world power, the Empire of the Rising Sun, is created and all three sides go to war. The three factions are playable, with the gameplay involving constructing a base, gathering resources and training armies to defeat other players. Each faction has a fully co-operative campaign, playable with either an artificial intelligence partner or with another player online. The game intersperses strategy missions with full motion video footage featuring an ensemble cast starring J.K. Simmons, Tim Curry and George Takei as the leaders of the three factions.\nThe game received mostly positive reviews, with reviewers citing the co-operative and multiplayer components as strengths, along with the enhanced role of naval combat compared to other real-time strategy games. Commonly cited weaknesses included aspects such as unit pathfinding and an unstable netcode.", "developer": ["EA Los Angeles"], "genre": "RTS", "date_release": "2008-10-28"}, "Command & Conquer: Renegade": {"composer": "Frank Klepacki", "description": "Command & Conquer: Renegade is a first- and third-person shooter video game developed by Westwood Studios and is part of the Command & Conquer series. It is the only Command & Conquer game that uses the first-person view. It was released on February 27, 2002 by EA Games.", "developer": ["Westwood Studios"], "genre": "First-person shooter", "date_release": "2002-02-26"}, "Command & Conquer: Tiberian Sun": {"producer": null, "composer": null, "description": "Command & Conquer: Tiberian Sun is a real-time strategy video game developed by Westwood Studios and released in 1999. The main storyline follows the second major war between the Global Defense Initiative (GDI) of the United Nations, and the global terrorist organization known as the Brotherhood of Nod. The story takes place 30 years after the GDI had won the First Tiberium War in Command & Conquer.\nAs of February 12, 2010, Electronic Arts licensed Tiberian Sun and its expansion pack Firestorm as freeware.", "developer": ["Westwood Studios"], "genre": "RTS", "date_release": "1999-08-27"}, "Command & Conquer 3: Tiberium Wars": {"producer": "Amer Ajami", "composer": null, "description": "Command & Conquer 3: Tiberium Wars is a military science fiction real-time strategy video game developed and published by Electronic Arts for the Windows, Mac OS X and Xbox 360 platforms, and released internationally in March 2007. The direct sequel to 1999's Command & Conquer: Tiberian Sun by Westwood Studios which was taken over and liquidated by EA in 2003, Tiberium Wars returns the Command & Conquer series to its roots in the Tiberium story arc of the franchise, again featuring the factions of the Global Defense Initiative and the Brotherhood of Nod, and also introducing a new extraterrestrial faction known as the Scrin. An expansion pack to Tiberium Wars, titled Command & Conquer 3: Kane's Wrath, was released on March 24, 2008.\nTiberium Wars takes place about sixteen to seventeen years after the events of Tiberian Sun: Firestorm, at the advent of and during the \"Third Tiberium War\" when the Brotherhood of Nod launches a worldwide offensive against the Global Defense Initiative, abruptly ending 17 years of silence and temporarily crippling GDI. With the odds tipped in the Brotherhood's favor this time, GDI field commanders rally their troops and begin to combat Nod's second re-emergence, trying to restore lost hope. In the middle of it all, a new playable faction appears: the alien Scrin.", "developer": ["EA Los Angeles"], "genre": "RTS", "date_release": "2007-03-26"}, "Command & Conquer 4: Tiberian Twilight": {"composer": null, "description": "Command & Conquer 4: Tiberian Twilight is a real-time strategy video game, part of the Command & Conquer franchise, released March 16, 2010. It constitutes a final chapter in the Tiberium saga. The game was originally started as an Asian market online-only version of Command & Conquer 3. The game was released for download via online gaming distribution service Steam on March 19, 2010. Command & Conquer 4 also uses EA's own servers for online play, rather than GameSpy Servers which EA has relied on for previous Command & Conquer games. A closed beta of the game was released by EA to contest winners on November 21, 2009.", "developer": ["EA Los Angeles"], "genre": "RTS", "date_release": "2010-03-16"}, "Commandos: Behind Enemy Lines": {"description": "Commandos: Behind Enemy Lines is a 1998 real-time tactics video game developed by the Spanish company Pyro Studios and published by Eidos Interactive. The game sees players take control of a group of six Allied Commandos, who conduct a range of missions across wartime Europe and Africa, using small unit tactics. Each mission's objective varies, but ranges from sabotage, assassination, or rescuing captured allied units, with players having a full view of a mission's map to plan their strategy and its execution in advance.\nThe game proved to be a commercial success, with global sales above 1 million units. GameSpot Spain declared it Spain's biggest game hit of all time by 2002. The game branched out into a series that used the same system of game mechanics, beginning with an expansion pack entitled Commandos: Beyond the Call of Duty in 1999, and later with three sequels - Commandos 2: Men of Courage in 2001, Commandos 3: Destination Berlin in 2003 and Commandos: Strike Force in 2006.", "developer": ["Pyro Studios"], "genre": "RTS", "date_release": "1998-07-31"}, "Commandos: Beyond the Call of Duty": {"description": "Commandos: Behind Enemy Lines is a 1998 real-time tactics video game developed by the Spanish company Pyro Studios and published by Eidos Interactive. The game sees players take control of a group of six Allied Commandos, who conduct a range of missions across wartime Europe and Africa, using small unit tactics. Each mission's objective varies, but ranges from sabotage, assassination, or rescuing captured allied units, with players having a full view of a mission's map to plan their strategy and its execution in advance.\nThe game proved to be a commercial success, with global sales above 1 million units. GameSpot Spain declared it Spain's biggest game hit of all time by 2002. The game branched out into a series that used the same system of game mechanics, beginning with an expansion pack entitled Commandos: Beyond the Call of Duty in 1999, and later with three sequels - Commandos 2: Men of Courage in 2001, Commandos 3: Destination Berlin in 2003 and Commandos: Strike Force in 2006.", "developer": ["Pyro Studios"], "genre": "RTS", "date_release": "1999-03-31"}, "Commandos: Strike Force": {"producer": "José Manuel García Franco", "description": "Commandos: Strike Force is a first person tactical shooter video game and the fifth and final installment of the Commandos series. It is developed by Pyro Studios and published by Eidos Interactive.\nReleased during the first months of 2006, the game makes a departure from the first four games. Although the missions are set up in a similar fashion (several different objectives, some to be achieved through stealth, others through use of force) and in most occasions the player is allowed to change between different characters, this is the first game in the series to apply a first-person perspective, like many other World War II-inspired games, in contrast to the overhead view of the earlier games. Hence, the game is far more similar to the Medal of Honor or Call of Duty games than to earlier entries of the series.", "developer": ["Pyro Studios"], "genre": "RTS", "date_release": "2006-03-17"}, "Commandos 2: Men of Courage": {"description": "Commandos 2: Men of Courage is a real-time tactics video game, developed by Pyro Studios, published by Eidos Interactive, and released on September 20, 2001. It is a sequel to Commandos: Behind Enemy Lines and the second installment of the Commandos series, and is the only strategy game of the series to be designed not only for Microsoft Windows, but also for PlayStation 2 and Xbox. The game sees players taking control of a squad of commandos, along with various allied units, as they sneak behind enemy lines to accomplish various missions in World War II, between 1941 and 1944, that will help them to thwart the war efforts of the Germans and the Japanese. The game features several improvements to the gameplay from its predecessor, including the ability to use enemy weapons and explore interior locations, the inclusion of three new commandos, a number of new skills for the original six members along with their other abilities, and new pieces of equipment to help overcome the enemy.\nWhile the PC version of the game was well received, the console versions received less favourable reviews. In 2005, the game was bundled together with Commandos 3: Destination Berlin as part of the Commandos Battle Pack by Feral Interactive.", "developer": ["Pyro Studios"], "genre": "RTS", "date_release": "2001-09-21"}, "Commandos 3: Destination Berlin": {"description": "Commandos 3: Destination Berlin is a real-time tactics video game, the third installment of the Commandos series. It is developed by Pyro Studios and published by Eidos Interactive. The game is the first in the series to use a true 3D engine, and the last to use real-time tactics before being converted to a first-person shooter genre.\nThe Mac OS X version of the game was released in May 2005 by Feral Interactive along with Commandos 2: Men of Courage as part of the Commandos Battle Pack.", "developer": ["Pyro Studios"], "genre": "RTS", "date_release": "2003-10-23"}, "Company of Heroes": {"producer": "John Johnson", "composer": "Jeremy Soule", "description": "Company of Heroes is a 2006 real-time strategy video game developed by Relic Entertainment and published by THQ for the Microsoft Windows and OS X operating systems. It was the first title to make use of the Games for Windows label.\nCompany of Heroes is set during the Second World War and contains two playable factions. Players aim to capture strategic resource sectors located around the map, which they use to build base structures, produce new units, and defeat their enemies. In the single-player campaign the player commands two U.S. military units during the Battle of Normandy and the Allied liberation of France. Depending on the mission, the player controls either Able Company of the 29th Infantry Division's 116th Infantry, or Fox Company of the 101st Airborne Division's 506th PIR.\nCompany of Heroes received widespread acclaim, winning multiple awards for the best strategy game of the year. Two expansions were released for the game, the first one named Opposing Fronts in 2007, and the second one titled Tales of Valor in 2009. A free-to-play massively multiplayer online version of the game, Company of Heroes Online, was briefly released as open beta in South Korea in April 2010, before being cancelled in March 2011.The success of the game led to a sequel, Company of Heroes 2, which was released in 2013. As of January 2013, the whole Company of Heroes series has sold more than 4 million copies worldwide. There was also a film adaptation, starring Tom Sizemore.", "developer": ["Relic Entertainment"], "genre": "RTS", "date_release": "2006-09-12"}, "Company of Heroes 2": {"producer": "Greg Wilson", "composer": null, "description": "Company of Heroes 2 is a real-time strategy video game developed by Relic Entertainment and published by Sega for Microsoft Windows, OS X, and Linux. It is the sequel to the  2006 game Company of Heroes. As with the original Company of Heroes, the game is set in World War II but with the focus on the Eastern Front, with players primarily controlling the side of the Soviet Red Army during various stages of the Eastern Front, from Operation Barbarossa to the Battle of Berlin. Company of Heroes 2 runs on Relic Entertainment's proprietary Essence 3.0 game engine.\nIn January 2013, Sega acquired Relic Entertainment and along with it the Company of Heroes intellectual property from THQ. The game was released on June 25, 2013 in North America and Europe.", "developer": ["Relic Entertainment"], "genre": "RTS", "date_release": "2013-06-25"}, "Constantine": {"producer": null, "description": "Constantine the Great (Latin: Flavius Valerius Aurelius Constantinus Augustus; Ancient Greek: Κωνσταντῖνος ὁ Μέγας, romanized: Kōnstantînos ho Mégas; 27 February c. 272 AD – 22 May 337 AD), also known as Constantine I, was a Roman Emperor who ruled between 306 and 337 AD. Born in Naissus, in Dacia Ripensis, city now known as Niš (Serbian Cyrillic: Ниш, located in Serbia), he was the son of Flavius Valerius Constantius, a Roman Army officer of Illyrian origins.  His mother Helena was Greek. His father became Caesar, the deputy emperor in the west, in 293 AD. Constantine was sent east, where he rose through the ranks to become a military tribune under Emperors Diocletian and Galerius. In 305, Constantius was raised to the rank of Augustus, senior western emperor, and Constantine was recalled west to campaign under his father in Britannia (Britain).  Constantine was acclaimed as emperor by the army at Eboracum (modern-day York) after his father's death in 306 AD.  He emerged victorious in a series of civil wars against Emperors Maxentius and Licinius to become sole ruler of both west and east by 324 AD.\nAs emperor, Constantine enacted administrative, financial, social, and military reforms to strengthen the empire.  He restructured the government, separating civil and military authorities.  To combat inflation he introduced the solidus, a new gold coin that became the standard for Byzantine and European currencies for more than a thousand years.  The Roman army was reorganised to consist of mobile field units and garrison soldiers capable of countering internal threats and barbarian invasions.  Constantine pursued successful campaigns against the tribes on the Roman frontiers—the Franks, the Alamanni, the Goths, and the Sarmatians—even resettling territories abandoned by his predecessors during the Crisis of the Third Century.\nConstantine was the first Roman emperor to convert to Christianity. Although he lived much of his life as a pagan, and later as a catechumen, he joined the Christian faith on his deathbed, being baptised by Eusebius of Nicomedia.  He played an influential role in the proclamation of the Edict of Milan in 313, which declared religious tolerance for Christianity in the Roman empire.  He called the First Council of Nicaea in 325, which produced the statement of Christian belief known as the Nicene Creed.  The Church of the Holy Sepulchre was built on his orders at the purported site of Jesus' tomb in Jerusalem and became the holiest place in Christendom.  The Papal claim to temporal power in the High Middle Ages was based on the forged Donation of Constantine. He has historically been referred to as the \"First Christian Emperor\", and he did heavily promote the Christian Church.  Some modern scholars, however, debate his beliefs and even his comprehension of the Christian faith itself.The age of Constantine marked a distinct epoch in the history of the Roman Empire.  He built a new imperial residence at Byzantium and renamed the city Constantinople (now Istanbul) after himself (the laudatory epithet of \"New Rome\" came later, and was never an official title).  It became the capital of the Empire for more than a thousand years, with the later eastern Roman Empire, now being referred to as the Byzantine Empire by historians.  His more immediate political legacy was that he replaced Diocletian's tetrarchy with the principle of dynastic succession by leaving the empire to his sons.  His reputation flourished during the lifetime of his children and for centuries after his reign.  The medieval church upheld him as a paragon of virtue, while secular rulers invoked him as a prototype, a point of reference, and the symbol of imperial legitimacy and identity.  Beginning with the Renaissance, there were more critical appraisals of his reign, due to the rediscovery of anti-Constantinian sources.  Trends in modern and recent scholarship have attempted to balance the extremes of previous scholarship.", "developer": ["Bits Studios"], "genre": "Action-adventure", "date_release": "2005-02-14"}, "Contagion": {"description": null, "developer": ["Monochrome LLC"], "genre": "First-person shooter", "date_release": "2014-04-14"}, "Cossacks II: Battle for Europe": {"producer": "Sergey Grygorovych", "composer": "Alexey Omelchuk", "description": "Cossacks II: Napoleonic Wars is the fourth computer game in the Cossacks series of real-time strategy games, released in Spring 2005. This game focuses exclusively on the Napoleonic era, meaning it has a much shorter time span than others in this series, which spanned several centuries. Therefore, fewer technologies can be researched than in other Cossacks games, and there aren't as many different unit types for each country as before. On the other hand, Cossacks II allows a large number of units to be trained and it has many tactical options and an updated graphical engine.", "developer": ["GSC Game World"], "genre": "RTS", "date_release": "2006-06-19"}, "Counter-Strike": {"description": "Counter-Strike (CS) is a series of multiplayer first-person shooter video games, in which teams of terrorists battle to perpetrate an act of terror (bombing, hostage-taking, assassination) and counter-terrorists try to prevent it (bomb defusal, hostage rescue). The series began on Windows in 1999 with the first game, Counter-Strike. It was initially released as a modification (\"mod\") for Half-Life and designed by Minh \"Gooseman\" Le and Jess \"Cliffe\" Cliffe before the rights to the game's intellectual property were acquired by Valve Corporation, the developers of Half-Life.\nThat original game was followed by Counter-Strike: Condition Zero, developed by Turtle Rock Studios and released in 2004. In November of that year, Counter-Strike: Source was released by Valve. Released eight months after Condition Zero, Source was a remake of the original Counter-Strike and the first in the series to run on Valve's newly created Source engine. The fourth game in the main series, Counter-Strike: Global Offensive, was released by Valve in 2012 for Windows, OS X, Xbox 360, and PlayStation 3. Hidden Path Entertainment, who worked on Counter-Strike: Source post-release, helped to develop the game alongside Valve.There have been several community-made spin-off titles created over the years. These include the Online series, Neo, and Nexon: Zombies.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "1999-06-19"}, "Counter-Strike: Condition Zero": {"description": "Counter-Strike: Condition Zero is a first-person shooter video game developed by Ritual Entertainment, Turtle Rock Studios, and Valve, and published by Sierra Entertainment and Valve. The follow-up to Counter-Strike (1999), it was released in March 2004 for Microsoft Windows. Condition Zero utilizes the GoldSrc engine and has a multiplayer mode, which features updated character models, textures, maps and other graphical tweaks. It also includes two single-player campaigns; Tour of Duty and Condition Zero: Deleted Scenes.\nAlongside various other Valve titles, the game received versions for OS X and Linux in 2013.", "developer": ["Valve Corporation", "Gearbox Software", "Ritual Entertainment", "Turtle Rock Studios"], "genre": "First-person shooter", "date_release": "2004-03-23"}, "Counter-Strike: Global Offensive": {"composer": "Mike Morasky", "description": "Counter-Strike: Global Offensive (CS:GO) is a multiplayer first-person shooter video game developed by Hidden Path Entertainment and Valve Corporation. It is the fourth game in the Counter-Strike series and was released for Microsoft Windows, OS X, Xbox 360, and PlayStation 3 on August 21, 2012, while the Linux version was released in 2014.\nThe game pits two teams against each other: the Terrorists and the Counter-Terrorists. Both sides are tasked with eliminating the other while also completing separate objectives. The Terrorists, depending on the game mode, must either plant the bomb or defend the hostages, while the Counter-Terrorists must either prevent the bomb from being planted, defuse the bomb, or rescue the hostages. There are nine game modes, all of which have distinct characteristics specific to that mode. The game also has matchmaking support that allows players to play on dedicated Valve servers, as well as allowing members of the community to host their own servers with custom maps and game modes. A battle-royale game-mode, \"Danger Zone\", was introduced in 2018.\nGlobal Offensive received positive reviews from critics on release, who praised for its gameplay and faithfulness to predecessors, though it was criticized for some of its early features and was noted for differences between the console and PC versions. Since its release, it has drawn in an estimated 11 million players per month, and has gathered an active competitive scene, with many tournaments sponsored by Valve themselves. In December 2018, Valve transitioned the game to a free-to-play model, focusing on revenue from cosmetic items.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2012-08-12"}, "Counter-Strike Online": {"description": "Counter-Strike Online  is a first-person shooter video game, targeted towards Asia's gaming market released in 2008. It is based on Counter-Strike and was developed by Nexon Co. Ltd. with oversight from license-holder Valve Corporation. It uses a micropayment model that is managed by a custom version of Steam.", "developer": ["Valve Corporation", "Nexon Corporation"], "genre": "First-person shooter", "date_release": "2008-06-24"}, "Counter-Strike: Source": {"description": "Counter-Strike: Source  is a first-person shooter video game developed by Valve and Turtle Rock Studios. Released in November 2004 for Microsoft Windows, it is a remake of Counter-Strike (2000) using the Source game engine. As in the original, Counter-Strike: Source pits a team of counter-terrorists against a team of terrorists in a series of rounds. Each round is won either by completing an objective (such as detonating a bomb or rescuing hostages) or by eliminating all members of the enemy team. The game was initially bundled with all retail and digital copies of Half-Life 2 before being released standalone.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2004-09-01"}, "Crusader Kings": {"producer": "Johan Andersson", "composer": "Inon Zur", "description": "Crusader Kings II is a grand strategy game set in the Middle Ages, developed by Paradox Development Studio and published by Paradox Interactive as a sequel to Crusader Kings. It was released for Microsoft Windows on February 14, 2012. An OS X version, Paradox Interactive's first in-house development for the operating system, was released on May 24, 2012. A Linux version was also released on January 14, 2013. Since being released, it has sold over 1 million copies, which made it Paradox's most successful release before the release of Europa Universalis IV in August 2013.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2004-08-27"}, "Crusader Kings II": {"producer": "Johan Andersson", "composer": "Andreas Waldetoft", "description": "Crusader Kings II is a grand strategy game set in the Middle Ages, developed by Paradox Development Studio and published by Paradox Interactive as a sequel to Crusader Kings. It was released for Microsoft Windows on February 14, 2012. An OS X version, Paradox Interactive's first in-house development for the operating system, was released on May 24, 2012. A Linux version was also released on January 14, 2013. Since being released, it has sold over 1 million copies, which made it Paradox's most successful release before the release of Europa Universalis IV in August 2013.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2012-02-14"}, "Cryostasis: Sleep of Reason": {"description": "Cryostasis: Sleep of Reason (Russian: Анабиоз: Сон разума) is a psychological horror video game developed by Action Forms for Microsoft Windows.", "developer": ["Action Forms"], "genre": "Survival horror", "date_release": "2009-02-27"}, "Crysis": {"description": "Crysis is a first-person shooter video game series developed by German developer Crytek and published by Electronic Arts. The series revolves around a group of military protagonists with \"nanosuits,\" technologically advanced suits of armor that allow them to gain enhanced physical strength, speed, defense, and cloaking abilities. The protagonists face off against hostile North Korean soldiers, heavily armed mercenaries, and a race of technologically advanced aliens known as the Ceph, who arrived on Earth millions of years ago for unclear reasons, and have recently been awakened. The series consists of three main installments, a standalone spinoff of the first game with a separate multiplayer title, and a compilation.", "developer": ["Crytek"], "genre": "First-person shooter", "date_release": "2007-11-13"}, "Crysis Warhead": {"producer": "Bernd Diemer", "composer": "Peter Antovski", "description": "Crysis Warhead is a first-person shooter video game developed by the Hungarian studio Crytek Budapest and published by Electronic Arts. Crysis Warhead is a stand-alone expansion game and does not require the installation of the original Crysis to play.", "developer": ["Crytek Budapest"], "genre": "First-person shooter", "date_release": "2008-09-16"}, "Crysis 2": {"producer": null, "composer": null, "description": "Crysis 2 is a first-person shooter video game developed by Crytek, published by Electronic Arts and released in North America, Australia and Europe in March 2011 for Microsoft Windows, PlayStation 3, and Xbox 360. Officially announced on June 1, 2009, the game is the second main installment of the Crysis series, and is the sequel to the 2007 video game Crysis, and its expansion Crysis Warhead. The story was written by Richard Morgan, while Peter Watts was consulted and wrote a novel adaptation of the game. It was the first game to showcase the CryEngine 3 game engine and the first game using the engine to be released on consoles. A sequel, Crysis 3, was released in 2013.", "developer": ["Crytek", "Crytek UK"], "genre": "First-person shooter", "date_release": "2011-03-22"}, "Crysis 3": {"producer": "Joe Moulding", "composer": null, "description": "Crysis 3 is a first-person shooter video game developed by Crytek and published in 2013 by Electronic Arts for Microsoft Windows, PlayStation 3, and Xbox 360. It is the third main installment of the Crysis series, a sequel to the 2011 video game Crysis 2. The multiplayer portion of the game was developed by Crytek UK. Crysis 3's story revolves around Prophet, a Nanosuit holder who is on a quest to take revenge on the Alpha Ceph, the leader of the Ceph alien race. The game's story serves as the end of the Crysis trilogy. Gameplay revolves around the use of the Nanosuit, which grants players a variety of abilities such as being invisible. New features introduced in Crysis 3 include a new Nanosuit ability called \"Rip & Throw\", a compound bow and the \"hacking\" feature, which allows players to hack into enemies' equipment, drones, and security defenses.\nThe game is set in a post-apocalyptic New York City, in an effort to combine the urban landscape of Crysis 2 and the forest setting of the original Crysis. The game introduces the \"Seven Wonders\", with each wonder having its own unique landscape and tactical layout. Due to complaints about Crysis 2's linearity, the game's levels were opened up so as to grant players more freedom. The development team also put efforts into creating a more emotional story, and the story's protagonist was inspired by the lead character of District 9. The game was developed by a team of 100 people during its 23-month development cycle. Crytek UK developed the game's multiplayer portion.\nOfficially announced in April 2012, Crysis 3 received positive reviews upon release. Praise was directed at the weapon selection and customization, menus, visuals and multiplayer, while it was criticized for its story, level design, length, and outdated mechanics in comparison to its predecessors. With a budget of $66 million, the game sold 205,000 copies in its debut month, and became a commercial failure for Electronic Arts. The game was later included in The Crysis Trilogy, a bundle released in February 2014.", "developer": ["Crytek", "Crytek UK"], "genre": "First-person shooter", "date_release": "2013-02-19"}, "Curse of the Azure Bonds": {"composer": null, "description": "Curse of the Azure Bonds is a role-playing video game developed and published by Strategic Simulations, Inc (SSI) in 1989. It is the second in a four-part series of Forgotten Realms Advanced Dungeons & Dragons Gold Box adventure computer games, continuing the events after the first part, Pool of Radiance.\nAn adventure module of the same name, coded FRC2, was written based on the game.  There is also a prequel novel, Azure Bonds, that was written by Kate Novak and Jeff Grubb, and is the first book of the Finder's Stone trilogy.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1989-09-01"}, "The Cursed Crusade": {"description": "The Cursed Crusade is an action-adventure game developed by Kylotonn and published by DTP Entertainment for Europe, Atlus USA for North America and Ubisoft for Japan.", "developer": ["Kylotonn"], "genre": "Action-adventure", "date_release": "2011-10-25"}}