{"Damnation": {"description": "Damnation (from Latin damnatio) is the concept of divine punishment and torment in an afterlife for actions that were committed on Earth. In Ancient Egyptian religious tradition, citizens would recite the 42 negative confessions of Maat as their heart was weighed against the feather of truth. If the citizen's heart was heavier than a feather they would be devoured by Ammit. Zoroastrianism developed an eschatological concept of a Last Judgment called Frashokereti where the dead will be raised and the righteous wade through a river of milk while the wicked will be burned in a river of molten metal. Abrahamic religions such as Christianity have similar concepts of believers facing judgement on a last day to determine if they will spend eternity in Gehenna or heaven for their sin [Mark 3:29]. A damned human \"in damnation\" is said to be either in Hell, or living in a state wherein they are divorced from Heaven and/or in a state of disgrace from God's favor. In traditional Abrahamic demonology, the Devil rules Hell, where he and his demons punish the damned.\nFollowing the religious meaning, the words damn and goddamn are a common form of religious profanity, in modern times often semantically weakened to the status of mere interjections.", "developer": ["Blue Omega Entertainment"], "genre": "Third-person shooter", "date_release": "2009-05-25"}, "Dark Souls": {"producer": [null, null, null], "composer": "Motoi Sakuraba", "description": "Dark Souls is an action role-playing game developed by FromSoftware and published by Namco Bandai Games. A spiritual successor to FromSoftware's Demon's Souls, the game is the second instalment in the Souls series. It was released for the PlayStation 3 and Xbox 360 in Japan by FromSoftware in September 2011 and worldwide by Namco Bandai Games in the following month. Dark Souls takes place in the fictional kingdom of Lordran, where players assume the role of a cursed undead character who begins a pilgrimage to discover the fate of their kind.\nDark Souls received critical acclaim upon its release and is considered to be one of the greatest video games ever made, with critics praising the depth of its combat, intricate level design, and world lore. However, the game's difficulty received mixed reviews. While some praised the challenge it provides, others criticized it for being unnecessarily unforgiving. The original Windows version of the game was less well-received, with criticism directed at numerous technical issues.\nIn August 2012, a version of Dark Souls for Microsoft Windows, Dark Souls: Prepare To Die Edition, was released. It featured additional content not seen in the PlayStation 3 and Xbox 360 versions. In October 2012, the new content was made downloadable for consoles under the subtitle Artorias of the Abyss. By April 2013, the game had sold over two million copies worldwide.  A sequel to the game, Dark Souls II, was released in 2014. A second sequel, Dark Souls III, was released in 2016. A remastered version Dark Souls: Remastered, was released for PlayStation 4, Xbox One, Windows, and Nintendo Switch in 2018.\n\n", "developer": ["From Software"], "genre": "action role-playing", "date_release": "2011-09-22"}, "Dark Souls II": {"producer": "Masanori Takeuchi", "composer": null, "description": "Dark Souls II is an action role-playing game developed by FromSoftware and published by Bandai Namco Games. The third game in the Souls series, it was released for Microsoft Windows, PlayStation 3 and Xbox 360.\nAlthough both are set in the same universe, there is no direct story connection between the first Dark Souls and the sequel. The game uses dedicated multiplayer servers. Taking place in the kingdom of Drangleic, the game features both player versus environment (PvE) and player versus player (PvP) gameplay, in addition to having some co-op components. As in the earlier games in the series, it again features challenging gameplay, but with a more powerful graphics engine and more advanced artificial intelligence system.\nAfter some initial delays, the game was released worldwide in March 2014, with the Microsoft Windows version being released on April 24, 2014. An updated version of the game, subtitled Scholar of the First Sin, was released for PlayStation 3, PlayStation 4, Xbox 360, Xbox One and Microsoft Windows in April 2015. The title is a compilation of the original game and all of its downloadable content with upgraded graphics, expanded online multiplayer capacity, and various other changes. A sequel, Dark Souls III, was released in 2016.", "developer": ["From Software"], "genre": "action role-playing", "date_release": "2014-03-11"}, "Dark Souls III": {"composer": null, "description": "Dark Souls III is an action role-playing video game developed by FromSoftware and published by Bandai Namco Entertainment for PlayStation 4, Xbox One, and Microsoft Windows. An entry in the Souls series, Dark Souls III was released in Japan in March 2016 and worldwide in April 2016.\nDark Souls III was critically and commercially successful, with critics calling it a worthy and fitting conclusion to the series. It was the fastest-selling game in Bandai Namco's history, shipping over three million copies worldwide within the first two months after release. A complete version containing the base game and both downloadable content expansions, titled Dark Souls III: The Fire Fades, was released in April 2017.", "developer": ["From Software"], "genre": "action role-playing", "date_release": "2016-03-24"}, "Dark Sun Online: Crimson Sands": {"description": "Dark Sun Online: Crimson Sands is an early massively multiplayer online role-playing game (MMORPG) that was developed and published by Strategic Simulations, Inc. in 1996 for Windows 95. Dark Sun Online is based on the licensed Dark Sun campaign setting for the Advanced Dungeons & Dragons tabletop role-playing game. Dark Sun Online was one of the first fully graphical MMORPGs.\nDark Sun Online was one of the first fully graphical MMORPGs to feature a number of features popularized by later games like Ultima Online, such as nearly unrestricted player versus player combat.  Due to the game's peer-to-peer structure, the game was susceptible to hacking by its players. The Dark Sun Online servers were shut down in 1998 when its publisher was discontinued, and official support and development for Dark Sun Online had ceased by 1999.", "developer": ["Strategic Simulations, Inc."], "genre": "RPG", "date_release": "1996-02-01"}, "Dark Sun: Shattered Lands": {"description": "Dark Sun: Shattered Lands is a turn-based role-playing video game that takes place in the Dungeons and Dragons' campaign setting of Dark Sun. It was released for MS-DOS in a somewhat unfinished state in 1993 by Strategic Simulations, and later patched to a more workable version. It was available on both floppy disk and CD-ROM, though the CD-ROM contained no additional content and was merely used to install the game to the computer's hard drive.\nIt was later re-released as part of the AD&D Masterpiece Collection in 1996. In addition, Data East was developing console ports for the Sega Saturn and Sony PlayStation for release in 1996, but they were cancelled.\nThe game had a sequel, Dark Sun: Wake of the Ravager, in 1994. An online MMORPG, Dark Sun Online: Crimson Sands, was released in 1996 and hosted on the T.E.N. Network.\nThe game was re-released in 2015 on Gog.com with support for Windows, macOS, and Linux.", "developer": ["Strategic Simulations, Inc."], "genre": "RPG", "date_release": "1993-09-01"}, "Dark Sun: Wake of the Ravager": {"description": "Dark Sun: Wake of the Ravager is a role-playing video game developed and published by Strategic Simulations in 1994 for the MS-DOS operating system. It is the sequel to Dark Sun: Shattered Lands. Wake of the Ravager was initially released in two boxed versions: on floppy disk and on CD-ROM, with the latter featuring digitised voice and music (as Red Book CD tracks). It was later re-released in a CD-ROM jewel case form factor, and also as part of the AD&D Masterpiece Collection in 1996. The game was re-released in 2015 on Gog.com with support for Windows, macOS, and Linux.", "developer": ["Strategic Simulations, Inc."], "genre": "RPG", "date_release": "1995-01-01"}, "Darksiders 2": {"producer": "Ryan Stefanelli", "composer": "Jesper Kyd", "description": "Darksiders II is an action role-playing hack and slash action-adventure video game developed by Vigil Games and published by THQ. It is the sequel to Darksiders and was released in August 2012 for Microsoft Windows, PlayStation 3, Xbox 360 and as a launch title for Wii U upon the console's Australian, European, and North American release in November 2012. The story follows the efforts of player character Death to clear the name of his brother, War, who stands accused of wiping out humanity.\nA remastered version, titled Darksiders II: Deathinitive Edition, was published by Nordic Games for the PlayStation 4, Xbox One and Microsoft Windows in 2015, and ported to the Nintendo Switch in 2019. A parallel sequel, Darksiders III, was released on November 27, 2018.", "developer": ["Vigil Games"], "genre": "Hack and slash", "date_release": "2012-08-14"}, "Darkstone: Evil Reigns": {"producer": null, "composer": "Christophe Rime", "description": "Darkstone: Evil Reigns (Darkstone in North America) is an action role-playing video game developed by Delphine Software International for Microsoft Windows and PlayStation. In 2014, the French publisher Anuman Interactive launched a remake available on iPad, iPhone and Android, with the cooperation of the original game's author Paul Cuisset.", "developer": ["Delphine Software International"], "genre": "Action RPG", "date_release": "1999-07-31"}, "Daryl F. Gates' Police Quest: SWAT": {"producer": null, "composer": "Dan Kehler", "description": "Police Quest: SWAT is the fifth game in the Police Quest series. It is graphic adventure game released in 1995, and re-released in 2016 for Steam. With extensive use of FMV videos for its basic gameplay, the game required four CD-ROMs.", "developer": ["Sierra Entertainment"], "genre": "Interactive movie", "date_release": "1995-09-30"}, "Day of Defeat": {"composer": "Michael Gordon Shapiro", "description": "Day of Defeat is a team-based multiplayer first-person shooter video game set in the European theatre of World War II on the Western front. Originally a modification of the 1998 game Half-Life, the rights of the modification were purchased by Valve Corporation and released as a full retail title in 2003.\nSet in the midst of World War II, Day of Defeat includes no single-player campaign, with focus left only on the game's multiplayer aspects. The game favors teamwork and features objective-based gameplay in combination with its system of classes. Maps are primarily made up of narrow paths, all of which typically lead to a few key locations. An official remake of the game, Day of Defeat: Source, was released by Valve in 2005. Utilizing the then-new Source engine, the remake featured various improvements over its predecessor, including updates to gameplay, graphics, and audio functionality.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2000-08-04"}, "Day of Defeat: Source": {"composer": "Dan Haigh", "description": "Day of Defeat: Source is a team-based online first-person shooter multiplayer video game developed by Valve Corporation. Set in World War II, the game is a remake of Day of Defeat. It was updated from the GoldSrc engine used by its predecessor to the Source engine, and a remake of the game models. The game was released for Microsoft Windows on September 26, 2005, distributed through Valve's online content delivery service Steam. Retail distribution of the game was handled by Electronic Arts.\nThe game was announced in February 2005. During the course of its development, Day of Defeat: Source progressed from being a straight conversion of Day of Defeat, to the alteration of certain aspects of the game's design and introduction of several features. In addition, Day of Defeat: Source has been used by Valve to present new design features on the Source engine, such as high dynamic range rendering and cinematic effects. The game itself revolves around two teams, the  U.S. Army and the Wehrmacht, each with access to six player classes, fighting in a variety of scenarios inspired by World War II engagements in the European Theatre of 1944.\nUpon release, the game received a generally favorable reception, praised for its atmospheric and strategic gameplay and its graphics, audio work and overall presentation. However, the game was criticized for the lack of content in it at the time of release, although subsequent updates to the game have added new game modes and levels.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2005-09-26"}, "DayZ": {"producer": "Eugen Harton", "description": "DayZ is a survival video game developed and published by Bohemia Interactive. It is the standalone successor of the mod of the same name. Following a five-year long early access period for Windows, the game was officially released in December 2018, and was released for the Xbox One and PlayStation 4 in 2019.\nThe game places the player in the fictional post-Soviet Republic of Chernarus, where a mysterious plague has turned most of the population into violent \"infected\". As a survivor, the player must scavenge the world for food, water, weapons, and medicine, while killing or avoiding the infected, and killing, avoiding, or cooperating with other players in an effort to survive the outbreak.\nDayZ began development in 2012 when the mod's creator, Dean Hall, joined Bohemia Interactive to commence work on the standalone version of the game. The development has been focused on altering the engine to suit the game's needs, developing a working client-server architecture, and introducing new features like diseases and a better inventory system. The game sold over three million copies during its early access phase.", "developer": ["Bohemia Interactive"], "genre": "Open-world", "date_release": "2013-12-16"}, "Dead Island": {"description": "Dead Island is a 2011 survival horror action role-playing video game developed by Techland and published by Deep Silver for Microsoft Windows, Linux, OS X, PlayStation 3, and Xbox 360.  Centered on the challenge of surviving a zombie-infested open world with a major emphasis on melee, the plot focuses on four playable survivors trying to survive and escape off the fictional island of Banoi.\nThe game was announced at the 2006 Electronic Entertainment Expo, but was delayed until 2011.  The game's cinematic announcement trailer was met with controversy.  The game was released in September 2011 for North America and Europe, with an October 2011 release in Japan.  The game received generally lukewarm reviews, and while praised for its atmosphere, gameplay, and characters, it was also criticized for the large technical difficulties and in-game glitches, as well as the graphics.\nA stand-alone expansion, Dead Island: Riptide, was released in 2013.  A spin-off, Escape Dead Island, was released on 18 November 2014.  A sequel, Dead Island 2, was set to be released in 2016, but has been delayed indefinitely.  A remastered version of the game was released for the PlayStation 4, Xbox One, and PC on 31 May 2016 under the title Dead Island: Definitive Collection; it bundles the game with Riptide, all DLC, and a 16-bit side-scrolling game called Dead Island: Retro Revenge.", "developer": ["Techland"], "genre": "Zombies", "date_release": "2011-10-20"}, "Dead Space": {"producer": [null, null], "composer": "Jason Graves", "description": null, "developer": ["EA Redwood Shores"], "genre": "Survival horror", "date_release": "2008-10-20"}, "Dead Space 2": {"producer": "David Woldman", "composer": "Jason Graves", "description": "Dead Space 2 is a survival horror video game in third-person view, developed by Visceral Games and published by Electronic Arts for Microsoft Windows, PlayStation 3 and Xbox 360, released in January 2011. Set three years after the events of the first Dead Space, the game follows protagonist Isaac Clarke's fight against a new Necromorph outbreak on the Sprawl, a space station surrounding a shard of Saturn's largest moon, Titan. Unlike its predecessor, Dead Space 2 has a multiplayer mode, pitting human characters against Necromorphs across the Sprawl. A Collector's Edition is available for all three platforms; the PlayStation 3 Limited Edition includes Dead Space: Extraction as a PlayStation Move compatible title. A port for Wii was planned, but not released.It is one of the most expensive video games ever made, with a $120 million budget split evenly between development and marketing during 2008 to 2010.A sequel, Dead Space 3, was released in February 2013.", "developer": ["Visceral Games"], "genre": "Survival horror", "date_release": "2011-01-25"}, "Dead Space 3": {"producer": "Steve Papoutsis", "composer": null, "description": "Dead Space 3 is a survival horror action-adventure video game developed by Visceral Games and published by Electronic Arts. Announced at E3 2012 and released internationally in February 2013, it is the sequel to Dead Space 2 and the third main entry in the Dead Space series.In Dead Space 3, Isaac Clarke teams up with EarthGov Sergeant John Carver as they travel to Tau Volantis, an ice-covered planet, to end the Marker and Necromorph threat for good.\nDevelopment of the game began after the completion of Dead Space 2. It is the only game in the Dead Space series to feature online co-op.\nThe game received positive reviews from game critics upon release; reviewers praised the game's rewarding action gameplay, although criticism was directed at the focus on action over horror, as well as a weak and unfocused story compared to its predecessors. Despite poor sales, EA and Visceral expressed interest in a sequel. However, Visceral Games was shut down in 2017, and no confirmation that a new installment in the series is being developed by another studio.", "developer": ["Visceral Games"], "genre": "Survival horror", "date_release": "2013-02-05"}, "Deadlight": {"producer": [null, null], "composer": "David García Díaz", "description": "Deadlight is a 2012 sidescrolling cinematic platforming survival horror video game developed by Tequila Works and published by Microsoft Studios for Xbox 360 and Microsoft Windows. It was released for Xbox 360 in August via Xbox Live Arcade, and for Windows in October via Steam. In 2016, a Director's Cut version of the game was released for Windows, PlayStation 4 and Xbox One, published by Deep Silver.\nThe game is intended as a throwback and homage to classic sidescrolling cinematic platformers of the 1980s and early 1990s, such as Prince of Persia, Another World and Flashback. Set in Seattle in 1986, the game tells the story of Randall Wayne, a former park ranger who sets out to find his family in the aftermath of a zombie apocalypse. Separated from the group with whom he has joined, Wayne must attempt to traverse Seattle to get to the \"safe zone\", where he believes his family will be waiting. On the way however, he must avoid both zombie hordes, and a group of vigilantes known as the \"New Law\", who have established themselves as the de facto authority in Seattle. As he travels across the city, he begins to question his memory of the events during the early stages of the outbreak.\nDeadlight received mixed reviews, with critics praising the graphics and atmosphere, but criticizing the game's brevity and linearity. The PC version was generally seen as superior to the Xbox 360 version. The game was nominated for \"Best Debut Game\" at the 9th British Academy Games Awards, losing to The Unfinished Swan.", "developer": ["Tequila Works"], "genre": "Cinematic platformer", "date_release": "2012-08-01"}, "Dear Esther": {"producer": "Dan Pinchbeck", "composer": "Jessica Curry", "description": "Dear Esther is a first-person exploration and adventure video game developed by The Chinese Room for Microsoft Windows, Mac OS X, PlayStation 4 and Xbox One. First released in 2008 as a free-to-play modification for the Source game engine, the game was entirely redeveloped for a commercial release in 2012. Featuring minimalistic gameplay, the player's only objective in the game is to explore an unnamed island in the Hebrides, listening to a troubled man read a series of letters to his deceased wife. Details of her mysterious death are revealed as the player moves throughout the island.\nThe Chinese Room released a spiritual successor to Dear Esther, titled Everybody's Gone to the Rapture, in 2015.\nIn 2017 an updated version, Dear Esther: Landmark Edition was released, based on the Unity engine.", "developer": ["The Chinese Room"], "genre": "Art", "date_release": "2012-02-14"}, "Death Knights of Krynn": {"composer": null, "description": "Death Knights of Krynn is the second in a three-part series of Dragonlance Advanced Dungeons & Dragons \"Gold Box\" role-playing video games,  published by Strategic Simulations, Inc.  The game was released in 1991.The story is a continuation of the events after Champions of Krynn and is followed by The Dark Queen of Krynn.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1991-01-15"}, "Deathmatch Classic": {"description": "This is a list of GoldSrc mods (modifications) for the video game Half-Life.\nThe list is divided into two categories: clientside and serverside mods. These terms do not necessarily indicate whether each mod can be run on multiplayer servers.\nClientside mods add content to the game, such as a new storyline, models or sounds. In contrast, serverside mods add functionality.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2001-06-01"}, "Defcon": {"composer": "Alistair Lindsay and Michael Maidment", "description": "The defense readiness condition (DEFCON) is an alert state used by the United States Armed Forces.The DEFCON system was developed by the Joint Chiefs of Staff (JCS) and unified and specified combatant commands.   It prescribes five graduated levels of readiness (or states of alert) for the U.S. military. It increases in severity from DEFCON 5 (least severe) to DEFCON 1 (most severe) to match varying military situations.DEFCONs are a subsystem of a series of Alert Conditions, or LERTCONs, which also include Emergency Conditions (EMERGCONs).", "developer": ["Introversion Software"], "genre": "RTS", "date_release": "2006-09-29"}, "Delta Force": {"producer": "Wes Eckhart", "composer": null, "description": "The 1st Special Forces Operational Detachment-Delta (SFOD-D), commonly referred to as Delta Force, Combat Applications Group (CAG), \"The Unit\", Army Compartmented Element (ACE), or within JSOC as Task Force Green, is an elite special operations force of the United States Army, under operational control of the Joint Special Operations Command. The unit is tasked with specialized missions primarily involving counter-terrorism, hostage rescue, direct action, and special reconnaissance, often against high-value targets. Delta Force and its Navy counterpart, DEVGRU (SEAL Team 6), are the U.S. military's primary Tier 1 Special Mission Units tasked with performing the most complex, classified, and dangerous missions directed by the National Command Authority.Most Delta Force operators are selected from the United States Army Special Operations Command's elite Special Forces Groups and the 75th Ranger Regiment, as well as from other special operations units.", "developer": ["NovaLogic"], "genre": "Tactical shooter", "date_release": "1998-11-01"}, "Delta Force 2": {"producer": "Wes Eckhart", "composer": null, "description": "Delta Force 2 is a tactical first-person shooter video game developed by NovaLogic and released in 1999. It is the second game in the Delta Force series and was followed by Delta Force: Land Warrior one year later. The game was re-released in 2009 on Steam.", "developer": ["NovaLogic"], "genre": "Tactical shooter", "date_release": "1999-11-03"}, "Delta Force: Black Hawk Down": {"producer": "Wes Eckhart", "composer": null, "description": "Delta Force: Black Hawk Down is a first-person shooter video game developed by NovaLogic. It was released for Microsoft Windows on March 23, 2003; for Mac OS X in July 2004; and for PlayStation 2 and Xbox on July 26, 2005. It is the 6th game of the Delta Force series. It is set in the early 1990s during the Unified Task Force peacekeeping operation in Somalia. The missions take place primarily in the southern Jubba Valley and the capital Mogadishu.", "developer": ["NovaLogic"], "genre": "First-person shooter", "date_release": "2003-03-24"}, "Delta Force: Black Hawk Down: Team Sabre": {"description": "Delta Force: Black Hawk Down – Team Sabre is the expansion pack to Delta Force: Black Hawk Down. Team Sabre adds more weapons, that can be used in servers that only have Delta Force: Black Hawk Down.  The Team Sabre expansion gives the player a new character to choose, the British elite commando unit SAS. Team Sabre adds a few more terrains which are mostly jungle and desert terrains. The expansion pack also gives the player two more campaigns which are in fictional based areas, fighting the renegade general Haatim Jaareah Kalb in the deserts of Iran and the elusive drug lord Antonio Paulo in the jungles of Colombia. The main difference from the original is the difficulty, with fewer saves and longer levels.\nSierra Entertainment and Novalogic announced in October 2006 that a PlayStation 2 version of Delta Force: Black Hawk Down: Team Sabre was being released in late November 2006. The video game, developed by Rebellion Developments, is a completely redeveloped version of Team Sabre featuring additional weapons and vehicles not seen in the original PlayStation 2 version of Delta Force: Black Hawk Down. At the same time, a Mobile phone version of the game was released in fall 2006.", "developer": ["NovaLogic"], "genre": "First-person shooter", "date_release": "2004-01-20"}, "Delta Force: Land Warrior": {"producer": "Wes Eckhart", "composer": null, "description": "Delta Force: Land Warrior is a tactical first-person shooter video game. It is the third game in the Delta Force series developed and published by NovaLogic, and is the sequel to Delta Force 2. A stand-alone expansion pack, Delta Force: Task Force Dagger, was released in 2002.", "developer": ["NovaLogic"], "genre": "Tactical shooter", "date_release": "2000-11-07"}, "Delta Force: Task Force Dagger": {"description": "Delta Force: Task Force Dagger is a first-person shooter video game developed by Zombie Studios and published by NovaLogic. It's a stand alone expansion pack to Delta Force: Land Warrior. It is set in Afghanistan in the year 2002. As such it is the first game in the series to be set in a real-world conflict.", "developer": ["Zombie Studios"], "genre": "First-person shooter", "date_release": "2002-06-27"}, "Delta Force: Xtreme": {"description": "Delta Force: Xtreme 2 (DFX2) is a first-person shooter video game by NovaLogic.NovaLogic's previous title was Delta Force: Xtreme, which was released in April 2005.", "developer": ["NovaLogic"], "genre": "First-person shooter", "date_release": "2005-04-22"}, "Delta Force: Xtreme 2": {"composer": "Scott Lee", "description": "Delta Force: Xtreme 2 (DFX2) is a first-person shooter video game by NovaLogic.NovaLogic's previous title was Delta Force: Xtreme, which was released in April 2005.", "developer": ["NovaLogic"], "genre": "First-person shooter", "date_release": "2009-06-02"}, "Democracy 3": {"description": "Democracy is a government simulation game that was first developed by Positech Games in 2005, with a sequel released in December 2007 and a third game in 2013. The player plays as if they are the president or prime minister of a democratic government. The player must introduce and alter policies in seven areas – tax, economy, welfare, foreign policy, transport, law and order and public services. Each policy has an effect on the happiness of various voter groups, as well as affecting factors such as crime and air quality. The player has to deal with \"situations\", which are typically problems such as petrol protests or homelessness, and also has to make decisions on dilemmas that arise each turn.\n\n", "developer": ["Positech Games"], "genre": "Government simulation", "date_release": "2013-10-14"}, "Demon's Souls": {"producer": [null, null], "composer": "Shunsuke Kida", "description": "Demon's Souls is an action role-playing game developed by FromSoftware for the PlayStation 3 under the supervision of SCE Japan Studio. It was published in Japan by Sony Computer Entertainment in February 2009, in North America by Atlus USA in October 2009, and in PAL territories by Namco Bandai Games in June 2010. The game is referred to as a spiritual successor to FromSoftware's King's Field series.\nDemon's Souls is set in Boletaria, a kingdom consumed by a dark being called the Old One following its release through the use of forbidden Soul Arts. Players take on the role of a hero brought to Boletaria to kill its fallen king Allant and pacify the Old One. Gameplay has players navigating five different worlds from the hub of the Nexus, with a heavy emphasis on challenging combat and mechanics surrounding player death and respawning. Online multiplayer allows both player cooperation and world invasion with player versus player combat.\nThe game's early development was troubled due to a lack of coherent vision. Due to its struggles, FromSoftware staff member Hidetaka Miyazaki was able to take over the project and turned it into its current form. The game's difficulty was intended to both evoke classic video games and provide a sense of challenge and accomplishment for players. This aspect proved difficult for Miyazaki, partly because of his fear that Sony would ask the team to lower the difficulty. The multiplayer elements were inspired by events in Miyazaki's life.\nAnnounced in 2008, early reaction to its demo was seen as negative, and its high difficulty prompted Sony to pass on publishing the game outside of Japan. While it met with middling sales and reception in Japan, it became a commercial and critical success in the West. Praise went to its high difficulty and addictive gameplay, with  winning several awards. Its success began a series of related games, continuing with Dark Souls in 2011.", "developer": ["From Software"], "genre": "Action role-playing", "date_release": "2009-02-05"}, "Deus Ex": {"producer": "Warren Spector", "composer": null, "description": "Deus Ex is a series of role-playing video games. The first two games in the series were developed by Ion Storm, and subsequent entries were developed by Eidos Montréal, following Ion Storm's closure. The series, set during the 21st century, focuses on the conflict between secretive factions who wish to control the world by proxy, and the effects of transhumanistic attitudes and technologies in a dystopian future setting.\nThe series consists of six games: Deus Ex (2000), Deus Ex: Invisible War (2003), Deus Ex: Human Revolution (2011), Deus Ex: The Fall (2013),  Deus Ex Go (2016) and Deus Ex: Mankind Divided (2016). The series has received critical acclaim and sold over 5 million units worldwide.", "developer": ["Ion Storm"], "genre": "Action role-playing", "date_release": "2000-06-26"}, "Deus Ex: Human Revolution": {"producer": "David Anfossi", "composer": "Michael McCann", "description": "Deus Ex: Human Revolution is an action role-playing video game developed by Eidos Montréal and published worldwide by Square Enix in August 2011 for Microsoft Windows, PlayStation 3, and Xbox 360: a version for OS X released the following year. It is the third game in the Deus Ex series, and a prequel to the original Deus Ex. The gameplay—combining first-person shooter, stealth, and role-playing elements—features exploration and combat in environments connected to multiple city-based hubs, in addition to quests that grant experience and allow customization of the main character's abilities with items called Praxis Kits. Conversations between characters feature a variety of responses, with options in conversations and at crucial story points affecting how some events play out.\nSet in the year 2027, Human Revolution focuses on ex-SWAT officer Adam Jensen, who is employed as a security officer for Sarif Industries, a company on the leading edge of advanced and controversial artificial organs dubbed \"augmentations\". An attack on Sarif Industries that apparently kills researcher and Adam's ex-girlfriend Megan Reed also leaves Adam critically injured. To save him, company CEO David Sarif subjects him to an extensive augmentation procedure: six months later, now recovered and possessing advanced augmentations, Adam sets out to pursue his attackers and the shadowy organization behind them. The story explores themes of transhumanism, the growing power of megacorporations, and their impact on social class. It also uses the series' recurring cyberpunk setting and conspiracy theory motif.\nDevelopment of Human Revolution began in 2007 with a small team within the fledgling Eidos Montréal studio, after multiple aborted attempts to create a sequel at original developer Ion Storm following the 2003 release of Deus Ex: Invisible War. The two key influences were the myth of Icarus, a thematic element carried over from Deus Ex; and the artwork and ideas of the Renaissance, which influenced the story, graphics, and music, while combining with the series' typical cyberpunk elements. The open-ended nature of the gameplay was tricky for the team to achieve; as a result, the boss battles were outsourced to another developer due to time constraints. The music, composed by Michael McCann, focused on ambiance and three-layered compositions over character themes and overt melodies.\nHuman Revolution was first announced in 2007, soon after beginning development. Its official title and release window were announced in 2010. After release, a downloadable episode titled The Missing Link was developed, featuring improvements on the original gameplay. A director's cut, featuring further improvements and post-release and promotional content, was released in 2013 for the original platforms and Wii U. Human Revolution received critical acclaim, with praise going to its player-driven plot, general gameplay, and freedom of choice in both story and character customization. The major criticisms went to its boss fights and recurring technical problems. The director's cut received additional praise for its revamped gameplay elements. Human Revolution spawned a spin-off titled Deus Ex: The Fall, and the direct sequel Deus Ex: Mankind Divided.", "developer": ["Eidos Montréal"], "genre": "Action role-playing", "date_release": "2011-08-23"}, "Deus Ex: Invisible War": {"producer": [null, null], "composer": null, "description": "Deus Ex: Invisible War is an action role-playing video game developed by Ion Storm and published by Eidos Interactive for Microsoft Windows personal computers (PC) and the Xbox home console. The game released in 2003 in North America and 2004 in other regions. It is the second game in the Deus Ex series, and a direct sequel to the original game. The gameplay—combining first-person shooter, stealth, and role-playing elements—features exploration and combat in environments connected to multiple city-based hubs, in addition to quests that can be completed in a variety of ways and flexible character customization. Conversations between characters feature a variety of responses, with options in conversations at crucial story points affecting how some events play out.\nInvisible War takes place twenty years after Deus Ex. The game follows a scenario where the first game's events led to a period of war and economic depression dubbed the \"Collapse\", which resulted in several factions attaining power and influence across the world. The player character, Alex D, is evacuated from Chicago to Seattle following a terrorist attack, soon becoming embroiled in a network of plots as the world's factions fight for control of the world. In addition to the series' recurring cyberpunk setting and conspiracy theory motif, the story focuses on the theme of terrorism.\nDevelopment of Invisible War began following the success of Deus Ex. The aim was to create a more accessible version of the original game's systems while preserving its essentials. Original designer Harvey Smith directed the game, while Alexander Brandon and Sheldon Pacotti returned respectively as composer and scenario writer. Additional music and voice work was provided by the rock band Kidneythieves. Due to being developed for PC and Xbox, the game's environments needed to be designed with the console's hardware limitations in mind. In later interviews, members of the team have faulted their decisions for the title.\nAt its initial release, the game was acclaimed for its graphics and the freedom of choice in both gameplay and story. Criticism was directed towards below-par enemy artificial intelligence, controversial design choices, and issues with the PC port. The game has sold over one million copies worldwide as of 2011. Later opinions from both journalists and the game's staff have been polarized, with several websites calling Invisible War the weakest entry in the Deus Ex series. After several unsuccessful attempts at creating a third Deus Ex title prior to Ion Storm's 2005 closure, a prequel to the first game titled Deus Ex: Human Revolution was developed by Eidos Montréal and released in 2011.", "developer": ["Ion Storm"], "genre": "Action role-playing", "date_release": "2003-12-03"}, "Deus Ex: Mankind Divided": {"producer": [null, null], "composer": null, "description": "Deus Ex: Mankind Divided is an action role-playing video game developed by Eidos Montréal and published worldwide by Square Enix in August 2016 for Microsoft Windows, PlayStation 4 and Xbox One. Versions for Linux and macOS systems were released in 2016 and 2017, respectively. It is the fourth game in the Deus Ex series, and a sequel to the 2011 game Deus Ex: Human Revolution. The gameplay—combining first-person shooter, stealth and role-playing elements—features exploration and combat in environments connected to the main hub of Prague and quests which grant experience and allow customization of the main character's abilities with Praxis Kits. Conversations between characters have a variety of responses, with options in conversations and at crucial story points affecting how events play out. Players can complete Breach, a cyberspace-set challenge mode, in addition to the main campaign. Breach was later released as a free, standalone product.\nSet two years after Human Revolution in 2029, the world is divided between normal humans and those with advanced, controversial artificial organs dubbed \"augmentations\". After a violent event known as the Aug Incident, augmented people have been segregated; this prompts heated debate and an era of \"mechanical apartheid\". Main protagonist Adam Jensen, equipped with advanced new augmentations after Human Revolution, is a double agent for the hacker group Juggernaut Collective to expose the Illuminati, which is orchestrating events behind the scenes. The story explores themes of transhumanism and discrimination, using the series' recurring cyberpunk setting and conspiracy theory motif.\nProduction of Mankind Divided began after completion of the Human Revolution expansion The Missing Link. Eidos Montréal wanted to improve its gameplay and narrative, and address criticism from fans and reviewers of Human Revolution. The gameplay and graphics engine were rebuilt from scratch for next-generation hardware. A greater focus on realism and the story's darker themes resulted in a subdued color range compared to the previous game. Human Revolution composer Michael McCann returned to write the score with newcomers Sascha Dikiciyan and Ed Harrison.\nThe game was announced in 2015, after a lengthy promotional campaign. Subsequent marketing slogans were criticized by journalists, and a divisive tier-based preorder campaign was cancelled due to player backlash. Post-launch, story-based downloadable content was released in 2016. Critical reception of Mankind Divided was positive, and the game's narrative, graphics and gameplay were praised. Criticism focused on the brevity of its campaign and the handling of its themes.", "developer": ["Eidos Montréal"], "genre": "Action role-playing", "date_release": "2016-08-23"}, "Diablo": {"producer": "Bill Roper", "composer": "Matt Uelmen", "description": null, "developer": ["Blizzard North"], "genre": "Action role-playing", "date_release": "1996-12-31"}, "Diablo II": {"producer": null, "composer": "Matt Uelmen", "description": "Diablo II is an action role-playing hack-and-slash computer video game developed by Blizzard North and published by Blizzard Entertainment in 2000 for Microsoft Windows, Classic Mac OS, and macOS. The game, with its dark fantasy and horror themes, was conceptualized and designed by David Brevik and Erich Schaefer, who, with Max Schaefer, acted as project leads on the game. The producers were Matthew Householder and Bill Roper.\nBuilding on the success of its predecessor, Diablo (1996), Diablo II was one of the most popular games of 2000 and has been cited as one of the greatest video games ever made. Major factors that contributed to the game's success include: its continuation of popular fantasy themes from the previous game, and its access to Blizzard's free online play service, Battle.net. An expansion to the game, Diablo II: Lord of Destruction, was released in 2001. Another sequel in the series, Diablo III, was announced in 2008 and released on May 15, 2012. Diablo Immortal, the fourth installment in the series, was announced during Blizzcon 2018 and is set after Diablo II: Lord of Destruction.", "developer": ["Blizzard North"], "genre": "Action role-playing", "date_release": "2000-06-29"}, "Diablo III": {"producer": "Alex Mayberry", "composer": "Russell Brower", "description": "Diablo III is a dungeon crawler hack-and-slash action role-playing game developed and published by Blizzard Entertainment as the third installment in the Diablo franchise. It was released for Microsoft Windows and OS X in May 2012, the PlayStation 3 and Xbox 360 in September 2013, the PlayStation 4 and Xbox One in August 2014, and the Nintendo Switch in November 2018. In the game, players choose to play as one of seven character classes – Barbarian, Crusader, Demon Hunter, Monk, Necromancer, Witch Doctor, or Wizard – and are tasked with defeating the Lord of Terror, Diablo, as in previous games in the series.\nAn expansion pack entitled Reaper of Souls was released for the original PC versions of the game in March 2014. It was later released for consoles as part of the Diablo III: Ultimate Evil Edition version in August 2014. The Diablo III: Rise of the Necromancer pack was released for the Windows, macOS, and latest-generation console editions of the game in June 2017. Diablo III: Eternal Collection, combining Reaper of Souls and Rise of the Necromancer, was released for PlayStation 4 and Xbox One in June 2017, and for the Nintendo Switch in November 2018.\nThe game received critical acclaim, although its always-on DRM feature was criticized. The game set a new record for \"fastest-selling PC game\" by selling over 3.5 million copies in the first 24 hours of its release, and became the best-selling PC game of 2012 by selling over 12 million copies. As of August 2015, the number of sales had grown to over 30 million.", "developer": ["Blizzard Entertainment"], "genre": "Action role-playing", "date_release": "2012-05-15"}, "Digital Combat Simulator": {"description": "Digital Combat Simulator World (DCS World) is a free to play combat flight simulator. It includes a free Sukhoi Su-25T Frogfoot attack aircraft and TF-51D Mustang, an unarmed training variant of the P-51D Mustang. DCS is expandable through additional modules as well as user-made add-ons and mods. While the Su-25T and TF-51D are free, additional modules (aircraft and maps) developed by both Eagle Dynamics and third party developers are only available by purchase. Upcoming modules include the P-47D Thunderbolt, the F-16C Fighting Falcon, and various other aircraft.\nDCS: World is considered one of the foremost combat flight simulators currently available, with its fully simulated aircraft being meticulously created and accurate to their real-life counterparts. Some aircraft, such as the F/A-18C Hornet and A-10C Warthog, have cockpit interaction that is identical to that of the real aircraft.", "developer": ["Eagle Dynamics"], "genre": "Flight simulator", "date_release": "2008-12-10"}, "Dino D-Day": {"description": "Dino D-Day is a multiplayer team-based first-person shooter video game developed by American studios 800 North and Digital Ranch. It was released for Microsoft Windows on April 8, 2011.The premise of the game is that during World War II, Adolf Hitler found a way to resurrect dinosaurs for use in the war effort. Players can battle online choosing to serve either the Allied nations or Nazis. The game was described as a new twist on \"the overdone World War II FPS [...] that has become a running joke in the industry and gaming press\".", "genre": "Action", "date_release": "2011-04-08"}, "Dirt 3": {"description": "Dirt 3 (stylised as DiRT3) is a racing video game developed and published by Codemasters for Microsoft Windows, PlayStation 3 and Xbox 360. It is the eighth game in the Colin McRae Rally series.\nIn September 2011, there were reports that a network security problem on the website of an AMD promo had resulted in the loss of 3 million Dirt 3 keys to the public for use via the Steam platform that have then been posted in various places around the internet.", "developer": ["Codemasters"], "genre": "Racing", "date_release": "2011-05-24"}, "Divine Divinity": {"composer": "Kirill Pokrovsky", "description": "Divine Divinity is an action role-playing game developed by Larian Studios and published by cdv Software Entertainment for Microsoft Windows, which was released in September 2002. It has three sequels, Beyond Divinity, Divinity II, and Divinity: Original Sin II. It also has a prequel, Divinity: Original Sin, and a spin-off, Divinity: Dragon Commander.", "developer": ["Larian Studios"], "genre": "RPG", "date_release": "2002-09-22"}, "Dofus": {"description": "Dofus is a tactical turn-oriented massively multiplayer online role-playing game (MMORPG) developed and published by Ankama Games, a French computer game manufacturer. Originally released solely in French, it has since been translated into many other languages. The game includes both pay-to-play accounts offering the full experience and free-to-play accounts offering a more limited amount of content. Its success has led to the marketing of spin-off products, such as books, art, comics and a movie released in 2016. It has also led to the development of two continuations: Dofus Arena, released at the beginning of 2006, which is an alternative \"tournament\" version of Dofus; and Wakfu, a continuation of Dofus. The game has attracted over 40 million players worldwide and is especially well known in France. Today, there are more than 1.5 million subscribers every month on the game.\n\n", "developer": ["Ankama Games"], "genre": "MMORPG", "date_release": "2004-09-01"}, "Doom": {"composer": null, "description": "Doom (stylized as DOOM or DooM in other media) is a first-person shooter (FPS) game developed by id Software for MS-DOS released in December 10, 1993. It is one of the most significant games in video game history, and is frequently cited as one of the greatest games of all time.\nPlayers assume the role of a space marine, popularly known as \"Doomguy\", fighting his way through hordes of invading demons from Hell. The first episode, comprising nine levels, was distributed freely as shareware and played by an estimated 15–20 million people within two years; the full game, with two further episodes, were sold via mail order. An updated version with an additional episode, Ultimate Doom, was released in 1995 and sold at retail.\nAlong with its predecessor Wolfenstein 3D, Doom helped define the FPS genre and inspired numerous similar games, known as \"Doom clones\". It pioneered online distribution and technologies including 3D graphics, networked multiplayer gaming, and support for customized modifications via packaged files (WADs). Its graphic violence and hellish imagery made it the subject of controversy.\nThe Doom franchise continued with Doom II: Hell on Earth (1994) and numerous expansion packs, including Master Levels for Doom II (1995) and Final Doom (1996), all ported to numerous platforms. The source code was released in 1997, inspiring further adaptations. Id returned to the franchise with Doom 3 (2004), a horror-focused retelling using the id Tech 4 engine, followed by a 2005 Doom film. A 2016 reboot, also titled Doom, powered by id Tech 6, returned to the fast-paced action of the first games.", "developer": ["id Software"], "genre": "First-person shooter", "date_release": "1993-12-10"}, "Doom II: Hell on Earth": {"composer": "Robert Prince", "description": "Doom II: Hell on Earth is a first-person shooter video game, the second title of id Software's Doom franchise. It was originally released for MS-DOS computers in 1994 and Macintosh computers in 1995. Unlike Doom, which was initially only available through shareware and mail order, Doom II was a commercial release sold in stores. Master Levels for Doom II, an expansion pack that includes 21 new levels, was released on December 26, 1995 by id Software.Due to its success and popularity, Doom II was later released for the Game Boy Advance in 2002, on Xbox Live Arcade in 2010, and on Nintendo Switch, PlayStation 4, and Xbox One in 2019. The release of the original Doom source code has facilitated ports to many other platforms, including the Apple iPhone and several other types of cell phones.", "developer": ["id Software"], "genre": "First-person shooter", "date_release": "1994-09-30"}, "Doom 3": {"composer": "Clint Walsh", "description": "Doom 3 is a horror first-person shooter video game developed by id Software and published by Activision. Doom 3 was originally released for Microsoft Windows on August 3, 2004. The game was adapted for Linux later that year, as well as being ported by Aspyr Media for Mac OS X in 2005. Developer Vicarious Visions ported the game to the Xbox, releasing it on April 3, 2005.\nIgnoring the events of the previous Doom games, the game is the first reboot to the series. Doom 3 is set in 2145 on Mars, where a military-industrial conglomerate has set up a scientific research facility to research into fields such as teleportation, biological research and advanced weapons design. However, the teleportation experiments inadvertently open a gateway to Hell, resulting in a catastrophic invasion by demons. The player character, an anonymous space marine, must fight through the base and find a way to stop the demons attacking Mars. Doom 3 utilizes the id Tech 4 game engine, which has since been licensed out to other developers, and later released under the GNU General Public License in November 2011.\nThe game was a critical and commercial success; with more than 3.5 million copies of the game sold, it is the most successful game by developer id Software to date. Critics praised the game's graphics and presentation, although reviewers were divided by how close the gameplay was to that of the original Doom, focusing primarily on simply fighting through large numbers of enemy characters. The game was followed by Resurrection of Evil, an expansion pack developed by Nerve Software in April 2005, while a Doom film loosely based on the series was released in October 2005. A series of novelizations of Doom 3, written by Matthew J. Costello, debuted in February 2008. An expanded and remastered BFG Edition was released in the fourth quarter of 2012, while a version based on BFG Edition of the game was released without online multiplayer for Nintendo Switch in July 2019.", "developer": ["id Software"], "genre": "Survival horror", "date_release": "2004-08-03"}, "DOOM": {"producer": "Timothy Bell", "composer": "Mick Gordon", "description": "Doom (stylized as DOOM or DooM in other media) is a first-person shooter (FPS) game developed by id Software for MS-DOS released in December 10, 1993. It is one of the most significant games in video game history, and is frequently cited as one of the greatest games of all time.\nPlayers assume the role of a space marine, popularly known as \"Doomguy\", fighting his way through hordes of invading demons from Hell. The first episode, comprising nine levels, was distributed freely as shareware and played by an estimated 15–20 million people within two years; the full game, with two further episodes, were sold via mail order. An updated version with an additional episode, Ultimate Doom, was released in 1995 and sold at retail.\nAlong with its predecessor Wolfenstein 3D, Doom helped define the FPS genre and inspired numerous similar games, known as \"Doom clones\". It pioneered online distribution and technologies including 3D graphics, networked multiplayer gaming, and support for customized modifications via packaged files (WADs). Its graphic violence and hellish imagery made it the subject of controversy.\nThe Doom franchise continued with Doom II: Hell on Earth (1994) and numerous expansion packs, including Master Levels for Doom II (1995) and Final Doom (1996), all ported to numerous platforms. The source code was released in 1997, inspiring further adaptations. Id returned to the franchise with Doom 3 (2004), a horror-focused retelling using the id Tech 4 engine, followed by a 2005 Doom film. A 2016 reboot, also titled Doom, powered by id Tech 6, returned to the fast-paced action of the first games.", "developer": ["id Software"], "genre": "First-person shooter", "date_release": "2016-05-13"}, "Dota 2": {"composer": null, "description": "Dota 2 is a multiplayer online battle arena (MOBA) video game developed and published by Valve Corporation. The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos and its expansion pack, The Frozen Throne. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map. Each of the ten players independently controls a powerful character, known as a \"hero\", who all have unique abilities and differing styles of play. During a match, players collect experience points and items for their heroes to successfully defeat the opposing team's heroes in player versus player combat. A team wins by being the first to destroy the other team's \"Ancient\", a large structure located within their base.\nDevelopment of Dota 2 began in 2009 when IceFrog, lead designer of Defense of the Ancients, was hired by Valve to create a modernized remake for them in the Source game engine. It was officially released for Microsoft Windows, OS X, and Linux-based personal computers via the digital distribution platform Steam in July 2013, following a Windows-only open beta phase that began two years prior. The game is fully free-to-play with no heroes or any other gameplay element needing to be bought or otherwise unlocked. To maintain it, Valve supports the game as a service, offering loot boxes and a battle pass subscription system called Dota Plus that offer non-gameplay altering virtual goods in return, such as hero cosmetics and audio replacement packs. The game has also been updated with various other features since release, such as a port to the Source 2 engine and virtual reality support.\nDota 2 has a large esports scene, with teams from around the world playing in various professional leagues and tournaments. \nValve manages an event format known as the Dota Pro Circuit, which are a series of tournaments that award qualification points for earning direct invitations to The International, the game's premier annual tournament. Internationals feature a crowdfunded prize money system that has seen amounts in upwards of US$30 million, making Dota 2 the most lucrative esport game. Media coverage of most tournaments is done by a selection of on-site staff who provide commentary and analysis for the ongoing matches, similar to traditional sporting events. In addition to playing matches to a live audience in arenas and stadiums, broadcasts of them are also streamed live over the internet, and sometimes simulcast on television networks, with peak viewership numbers in the millions.\nDespite some criticism going towards its steep learning curve and overall complexity, Dota 2 was praised for its rewarding gameplay, production quality, and faithfulness to its predecessor, with many considering it to be one of the greatest video games of all time. Since its release, it has been one of the most played games on Steam, with over a million concurrent players at its peak. The popularity of the game has led to official merchandise for it being produced, including apparel, accessories, and toys, as well as promotional tie-ins to other games and media. The game also allows for the community to create their own gamemodes, maps, and cosmetics, which are uploaded to the Steam Workshop. In the late 2010s, Valve released two spinoff games featuring the setting of Dota 2. The first, Artifact, is a digital collectible card game, while the second, Dota Underlords, is a chess-like game derived from Dota Auto Chess, a popular community-created mod from within the game. Dota 2 has also been used in machine learning experiments, with a team of bots known as the OpenAI Five showing the capability to defeat professional players.", "developer": ["Valve Corporation"], "genre": "MOBA", "date_release": "2013-07-09"}, "Dragon Age II": {"composer": "Inon Zur", "description": "Dragon Age II is an action role-playing video game developed by BioWare and published by Electronic Arts (EA) for Microsoft Windows, PlayStation 3, Xbox 360 and OS X. It is the second major game in the Dragon Age series and was released worldwide in March 2011. Set in the world of Thedas, introduced in Dragon Age: Origins, players assume the role of Hawke, a human mage, rogue, or warrior who arrives in the city of Kirkwall as a lowly refugee, and becomes its legendary champion over a turbulent decade of political and social conflict. In the game, players explore and engage in combat from a third-person perspective. Players encounter various companions, who play major roles in the game's plot and gameplay. Depending on players' decisions and dialogue, a companion will either recognize Hawke as a friend or a rival.\nBioWare began the game's development during the production of Origins's expansion pack Awakening. EA gave them only 14 to 16 months to finish the game's development, thus forcing the team to crunch for an extended period and reuse assets. BioWare looked at players' feedback and reviews of Origins, and decided to improve its gameplay, making it more action-oriented. They improved the Eclipse Engine, renaming it Lycium, to enhance the game's visuals and lighting, and accommodate a new art style inspired by movies like Yojimbo and Conan. Both David Gaider and Inon Zur, who worked on Origins, returned and served as lead writer and composer respectively.\nThe game received generally positive reviews from critics. They praised its gameplay, companions and writing, though they had mixed feelings about the storytelling structure, and the diminished focus on tactics and strategy. Employing reused assets, and setting the game entirely in one city, were widely criticized. It received a more polarized response from players, though more than one million copies were sold in less than two weeks, a faster sales pace than its predecessor. A sequel, Dragon Age: Inquisition was released in November 2014.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2011-03-08"}, "Dragon Age: Inquisition": {"producer": "Cameron Lee", "composer": "Trevor Morris", "description": "Dragon Age: Inquisition is an action role-playing video game developed by BioWare and published by Electronic Arts. The third major game in the Dragon Age franchise, Dragon Age: Inquisition is the sequel to Dragon Age: Origins and Dragon Age II. The game was released worldwide in November 2014 for Microsoft Windows, PlayStation 3, PlayStation 4, Xbox 360, and Xbox One.\nThe story of Dragon Age: Inquisition follows a player character known as the Inquisitor on a journey to settle the civil unrest in the continent of Thedas and close a mysterious tear in the sky called the \"Breach\", which is unleashing dangerous demons upon the world. The Inquisitor is viewed by some as the 'chosen one', as they have a 'Mark' on their hand capable of closing the Breach. The Inquisitor assembles the titular Inquisition in an attempt to stop Corypheus, an ancient darkspawn, who opened the Breach in the course of his attempt to conquer Thedas and achieve godhood.\nGameplay of Dragon Age: Inquisition is similar to its predecessors and mostly consists of elements found in a typical action role-playing game; players control their customized Inquisitor, and the companions they meet. They can defeat enemies with swords and magic, complete side quests, interact with non-playable characters, and progress through the main story. Players mainly control their protagonists in a third-person view, though a traditional role-playing game top down camera angle is also available.\nAfter the release of Dragon Age II, the Dragon Age series was seen by some as a series with an \"identity crisis\". As a result, Bioware sought to create a third Dragon Age game that combined the elements of the first two. Having begun development in 2011, the game was officially announced at the 2013 Electronic Entertainment Expo. The game's soundtrack was primarily composed by Trevor Morris, who replaced Inon Zur, the composer of the Dragon Age: Origins and Dragon Age II soundtracks. Several downloadable content expansion packs were also released.\nDragon Age: Inquisition received critical acclaim upon release, with critics praising its story, voice acting, soundtrack, detailed environments, and engaging combat. The game did receive some criticism for the presence of technical issues. It was awarded over 150 year-end accolades and nominated for more, including Game of the Year and Best Role-playing awards from several gaming publications.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2014-11-18"}, "Dragon Age: Origins": {"producer": null, "composer": "Inon Zur", "description": "Dragon Age: Origins is a role-playing game developed by BioWare and published by Electronic Arts. It is the first game in the Dragon Age franchise, and was released for Microsoft Windows, PlayStation 3, and Xbox 360 in November 2009, and for Mac OS X in December 2009. Set in the fictional kingdom of Ferelden during a period of civil strife, the game puts the player in the role of a warrior, mage, or rogue coming from an elven, human, or dwarven background. The player character is recruited into the Grey Wardens, an ancient order that stands against demonic forces known as \"Darkspawn\", and is tasked with defeating the Archdemon that commands them and ending their invasion. The game is played from a third-person perspective that can be shifted to a top-down perspective. Throughout the game, players encounter various companions, who play major roles in the game's plot and gameplay.\nBioWare described Dragon Age: Origins as a \"dark heroic fantasy\" set in a unique world, and a spiritual successor to their previous Baldur's Gate and Neverwinter Nights franchises. Its setting was inspired by The Lord of the Rings and A Song of Ice & Fire, and was described by BioWare as a mix between high fantasy and low fantasy. Development of the game began in 2002 and BioWare employed more than 144 voice-actors, and hired Inon Zur to compose the game's music. The development of the game's console versions was outsourced to Edge of Reality.\nOrigins received critical acclaim upon release, with praise mostly directed at its story, setting, characters, music and combat system. It sold more than 3.2 million copies and 1 million pieces of downloadable content. Its multiple year-end accolades included Game of the Year and Best Role-playing awards from several gaming publications. BioWare released several instances of downloadable content after the game's initial launch, an expansion pack for the game titled Awakening in March 2010, and two sequels, Dragon Age II and Dragon Age: Inquisition, were released in 2011 and 2014 respectively.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2009-11-03"}, "Dragon Age: Origins – Awakening": {"producer": "Fernando Melo", "composer": "Inon Zur", "description": "Dragon Age: Origins – Awakening is the expansion for the role-playing video game Dragon Age: Origins. Awakening adds a new campaign that takes place during the aftermath of Dragon Age: Origins. The game features new class specializations and skills for the player to develop. Awakening was released for Microsoft Windows, OS X, PlayStation 3 and Xbox 360 on March 16, 2010, in North America, March 18 in Europe, and March 19 in the United Kingdom. It was released for the Mac on August 31, 2010.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2010-03-16"}, "Dragon Quest X": {"producer": "Yosuke Saito", "composer": "Koichi Sugiyama", "description": "Dragon Quest X is a massively multiplayer online role-playing game (MMORPG) developed and published by Square Enix. It is the tenth mainline entry in the Dragon Quest series. It was originally released for the Wii in 2012, and was later ported for Wii U, Microsoft Windows, PlayStation 4, Nintendo Switch, Android, iOS, and Nintendo 3DS, all of which support cross-platform play. Outside of a Windows version in Chinese, the game was not localized outside of Japan.\nDragon Quest X is set in the world of Astoltia, with the player character being initially human before an attack by the Lord of Hell Nelgel forces their soul into the body of another race. Following this, they must gather magical gems to seal Nelgel once again, while the player character's sibling is sent back in time to be safe from Nelgel. Gameplay follows a combination of elements from the Dragon Quest and other contemporary MMORPGs, such as real-time combat in an open world environment and a job system tied to skills and abilities.\nConcepts for an MMORPG within the Dragon Quest series began among a small team during the later development of Dragon Quest VIII. Development progressed alongside that of Dragon Quest IX. The aim was to make it accessible to series fans and newcomers alike, along with creating a long-term content plan. The development team featured multiple series veterans, including director Jin Fujisawa, series creator and designer Yuji Horii, series artist Akira Toriyama, and series composer Koichi Sugiyama. New staff members included producer Yosuke Saito, who had previously worked on the Drakengard series and whose company Orca helped with development; and Chikara Saito, who joined took over as director in 2013.\nDragon Quest X was teased in 2008, with its full reveal as an MMORPG in 2011. Critical reception to the game have been generally positive, with praise going to its integrating of Dragon Quest features into an MMORPG structure. The game has since received several expansion packs and other updates. By 2014, the game had sold over one million copies across all versions.", "developer": ["Square Enix", "Armor Project"], "genre": "RPG", "date_release": "2012-08-02"}, "Dragon's Dogma": {"producer": [null, null], "composer": null, "description": "Dragon's Dogma is an action role-playing hack and slash video game developed and published by Capcom for PlayStation 3 and Xbox 360 in 2012. An enhanced version subtitled Dark Arisen was released for the game's original consoles (2013), then later ported to Microsoft Windows (2016), PlayStation 4 and Xbox One (2017), and Nintendo Switch (2019). Set in the high fantasy world of Gransys, the player takes on the role of a human protagonist dubbed the Arisen on a quest to defeat the dragon Grigori, a being said to herald the world's end, while uncovering a deeper conspiracy along the way.\nThe gameplay focuses on the Arisen—a customizable avatar—exploring Gransys completing quests and fighting monsters in real-time combat. The protagonist is accompanied by Pawns, characters who provide combat support and advice; the protagonist has one customized Pawn, and two additional Pawns either pre-set within the game or other customized Pawns shared by other players through an online lobby. Both standard combat and boss battles involve grappling with or climbing on enemies.\nThe design document for Dragon's Dogma was created by director Hideaki Itsuno in 2000 prior to working on Devil May Cry 2. Itsuno successfully pitched the project and production began in 2008. The 150-strong staff took inspiration from Western RPGs including The Elder Scrolls IV: Oblivion and Fable II. The music, led by Tadayoshi Makino and including contributions from Western composer Inon Zur, used on a full orchestra and focused on ambiance. Dark Arisen was designed to incorporate fan feedback and offer a complete experience for both old and new players.\nThe original version of Dragon's Dogma was praised by critics. Praise was given to the gameplay and the Pawn system, while the narrative was generally criticized as lacking. The Dark Arisen version was praised for its technical improvements and additional content. The original Dragon's Dogma sold over one million copies worldwide, and the different versions of Dark Arisen also met with positive sales. A Japan-exclusive massively multiplayer online role-playing game titled Dragon's Dogma Online released in 2015.", "developer": ["Capcom"], "genre": "Action role-playing", "date_release": "2012-05-22"}, "Dragons of Flame": {"composer": null, "description": "Dragons of Summer Flame is a 1995  fantasy novel by American writers Margaret Weis and Tracy Hickman. The events of the novel follow the fictional Chaos War in the Dragonlance world.", "developer": ["U.S. Gold"], "genre": "Action", "date_release": "1989-09-01"}, "DragonStrike": {"composer": null, "description": null, "developer": ["Westwood Associates"], "genre": "RPG", "date_release": "1990-01-01"}, "DRAMAtical Murder": {"description": "Dramatical Murder (ドラマティカル マーダー, Doramatikaru Mādā, stylized as DRAMAtical Murder) is a Japanese BL visual novel developed and published by Nitro+chiral. It was originally released on March 23, 2012 for Windows PCs as a first press edition, with a regular edition released on April 27, 2012. It was re-released as Dramatical Murder re:connect also for Windows PCs on April 26, 2013, this time containing additional scenes, images and songs. On October 30, 2014, a version of the visual novel aimed at ages 15 and above titled Dramatical Murder re:code was released for the PlayStation Vita which removed the sex scenes, toned down the violence,  and included an additional route for the character Mizuki.An anime adaption by studio NAZ premiered on July 6, 2014. It is directed by Kazuya Miura, with Tōko Machida and Kabura Fuchii handling series composition, Yukiko Ban designing the characters and Yuki Hayashi composing the music.On July 4, 2018, it was announced at the Anime Expo that JAST USA's new JAST BLUE branch, which focuses on boys-love games, will release Nitro+CHiRAL's DRAMAtical Murder games and its other visual novel titles in English.", "developer": ["Nitro+chiral"], "genre": "BL game", "date_release": "2012-03-23"}, "Driver": {"producer": "Peter Hawley", "composer": "Allister Brimble", "description": null, "developer": ["Reflections Interactive"], "genre": "Driving", "date_release": "1999-06-25"}, "Driver 3": {"composer": "Marc Canham", "description": "Driver 3 (stylized as DRIV3R) is a 2004 open world action-adventure video game. It is the third installment in the Driver series and was developed by Reflections Interactive and published by Atari, Inc.. Driver 3 was released in North America for the PlayStation 2 and Xbox on 21 June 2004. In Europe, it was released on 25 June, although due to the way Atari shipped the title across the continent, it made its way into independent UK retailers before the release date, reaching sixth place in the ELSPA chart for that week. A simplified version of the game for mobile phones was developed and released by Sorrent and published in North America on 23 June 2004, while it was published by Unique Games in Europe. On 15 March 2005, it was released on PC for US customers, it was also released on Game Boy Advance 25 October 2005. At one point a Nintendo GameCube version and an N-Gage version were planned, but both were cancelled. The game received mixed reviews on all platforms except the PC, which received mostly unfavorable reviews.\nAlthough two Driver games were published between them, 2011's Driver: San Francisco is considered the sequel to Driver 3.", "developer": ["Reflections Interactive"], "genre": "Racing", "date_release": "2004-06-24"}, "Driver: Parallel Lines": {"composer": null, "description": "Driver: Parallel Lines is the fourth installment in the Driver video game series. It is a departure from previous titles in the series that focused on multiple cities, as the game takes place in New York City, within the periods of 1978 and 2006. It is also the only title not to involve the undercover cop, John Tanner, but instead focuses on a getaway driver named T.K., who seeks revenge on a gang he worked with during his youth, after they framed him for the murder of a drug lord they held for ransom. Due to the underwhelming performance of Driver 3, particularly the often-derided on-foot sections, Parallel Lines returns to the formula used in earlier games in the series, focusing on driving, although shooting remains in the game, while the game is more open-ended than previous titles. It was released in March 2006 on PlayStation 2 and Xbox by Atari, Inc., and on Microsoft Windows and the Wii in June 2007 by Ubisoft.", "developer": ["Reflections Interactive"], "genre": "Racing", "date_release": "2006-03-14"}, "Driver: San Francisco": {"producer": [null, null, null], "composer": "Marc Canham", "description": "Driver: San Francisco is an action-adventure racing video game and the fifth instalment in the Driver series. Developed by Ubisoft Reflections and published by Ubisoft, it was released on September 2011 for the PlayStation 3, Wii, Xbox 360 and Microsoft Windows, with an edition for Mac OS X in March 2012. The game sees players traversing a fictional version of San Francisco and the Bay area conducting missions through the use of licensed real-world cars, with the ability to shift into any car in the game's setting in most platform editions. The game's main story sees players controlling John Tanner, a police detective, who falls into a coma pursuing his nemesis Charles Jericho following a prison breakout after the events of Driv3r, and finds himself piecing together his plan in a dream world while it is happening in real life.\nThe game received favourable reviews upon its release, with the exception of the Wii edition which received mixed reviews. A mini-comic series was released which provides plot details of the events between Driv3r and San Francisco, with the game receiving a collector's edition that include additional multiplayer vehicles and single-player events.", "developer": ["Ubisoft Reflections"], "genre": "Action-adventure", "date_release": "2011-09-01"}, "Duke Nukem": {"producer": "Scott Miller", "composer": "Scott Miller", "description": "Duke Nukem is a video game series named for its protagonist, Duke Nukem. Created by the company Apogee Software Ltd. (now 3D Realms) as a series of video games for IBM-compatible personal computers, the series expanded to games released for various consoles by third-party developers. The first two games in the main series were 2D platformers and the rest have been 3D first-person shooters.\nDuring 2010 the rights of the series were acquired by the company Gearbox Software, who completed the development of Duke Nukem Forever and released it on 10 June 2011 in Europe and Australia and on 14 June 2011 in North America.\nThe voice actor for Duke Nukem is Jon St. John.", "developer": ["Apogee Software"], "genre": "Platformer", "date_release": "1991-07-01"}, "Dune": {"producer": null, "composer": "Stéphane Picq", "description": "In physical geography, a dune is a hill of loose sand built by aeolian processes (wind) or the flow of water. Dunes occur in different shapes and sizes, formed by interaction with the flow of air or water. Most kinds of dunes are longer on the stoss (upflow) side, where the sand is pushed up the dune, and have a shorter \"slip face\" in the lee side. The valley or trough between dunes is called a slack.  \nAn erg or sand sea is a large broad, flat area covered with wind-swept sand and/or dunes with little or no vegetation. Smaller areas are called dune fields.Dunes occur in some deserts, inland and along some coasts. Some coastal areas have one or more sets of dunes running parallel to the shoreline directly inland from the beach. In most cases, the dunes are important in protecting the land against potential ravages by storm waves from the sea. Although the most widely distributed dunes are those associated with coastal regions, the largest complexes of dunes are found inland in dry regions and associated with ancient lake or sea beds. Dunes can form under the action of water flow (fluvial processes), and on sand or gravel beds of rivers, estuaries and the sea-bed.\n\nThe modern word \"dune\" came into English from French around 1790, which in turn came from Middle Dutch dūne.", "developer": ["Cryo Interactive"], "genre": "Adventure", "date_release": "1992-11-01"}, "Dungeon Defenders": {"description": "Dungeon Defenders is a multiplayer video game developed by Trendy Entertainment that combines the genres of tower defense and action role-playing game. It is based on a showcase of Unreal Engine 3 named Dungeon Defense. The game takes place in a fantasy setting where players control the young apprentices of wizards and warriors and defend against hordes of monsters. Dungeon Defenders was announced on August 25, 2010, and has been released on Xbox Live Arcade, PlayStation Network and PC. Support for the Move accessory is planned for inclusion in the PlayStation Network version. Epic Games' Mark Rein has stated that there will be cross platform play between the PlayStation 3 and the PlayStation Vita. The game was released on October 19, 2011 through Steam. In November there was a \"development kit\" released as free DLC which included the game's source code.Dungeon Defenders sold over 250,000 copies in first two weeks of release and over 600,000 copies by the end of 2011. By February 2012, the game's publisher reported over one million sales across Xbox Live, PlayStation Network, and Steam.", "developer": ["Trendy Entertainment"], "genre": "Tower defense", "date_release": "2011-10-19"}, "Dungeon Keeper": {"producer": "Rachel Holman", "composer": "Russell Shaw", "description": "Dungeon Keeper is a strategy video game developed by Bullfrog Productions and released by Electronic Arts in June 1997 for MS-DOS and Windows 95. In Dungeon Keeper, the player builds and manages a dungeon, protecting it from invading 'hero' characters intent on stealing accumulated treasures, killing monsters and ultimately the player's demise. The ultimate goal is to conquer the world by destroying the heroic forces and rival dungeon keepers in each realm. A character known as the Avatar (resembling the Avatar from Ultima VIII: Pagan) appears as the final hero. Dungeon Keeper uses Creative Technology's SoundFont technology to enhance its atmosphere. Multiplayer with up to four players is supported using a modem, or over a local network.\nDungeon Keeper took over two years to develop, and an expansion pack, a Direct3D version, and a level editor were released. Midway through development, Molyneux decided to leave Bullfrog when the game was complete, which was the motivation for its success. Versions for the Sega Saturn and Sony PlayStation were in development, but cancelled. The game received critical acclaim, with reviewers praising the uniqueness and depth. Dungeon Keeper was re-released on GOG.com in 2011, and on Origin in 2016. A fan-made mod, KeeperFX, was released, which fixes bugs and adds features. Dungeon Keeper was followed by a sequel, Dungeon Keeper 2, in 1999, and influenced games such as Lego Rock Raiders and Ghost Master.", "developer": ["Bullfrog Productions"], "genre": "RTS", "date_release": "1997-06-26"}, "Dungeon Keeper 2": {"producer": "Nick Goldsworthy", "composer": "Mark Knight", "description": "Dungeon Keeper 2 is a strategy game developed by Bullfrog Productions and published by Electronic Arts in 1999 for Microsoft Windows. The sequel to Dungeon Keeper, the player takes the role of a 'dungeon keeper', building and defending an underground dungeon from the would-be heroes that invade it, as well as from other keepers. In the campaign mode, the player is charged with recovering the portal gems from each area in order to open a portal to the surface. The player can also construct a dungeon without strict objectives, and multiplayer is supported over a network.\nThe game carries over many ideas from the original and adds new elements including units, rooms, and objectives. Development was carried out by a team of around fifty people, who focused on the graphics on multiplayer. A PlayStation version, and a sequel, Dungeon Keeper 3, were in development but cancelled. Dungeon Keeper 2 received positive reviews: reviewers lauded the graphics  and artificial intelligence, although some reviewers criticized its similarity to the original. The game was later released on gog.com and Origin.", "developer": ["Bullfrog Productions"], "genre": "RTS", "date_release": "1999-06-30"}, "Dungeons & Dragons Online": {"description": "Dungeons & Dragons Online (DDO) is a massively multiplayer online role-playing game (MMORPG) developed by Turbine for Microsoft Windows and OS X. The game was originally marketed as Dungeons & Dragons Online: Stormreach, then renamed Dungeons & Dragons Online: Eberron Unlimited upon switching to a hybrid free to play model, and was finally rebranded Dungeons & Dragons Online, with the introduction of Forgotten Realms-related content. Turbine developed DDO as an online adaptation of Dungeons & Dragons (D&D), based loosely on the D&D 3.5 rule set. The game is set on the unexplored continent of Xen'drik within the Eberron campaign setting, and in the Kingdom of Cormyr within the Forgotten Realms campaign setting.", "developer": ["Turbine, Inc."], "genre": "MMORPG", "date_release": "2006-02-28"}, "Dungeons of Dredmor": {"composer": "Matthew Steele", "description": "Dungeons of Dredmor is a roguelike indie game released on July 13, 2011 by Gaslamp Games. The game features tile-based graphics. A DLC release for the game entitled \"Realm of the Diggle Gods\" was also released later that year. A second DLC called \"You Have To Name The Expansion Pack\" was released on June 5, 2012. A third DLC called \"Conquest of the Wizardlands\" was released on August 1, 2012. The game has extensive support for user created modifications.", "developer": ["Gaslamp Games"], "genre": "Roguelike", "date_release": "2011-07-13"}, "Dwarf Fortress": {"description": "Dwarf Fortress (officially called Slaves to Armok: God of Blood Chapter II: Dwarf Fortress) is a part construction and management simulation, part roguelike, indie video game created by Tarn and Zach Adams. Freeware and in development since 2002, its first alpha version was released in 2006 and it received attention for being a two-member project surviving solely on donations. The primary game mode is set in a procedurally generated fantasy world in which the player indirectly controls a group of dwarves, and attempts to construct a successful and wealthy underground fortress. Critics praised its complex, emergent gameplay but had mixed reactions to its difficulty. The game influenced Minecraft and was selected among other games to be featured in the Museum of Modern Art to show the history of video gaming in 2012.\nThe game has text-based graphics and is open-ended with no main objectives. Before playing, the player has to set in motion a process which generates worlds with continents, oceans and histories documenting civilizations. The main game mode, Dwarf Fortress, consists of selecting a suitable site from the generated-world, establishing a successful colony or fortress, combating threats like goblin invasions, generating wealth and taking care of the dwarves. Each dwarf is modeled down to its individual personality, has likes or dislikes and possesses specific trainable skills in various labors. The second main game mode, Adventurer, is a turn-based, open-ended roguelike mode where the player starts off as an adventurer in the world and is free to explore, complete quests, or even visit old abandoned fortresses. The combat system is anatomically detailed with combat logs describing events like organs getting pierced, fat getting bruised and limbs getting severed.\nPrior to Dwarf Fortress, Tarn Adams was working on a project called Slaves to Armok: God of Blood which was a role-playing game. By 2004, Adams decided to shift from the original Armok to Dwarf Fortress after the former became difficult to maintain. Adams calls it his life's work and said in 2011 that version 1.0 will not be ready for at least another 20 years, and even after that he would continue to work on it. The game has a cult following and an active online community. As there is no way to win, every fortress, no matter how successful, is usually destroyed somehow. This prompts the official community motto: \"Losing is Fun!\"", "developer": ["Bay 12 Games"], "genre": "Action real-time strategy", "date_release": "2006-08-08"}}