{"Rage": {"composer": "Rod Abernethy", "description": null, "developer": ["id Software"], "genre": "First-person shooter, action-adventure, vehicular combat, racing\n", "date_release": "2011-10-04"}, "Railroad Tycoon": {"composer": "Jeff Briggs", "description": "Sid Meier's Railroad Tycoon is a business simulation designed by Sid Meier. The DOS version of the game was released as freeware for download in 2006. The game is the first in the Railroad Tycoon series.\nA port of the game for the Super NES was planned for a 1994 release, and screenshots were shown in the March 1993 issue of Nintendo Power; however the port was never released. Though no reason was officially given, it may have been due to the DOS release of Transport Tycoon, and its planned release on the then-upcoming PlayStation console.", "developer": ["MicroProse"], "genre": "Business simulation", "date_release": "1990-01-01"}, "Railroad Tycoon 3": {"producer": "Chris Lacey", "composer": "Jim Callahan", "description": "Railroad Tycoon 3 is a video game, part of the Railroad Tycoon series, that was released in 2003.", "developer": ["PopTop Software"], "genre": "Business simulation", "date_release": "2003-10-27"}, "Rayman": {"producer": "Gérard Guillemot", "composer": null, "description": "Rayman is a franchise of platform video games, published by Ubisoft. Since the release of the original Rayman, conceived by Michel Ancel in 1995, the series has produced a total of 45 games across multiple platforms. \nThe series is set in a fantastical, magical world which features a wide range of environments that are often based on certain themes, such as \"the Eraser Plains\", a landscape made entirely of stationery. The core games of the series are platformers, but there are several spin-off titles in other genres. The protagonist is the eponymous  Rayman, a magical being renowned for his courage and determination who, with the help of his friends, must save his world from various villains.", "developer": ["Ubisoft"], "genre": "Platformer", "date_release": "1996-04-30"}, "Rayman 2: The Great Escape": {"producer": [null, null], "composer": "Eric Chevalier", "description": "Rayman 2: The Great Escape is a platform video game developed by Ubi Pictures and published by Ubi Soft for the Nintendo 64, Microsoft Windows and Sega Dreamcast. An enhanced port titled Rayman Revolution (Rayman 2: Revolution in North America) was developed by Ubi Soft Annecy for the PlayStation 2.\nSeparate versions of the game were developed by Ubi Soft Shangai for the PlayStation and by Ubi Soft Milan for the Game Boy Color (as Rayman 2: Forever). \nThe game was critically acclaimed upon release. It is considered to have raised standards regarding 3D, level design and gameplay. The game has been mentioned in some \"Best Games Of All Time\" lists in the past.", "developer": ["Ubisoft"], "genre": "Platformer", "date_release": "1999-10-31"}, "Rayman 3: Hoodlum Havoc": {"producer": "Ahmed Boukhelifa", "composer": null, "description": "Rayman 3: Hoodlum Havoc is the third major platform game installment in the Rayman series. It tells the story of how Rayman stops André, an evil black lum, from taking over the world with his army of sack-like \"Hoodlum\" soldiers. Unlike the game's predecessor, Rayman 3 took a more light-hearted turn, it has sarcastic self-referential undertones and pokes fun at the platforming video game genre. It was released for the GameCube, PlayStation 2, Xbox and Microsoft Windows by Ubi Soft in 2003 and OS X by Feral Interactive in 2004. A remastered HD version of the game was released for PlayStation Network and Xbox Live Arcade in 2012. 2D versions were developed for the Game Boy Advance, N-Gage and mobile phones. A follow up game, Rayman: Hoodlums' Revenge, was released for the Game Boy Advance in 2005. This would be the last main series Rayman game to be released until Rayman Origins in 2011. The game is also the latest in the series to be in 3D.", "developer": ["Ubisoft"], "genre": "Platformer", "date_release": "2003-03-24"}, "Rayman Legends": {"producer": null, "composer": null, "description": "Rayman Legends is a platform video game developed by Ubisoft Montpellier and published by Ubisoft. It is the fifth main title in the Rayman series and the direct sequel to the 2011 game Rayman Origins. The game was released for Microsoft Windows, Xbox 360, PlayStation 3, Wii U, and PlayStation Vita platforms in August and September 2013. PlayStation 4 and Xbox One versions were released in February 2014. A Nintendo Switch port, titled Rayman Legends Definitive Edition was released in North America, Europe and Australia on September 12, 2017.Rayman Legends was announced at Electronic Entertainment Expo (E3) 2012 for Wii U and was planned for release during the console's launch window. However, the game was delayed and released several months later on multiple platforms, due to the financial failure of ZombiU.\nRayman Legends received critical acclaim upon release. Critics praised the game's visuals, level design, controls, soundtrack, overall gameplay, and the large amount of content. Some critics went as far as calling Rayman Legends one of the best platforming video games made, and the game won several awards from video gaming publications. The game experienced sluggish sales at the beginning of its release, but sold well and contributed to the company's earnings just a year after.", "developer": ["Ubisoft"], "genre": "Platformer", "date_release": "2013-09-03"}, "Rayman M": {"composer": "Claude Samard", "description": "Rayman M (Known as Rayman Arena outside Europe) is a multiplayer party game developed and published by Ubisoft. The game encompasses two versions: the original version for the PlayStation 2 and Microsoft Windows, and the North American-exclusive GameCube and Xbox versions, with both releases featuring exclusive content. A spin-off in the Rayman series, the game retains a number of elements that previously appeared in Rayman 2: The Great Escape, such as similar controls, gameplay and level design. The game is split two game modes, both supporting up to four players: on-foot racing and arena-based battles.\nThe PlayStation 2 and Microsoft Windows versions require the player to complete all five leagues (Beginner, Advanced, Expert, Extreme and Bonus) to beat the game; the GameCube and Xbox versions require the player to complete the four main game modes (Obstacle Racing, Time Attack, Total Fight and Freeze Combat) on all three difficulties (Beginner, Pro and Master) to beat the game. \nA remake, titled Rayman Rush, was released for the Sony PlayStation in 2002, which only features the racing portions of the game.", "developer": ["Ubisoft"], "genre": "Party", "date_release": "2002-08-31"}, "Rayman Origins": {"producer": "Pierre-Arnaud Lambert", "composer": null, "description": "Rayman Origins is a platform video game developed by Ubisoft Montpellier and published by Ubisoft for PlayStation 3, Wii, Xbox 360, PlayStation Vita, Nintendo 3DS and Microsoft Windows. It is the fourth main installment in the Rayman series, and the first main installment since 2003's Rayman 3: Hoodlum Havoc. The game was released on 15 November 2011 in North America, 24 November 2011 in Australia, and 25 November 2011 in Europe for PlayStation 3, Wii and Xbox 360. It was released later for PlayStation Vita, Microsoft Windows, and Nintendo 3DS. The OS X version of the game was released on 12 December 2013 by Feral Interactive. The story follows Rayman, his friend Globox and two teensies as they fight Darktoons and other evil creatures that have infected the Glade of Dreams.\nRayman Origins has received critical acclaim, being highly praised for its graphical style, level design, and sense of humor. Despite its critical reception, it did not perform very well commercially during its original release in November 2011. A mobile game based on Origins, titled Rayman Jungle Run, was developed by Pastagames and released for iOS, Android, and for Windows Phone 8 on 29 May 2013. A sequel, Rayman Legends, was released for Microsoft Windows, PlayStation 3, PlayStation Vita, Wii U and Xbox 360 on 29 August 2013 in Australia, 30 August 2013 in Europe, and 3 September 2013 in North America to similar critical acclaim.", "developer": ["Ubisoft"], "genre": "Platformer", "date_release": "2012-03-29"}, "Recettear: An Item Shop's Tale": {"description": "Recettear: An Item Shop’s Tale (RECETTEAR〜アイテム屋さんのはじめ方〜, Rusettia – Aitemu-ya-san no Hajimekata, Recettear: How to Start an Item Shop) is a role-playing game developed by Japanese dōjin maker EasyGameStation for the Windows operating system. The game follows a young girl named Recette, who is charged by the fairy Tear to run an item shop out of her house to pay off the considerable debt her father had accumulated before his mysterious disappearance; the eponymous shop is a portmanteau of the lead characters' names. In the game, the player controls Recette in several areas of gameplay, including bargaining and haggling with clients for goods, and accompanying an adventurer into randomly generated dungeons to acquire goods to sell, with the goal of paying back the debt within a fixed deadline.\nThe game, first released in 2007 at the 73rd Comiket in Japan, has been localized into English by indie localization company Carpe Fulgur and was released on September 10, 2010 in North America and Europe. The English version of the game is available only through digital distribution platforms. Recettear is the first independently made Japanese game to be distributed through Steam. Though Carpe Fulgur only expected about 10,000 sales of the title in Western markets, the game was warmly received by critics and its reputation spread through word-of-mouth, leading to over 300,000 units sold by September 2013, and allowing Carpe Fulgur to look towards other dōjin titles to localize. The game has sold over 500,000 units on Steam, as of July 2017.", "developer": ["EasyGameStation"], "genre": "RPG", "date_release": "2010-09-10"}, "Rec Room": {"description": "Rec Room is a virtual reality online video game and game creation system developed and published by Rec Room Inc. (formerly known as Against Gravity). It was released for Microsoft Windows in June 2016, PlayStation 4 in November 2017, and Android in May 2019 as a launch title of the Oculus Quest. It was also released for iOS on Aug 31, 2019.\n\n", "genre": "Action RPG", "date_release": "2016-06-28"}, "Red Orchestra: Ostfront 41-45": {"description": "Red Orchestra: Ostfront 41-45 is a tactical first-person shooter video game based on its predecessor Red Orchestra: Combined Arms. After winning the Make Something Unreal contest, the team behind the original Red Orchestra started the game studio Tripwire Interactive and developed Red Orchestra: Ostfront 41-45 as their first project.\nSet on the Eastern Front during World War II between 1941 and 1945, Red Orchestra: Ostfront 41-45 depicts the struggle between Soviet and German forces. The game's creators, Tripwire Interactive, developed the game out of the previous Unreal Tournament 2004 mod, Red Orchestra: Combined Arms.As of April 2009, the game has sold around 400,000 copies.", "developer": ["Tripwire Interactive"], "genre": "Tactical shooter", "date_release": "2006-03-14"}, "Red dead redemption\n": {"description": "Red Dead Redemption is a Western action-adventure game developed by Rockstar San Diego and published by Rockstar Games. A spiritual successor to 2004's Red Dead Revolver, it is the second game in the Red Dead series, and was released for the PlayStation 3 and Xbox 360 in May 2010. Red Dead Redemption is set during the decline of the American frontier in the year 1911 and follows John Marston, a former outlaw whose wife and son are taken hostage by the government in ransom for his services as a hired gun. Having no other choice, Marston sets out to bring three members of his former gang to justice.\nThe game is played from a third-person perspective in an open world, allowing the player to interact with the game world at their leisure. The player can travel the virtual world, a fictionalized version of the Western United States and Mexico, primarily by horseback and on foot. Gunfights emphasize a gunslinger gameplay mechanic called \"Dead Eye\" that allows players to mark multiple shooting targets on enemies in slow motion. The game makes use of a morality system, by which the player's actions in the game affect their character's levels of honor and fame and how other characters respond to the player. An online multiplayer mode is included with the game, allowing up to 16 players to engage in both cooperative and competitive gameplay in a recreation of the single-player setting.\nRed Dead Redemption was developed over the course of five years and is one of the most expensive video games ever made. The game received critical acclaim for its visuals, dynamically-generated music, voice acting, gameplay, and story, and shipped over 15 million copies by 2017. It won several year-end accolades, including Game of the Year awards from several gaming publications, and is considered by critics as one of the greatest video games ever made. After the game's release, several downloadable content additions were released; Red Dead Redemption: Undead Nightmare, later released as a standalone game, added a new single-player experience in which Marston searches for a cure for an infectious zombie plague that has swept across the Old West. A Game of the Year Edition containing all additional content was released in October 2011. A prequel, Red Dead Redemption 2, was released in October 2018 to similar acclaim."}, "Red Orchestra 2: Heroes of Stalingrad": {"composer": "Sam Hulick", "description": "Red Orchestra 2: Heroes of Stalingrad is a World War II-themed tactical first-person shooter video game developed and published by Tripwire Interactive. It is a sequel to Red Orchestra: Ostfront 41-45. The title focuses heavily on the Battle of Stalingrad. The game was released in September 2011. The developers have stated that the game is a Windows exclusive and have no plans to bring it to consoles. The game contains many new features, including a new first-person cover system combined with blind firing, first person collision detection, as well as an entirely new system of statistics tracking and player development.", "developer": ["Tripwire Interactive"], "genre": "Tactical shooter", "date_release": "2011-09-13"}, "Reign of Kings": {"description": "The Kings of Judah were the monarchs who ruled over the ancient Kingdom of Judah. According to the biblical account, this kingdom was founded after the death of Saul, when the tribe of Judah elevated David to rule over it. After seven years, David became king of a reunited Kingdom of Israel. However, in about 930 BCE the united kingdom split, with ten of the twelve Tribes of Israel rejecting Solomon's son Rehoboam as their king. The tribes of Judah and Benjamin remained loyal to Rehoboam, and re-formed the Kingdom of Judah, while the other entity continued to be called the Kingdom of Israel, or just Israel.\nThe capital of the Kingdom of Judah was Jerusalem. All of the kings of Judah lived and died in Judah except for Ahaziah (who died at Megiddo in Israel), Jehoahaz (who died a prisoner in Egypt) and Jeconiah and Zedekiah who were deported as part of the Babylonian captivity.\nJudah was conquered in 587 or 586 BC, by the Neo-Babylonian Empire under Nebuzaradan, captain of Nebuchadnezzar's body-guard. With the deportation of the elite and the destruction of Jerusalem and the Temple, the demise of the Kingdom of Judah was complete.\nThe Davidic dynasty began when the tribe of Judah made David its king, following the death of Saul. The Davidic line continued when David became king of the reunited Kingdom of Israel. When the united kingdom split, the tribes of Judah and Benjamin remained loyal to the Davidic line. Following the exile of Judah, the Davidic line was respected by the exiles in Babylon, who regarded the exilarchs as kings-in-exile.\nAccording to the Hebrew Bible, additional details about the Kings of Judah were written by Iddo the Seer and in the Chronicles of the Kings of Judah.\n\n", "genre": "Sandbox", "date_release": "2015-03-11"}, "Resident Evil": {"producer": [null, null], "composer": null, "description": "Resident Evil, known in Japan as Biohazard, is a Japanese horror media franchise created by Shinji Mikami and Tokuro Fujiwara, and owned by the video game company Capcom. The franchise focuses on a series of survival horror games and includes live-action films, animated films, comic books, novels, audio dramas, and merchandise. The story follows outbreaks of zombies and other monsters created mainly by the Umbrella Corporation.\nThe first Resident Evil video game was released in 1996, taking place in a mansion overrun with zombies. The franchise has grown to encompass numerous sequels of various genres, incorporating elements of action, exploration, and puzzle solving, and storylines inspired by horror and action films. Resident Evil has been credited with popularizing survival horror games, as well as re-popularizing zombies in mainstream popular culture from the late 1990s onwards (along with The House of the Dead), leading to a renewed interest in zombie films during the 2000s. Resident Evil is Capcom's best-selling video game franchise, with 92 million units sold worldwide as of June 30, 2019. The Resident Evil films are also the highest-grossing film series based on video games.", "developer": ["Capcom"], "genre": "Survival horror", "date_release": "1996-03-22"}, "Resident Evil 2": {"producer": "Shinji Mikami", "composer": null, "description": "Resident Evil 2 is a survival horror game developed and published by Capcom and released for the PlayStation in 1998. The player controls Leon S. Kennedy and Claire Redfield, who must escape Raccoon City after its citizens are transformed into zombies by a biological weapon two months after the events of the original Resident Evil. The gameplay focuses on exploration, puzzles, and combat; the main difference from its predecessor are the branching paths, with each player character having unique storylines and obstacles.\nResident Evil 2 was directed by Hideki Kamiya, produced by Shinji Mikami—director of the first Resident Evil—and developed by a team of around 50 over 21 months. The initial version of the game, commonly referred to as Resident Evil 1.5, differed drastically and was canceled when it was around two-thirds complete after Mikami decided it was inadequate. The final design introduced a more cinematic presentation.\nResident Evil 2 received critical acclaim, with praise for its atmosphere, setting, graphics, audio, scenarios, and overall gameplay, as well as its improvements over the original game, but with some criticism towards its controls, voice acting and certain gameplay elements. It has appeared on a number of lists of the best video games ever made. It is the best-selling Resident Evil game for a single platform, selling 4.96 million copies on PlayStation. It was ported to Windows, Nintendo 64, Dreamcast and GameCube, and a modified 2.5D version was released for the Game.com handheld. The story of Resident Evil 2 was retold and built upon in several later games, and has been adapted into a variety of licensed works. It was followed by Resident Evil 3: Nemesis in 1999. A remake of the game was released for PlayStation 4, Windows, and Xbox One in 2019.", "developer": ["Capcom"], "genre": "Survival horror", "date_release": "1998-01-21"}, "Resident Evil 3: Nemesis": {"producer": "Shinji Mikami", "composer": null, "description": "Resident Evil 3: Nemesis is a survival horror game developed by Capcom and released for the PlayStation in 1999. It is the third installment in the Resident Evil series and takes place around the events of Resident Evil 2. The story follows Jill Valentine and her efforts to escape from a city infected with a biological weapon. Choices through the game affect the story and ending. The game uses the same engine as its predecessors and features 3D models over pre-rendered backgrounds with fixed camera angles.\nOriginally planned as a spin-off featuring a different protagonist, Resident Evil 3 was designed to have more action-oriented gameplay than previous Resident Evil games. It features a larger number of enemies and introduces the Nemesis creature, which periodically pursues the player. Accompanied by a major marketing campaign, Resident Evil 3 received positive reviews and sold more than three million copies worldwide. Critics praised the game's detailed graphics and the Nemesis as an intimidating villain, but some criticized its short length and story. Resident Evil 3 was ported to Dreamcast, Windows and GameCube to varying success.", "developer": ["Capcom"], "genre": "Survival horror", "date_release": "1999-09-22"}, "Resident Evil 4": {"producer": "Hiroyuki Kobayashi", "composer": "Misao Senbongi", "description": "Resident Evil 4 is a third-person shooter survival horror video game developed by Capcom Production Studio 4 and published by Capcom. The sixth major installment in the Resident Evil series, it was originally released for the GameCube in 2005. Players control U.S. government special agent Leon S. Kennedy, who is sent on a mission to rescue the U.S. president's daughter Ashley Graham, who has been kidnapped by a cult. In a rural part of Europe, Leon fights hordes of villagers infected by a mind-controlling parasite, and reunites with the spy Ada Wong.\nDevelopment began for PlayStation 2 as early as 1999. Resident Evil 4 underwent a long development during which four proposed versions were discarded; the first attempt was directed by Hideki Kamiya after producer Shinji Mikami. The game was announced as a GameCube exclusive as part of the Capcom Five, but a PlayStation 2 version was announced before it was released. Resident Evil 4 was ported to Windows, Wii, PlayStation 3, Xbox 360, PlayStation 4, Xbox One, and Nintendo Switch and in downsized versions for iOS, Zeebo, and Android.\nResident Evil 4 garnered critical acclaim, with praise for its narrative, gameplay, voice acting, and characters. It received multiple Game of the Year awards for 2005 and was seen as a successful cross-platform hit that influenced the evolution of the survival horror and third-person shooter genres. It pioneered the \"over the shoulder\" third-person view perspective in video games. It is widely considered to be one of the best video games of all time. A sequel, Resident Evil 5, was released in 2009.", "developer": ["Capcom Production Studio 4"], "genre": "Survival horror", "date_release": "2005-01-11"}, "Resident Evil 5": {"producer": [null, null], "composer": "Kota Suzuki", "description": "Resident Evil 5 is a third-person shooter video game developed and published by Capcom and released in 2009.  It is the seventh major installment in the Resident Evil series, and was announced in 2005—the same year its predecessor Resident Evil 4 was released. Resident Evil 5 was released for the PlayStation 3 and Xbox 360 consoles in March 2009 and for Microsoft Windows in September that year. The plot involves an investigation of a terrorist threat by Bioterrorism Security Assessment Alliance (BSAA) agents Chris Redfield and Sheva Alomar in Kijuju, a fictional region of Africa. Chris soon learns that he must confront his past in the form of an old enemy, Albert Wesker, and his former partner, Jill Valentine.\nThe gameplay of Resident Evil 5 is similar to that of the previous installment, though it is the first in the series designed for two-player cooperative gameplay. It has also been considered to be the first game in the main series to depart from the survival horror genre, with critics saying it bore more resemblance to an action game. Motion capture was used for the cutscenes, and it was the first video game to use a virtual camera system. Several staff members from the original Resident Evil worked on Resident Evil 5.\nResident Evil 5 received a positive reception, despite some criticism for its control scheme. The game received some complaints of racism, though an investigation by the British Board of Film Classification found the complaints were unsubstantiated. Resident Evil 5 was re-released for PlayStation 4 and Xbox One in June 2016. As of December 2018, the original release has sold over 7.4 million units. An additional 3.6 million units have been sold between a special edition of the game and releases on other platforms, bringing the total sales to 11 million. It is the best-selling game of the Resident Evil franchise, and the original version remained the best-selling individual Capcom release until March 2018, when it was outsold by Monster Hunter: World. A sequel, Resident Evil 6, was released in 2012.", "developer": ["Capcom"], "genre": "Action-adventure", "date_release": "2009-03-05"}, "Resident Evil 6": {"producer": "Yoshiaki Hirabayashi", "composer": "Akihiko Narita", "description": "Resident Evil 6 is a third-person shooter game, survival horror game developed and published by Capcom. It was released for the PlayStation 3 and Xbox 360 in October 2012 and for Windows in March 2013. Players control several characters including Leon S. Kennedy, Chris Redfield, Jake Muller and Ada Wong as they confront the force behind a worldwide bio-terrorist attack; each character has unique abilities and styles.\nResident Evil 6 was conceptualized in 2009 and entered full development the following year under Resident Evil 4 producer Hiroyuki Kobayashi. It had a development staff of more than 600, making it Capcom's largest production.\nResident Evil 6 received mixed reviews; some reviewers praised the game's storyline and themes, but the interwoven campaigns and departure from survival horror received criticism. With over 8.8 million copies sold, it is the third-bestselling Capcom game, outsold by Resident Evil 5 and Monster Hunter: World. It was rereleased for the PlayStation 4 and Xbox One with all downloadable content in 2016.", "developer": ["Capcom"], "genre": "Action-adventure", "date_release": "2012-10-02"}, "Resident Evil: Operation Raccoon City": {"producer": "Peter Doidge-Harrison", "composer": "Shusaku Uchiyama", "description": "Resident Evil: Operation Raccoon City is a third-person shooter survival horror video game for Microsoft Windows, PlayStation 3 and Xbox 360, co-developed by Slant Six Games and Capcom. It was released on March 20, 2012 in North America, March 22, 2012 in Australia, March 23, 2012 in Europe and April 26, 2012 in Japan.It is an installment in the Resident Evil series, being set around the same time as Resident Evil 2 and Resident Evil 3: Nemesis, and featuring the characters from these two games, though it is a non-canon hypothetical scenario. The game follows a group of elite paramilitary mercenaries for the Umbrella Corporation during the zombie outbreak in Raccoon City. The game met with a mixed critical reception, and was a commercial success, selling more than 3.2 million units.\n\n", "developer": ["Slant Six Games", "Capcom"], "genre": "Action-adventure", "date_release": "2012-03-20"}, "Resident Evil: Revelations": {"producer": [null, null, null], "composer": null, "description": "Resident Evil: Revelations 2 is an episodic survival horror video game developed and published by Capcom as part of the Resident Evil series. The game is a follow up to Resident Evil: Revelations and Resident Evil 5. This marks the return of Claire Redfield as the protagonist, and the first time Barry Burton is a playable story character in the main series. The first installment was released in February 2015.\nThe plot is set between the events of Resident Evil 5 and Resident Evil 6, in 2011. The story begins when Claire and her co-workers, including the newcomer and playable protagonist, Moira Burton, are at a party in the headquarters of the NGO Terra Save, when they are attacked by unknown assailants and taken away to a deserted island.\nThe game was released for Windows, PlayStation 3, PlayStation 4, Xbox 360, Xbox One, PlayStation Vita and Nintendo Switch in 2017 along with the port of the first Revelations. The reviews were mixed; the setting, story, characters and the co-op gameplay were praised, but the graphics and some technical issues were criticized. As of the end of March 2019, the title reached a combined 2.4 million units sold, surpassing its predecessor and becoming Capcom's 25th-bestselling game.", "genre": "Action", "date_release": "2012-01-26"}, "Resident Evil: Revelations 2": {"producer": "Michiteru Okabe", "composer": null, "description": "Resident Evil: Revelations 2 is an episodic survival horror video game developed and published by Capcom as part of the Resident Evil series. The game is a follow up to Resident Evil: Revelations and Resident Evil 5. This marks the return of Claire Redfield as the protagonist, and the first time Barry Burton is a playable story character in the main series. The first installment was released in February 2015.\nThe plot is set between the events of Resident Evil 5 and Resident Evil 6, in 2011. The story begins when Claire and her co-workers, including the newcomer and playable protagonist, Moira Burton, are at a party in the headquarters of the NGO Terra Save, when they are attacked by unknown assailants and taken away to a deserted island.\nThe game was released for Windows, PlayStation 3, PlayStation 4, Xbox 360, Xbox One, PlayStation Vita and Nintendo Switch in 2017 along with the port of the first Revelations. The reviews were mixed; the setting, story, characters and the co-op gameplay were praised, but the graphics and some technical issues were criticized. As of the end of March 2019, the title reached a combined 2.4 million units sold, surpassing its predecessor and becoming Capcom's 25th-bestselling game.", "developer": ["Capcom"], "genre": "Action", "date_release": "2014-10-10"}}