{"Sacred": {"description": "Something that is sacred is dedicated or set apart for the service or worship of a deity or considered worthy of spiritual respect or devotion; or inspiring awe or reverence among believers. The property is often ascribed to objects (a \"sacred artifact\" that is venerated and blessed), or places (\"sacred ground\").\nFrench sociologist Émile Durkheim considered the dichotomy between the sacred and the profane to be the central characteristic of religion: \"religion is a unified system of beliefs and practices relative to sacred things, that is to say, things set apart and forbidden.\" In Durkheim's theory, the sacred represented the interests of the group, especially unity, which were embodied in sacred group symbols, or totems. The profane, on the other hand, involved mundane individual concerns.\nAlthough there are similarities between the terms \"sacred\" and \"holy\" and they are sometimes used interchangeably, there are subtle differences. \"Holiness\" is generally the term used in relation to persons and relationship, while \"sacredness\" is used in relation to objects, places, or happenings. Thus a saint may be considered as holy, but would not be viewed as sacred.", "developer": ["Ascaron"], "genre": "Action RPG"}, "Saints Row 2": {"producer": null, "description": "Saints Row 2 is a 2008 open world action-adventure video game developed by Volition and published by THQ. It was released in October 2008 for the PlayStation 3 and Xbox 360, and ported to Microsoft Windows in early 2009, and to Linux in 2016. A mobile tie-in version was developed by G5 Entertainment and released the same month. The game is the second title and first cross-platform release in the Saints Row series, following 2006's Saints Row. It is succeeded by 2011's Saints Row: The Third and 2013's Saints Row IV.\nSet in the fictional city of Stilwater five years after the events of Saints Row, players control the same protagonist and lead a new order of Third Street Saints gang against the three rival gangs occupying their turf and the corrupt Ultor Corporation conglomerate. Players navigate the open world and unlock missions by spending Respect, a currency earned by completing numerous off-mission activities. Two players can cooperatively progress through the game's story mode and participate in all activities. The player may also compete in 12-player deathmatches.\nThe developers opted for a more comedic tone to set the game apart from Grand Theft Auto, a series featuring common gameplay elements. The game's promotional effort included various public showings, special editions and downloadable content including the Ultor Exposed and Corporate Warfare mission packages. Reviews were largely favorable, praising the action and straightforward gameplay, while criticizing technical issues. Reviewers were less receptive to the Windows port, citing worse technical issues. The game had sold around 400,000 units by November 2008, and 3.4 million units by September 2010.", "developer": ["Volition", "CD Projekt"], "genre": "Action-adventure", "date_release": "2009-01-05"}, "Saints Row: The Third": {"producer": "Greg Donovan", "composer": "Malcolm Kirby Jr.", "description": "Saints Row: The Third is an open world action-adventure video game developed by Volition and published by THQ. It is the third title in the Saints Row series. As in the previous games, the player-character leads the Third Street Saints gang in a turf war against three rival gangs using a variety of weapons and vehicles in single-player and cooperative play. It was released on November 15, 2011 for Microsoft Windows, PlayStation 3, and Xbox 360. A Nintendo Switch port was announced by Deep Silver and was released on May 10, 2019.Game development began by late 2008. There was high staff turnover from the previous Saints Row team, with only one-fifth of the final 100-person staff having worked on a previous title in the series. They aimed to improve on the series by giving the game a coherent tone, and found it in films such as Hot Fuzz and the game's signature sex toy bat. Saints Row: The Third was built using a proprietary engine known as Core Technology Group and the Havok physics engine.\nThe game received positive reviews, reviewers noted its general zaniness and praised its customization options. Critics thought the setting was insipid and that its humor occasionally fell flat, and others thought the game perfected the Saints Row formula. It was a nominee for Best Narrative at the 2012 Game Developers Conference, an IGN Editor's Choice, and a recipient of perfect scores from GamesRadar and G4. A complete edition including the three downloadable content packs was released a year after the original release, and its planned Enter the Dominatrix expansion became the game's sequel, Saints Row IV.", "developer": ["Volition"], "genre": "Action-adventure", "date_release": "2011-11-15"}, "Saints Row IV": {"producer": "Jim Boone", "composer": "Malcolm Kirby Jr.", "description": "Saints Row IV is an open world action-adventure video game developed by Volition and published by Deep Silver. It is the fourth title in the Saints Row series. In the game, the playable character is the leader of the 3rd Street Saints, a street gang that has become the world's most powerful and popular organization, and must fend off an alien invasion after becoming President of the United States and receiving superpowers. The player is free to explore their environment while completing main and side missions at their leisure. The game incorporates elements from science fiction video games and films, and continues the series' reputation for over-the-top parody. It was released in August 2013 for Microsoft Windows, PlayStation 3, and Xbox 360, and was later ported to PlayStation 4, Xbox One, and Linux in 2015.\nThe game was Volition's first after its sale to Koch Media in early 2013. The supernatural and superpower concept for the game started in Enter the Dominatrix, a cancelled expansion planned for Saints Row: The Third, which the team expanded into Saints Row IV. Volition later released a \"director's cut\" of Enter the Dominatrix as downloadable content for Saints Row IV alongside How the Saints Saved Christmas, other weapons, costumes, and vehicle packs, and a standalone expansion, Saints Row: Gat out of Hell (which serves as the epilogue to the story). Saints Row IV received several limited and summative edition releases, and was briefly banned in Australia. Critics praised Saints Row IV's humor and character customization options, but criticized its lack of challenge. It sold over one million copies in its first week.", "developer": ["Volition"], "genre": "Action-adventure", "date_release": "2013-08-20"}, "Scrapland": {"composer": null, "description": "American McGee Presents: Scrapland is a game developed by MercurySteam, with American McGee as a producer and published by Enlight Software.", "developer": ["Mercury Steam Entertainment"], "genre": "Action-adventure", "date_release": "2004-11-04"}, "Scrolls": {"composer": null, "description": "A scroll (from the Old French escroe or escroue), also known as a roll, is a roll of papyrus, parchment, or paper containing writing.", "developer": ["Mojang"], "genre": "Tactical CCG", "date_release": "2013-06-03"}, "Secret of the Silver Blades": {"composer": "John Halbleib", "description": "Secret of the Silver Blades is the third in a four-part series of Forgotten Realms Dungeons & Dragons \"Gold Box\" adventure role-playing video games.  The game was released in 1990.The story is a continuation of the events of Curse of the Azure Bonds. In this game, a small mining town is being threatened by monsters who were released from a glacial prison. The monsters are led by the evil Eldamar, who had been interred in the glacier by his twin brother Oswulf and a group known as the Silver Blades.", "developer": ["Strategic Simulations, Inc."], "genre": "Fantasy", "date_release": "1990-10-20"}, "Sengoku": {"producer": "Johan Andersson", "composer": "Daniel Pharos", "description": "The Sengoku period (戦国時代, Sengoku Jidai, \"Age of Warring States\"; c. 1467 – c. 1600) is a period in Japanese history marked by social upheaval, political intrigue and near-constant military conflict. Japanese historians named it after the otherwise unrelated Warring States period of China. It was initiated by the Ōnin War, which collapsed the Japanese feudal system under the Ashikaga shogunate, and came to an end when the system was re-established under the Tokugawa shogunate by Tokugawa Ieyasu.", "developer": ["Paradox Development Studios"], "genre": "Grand strategy", "date_release": "2011-09-13"}, "Shadow of the Tomb Raider": {"producer": [null, null], "composer": "Brian D'Oliveira", "description": "Shadow of the Tomb Raider is an action-adventure video game developed by Eidos Montréal and published by Square Enix. It continues the narrative from the 2015 game Rise of the Tomb Raider and is the twelfth mainline entry in the Tomb Raider series. The game was released worldwide on 14 September 2018 for Microsoft Windows, PlayStation 4 and Xbox One, with a further release on macOS and Linux set for 2019.Set shortly after the events of Rise of the Tomb Raider, its story follows Lara Croft as she ventures through the tropical regions of the Americas to the legendary city Paititi, battling the paramilitary organization Trinity and racing to stop a Mayan apocalypse she has unleashed. Lara must traverse the environment and combat enemies with firearms and stealth as she explores semi-open hubs. In these hubs she can raid challenge tombs to unlock new rewards, complete side missions, and scavenge for resources which can be used to craft useful materials.\nDevelopment began in 2015 following the completion of Rise of the Tomb Raider, lasting until July 2018. Shadow of the Tomb Raider was designed to conclude Lara's journey begun in the 2013 reboot, with a key theme being descent both through the jungle environment and into her personality. The setting and narrative was based on Mayan and Aztec mythologies, consulting historians to design the architecture and people of Paititi. The gameplay was adjusted based on both fan feedback and the wishes of Eidos Montréal, incorporating swimming and grappling while increasing difficulty tailoring. Camilla Luddington returned to provide voice and motion-capture work for Lara.\nReleased as the final instalment in Lara Croft's origin trilogy, Shadow of the Tomb Raider received generally positive reviews from critics, with particular praise going to the game's emphasis on challenge tombs and puzzles, although some criticized that the series' gameplay had become stale and lacked innovation.", "developer": ["Eidos Montréal"], "genre": "action-adventure", "date_release": "2018-09-14"}, "Shogun: Total War": {"composer": "Jeff van Dyck", "description": "Total War: Shogun 2 is a strategy video game developed by The Creative Assembly and published by Sega in 2011. It is part of the Total War series and returns to the 16th-century Japan setting of the first Total War game, Shogun: Total War, after a series of games set mainly in Europe and the Middle East.\nShogun 2 is set in 16th-century feudal Japan, in the aftermath of the Ōnin War during the Ashikaga shogunate. The country is fractured into rival clans led by local warlords, each fighting for control. The player takes on the management of one of these clans, with the goal of dominating other factions and establishing rule over Japan. The standard edition of the game features a total of eight factions (plus a ninth faction for the tutorial), each with a unique starting position and different political and military strengths. The limited edition includes an exclusive ninja clan, the Hattori, and a DLC unlocks a tenth clan, the Ikko-Ikki.The game moves away from the European setting of previous Total War games and returns to the first setting in the Total War series, but making significant changes to core gameplay elements of Shogun 2. Compared to Empire which spanned almost the entire globe, the new installment focuses only on the islands of Japan (excluding Hokkaido) and on a reduced number of unit types.Shogun 2 received critical praise from reviewers, often for its simplification and refinement of the series by returning to its roots. A standalone expansion set, Total War: Shogun 2: Fall of the Samurai, was released in 2012.", "developer": ["The Creative Assembly"], "genre": "Turn-based strategy", "date_release": "2000-06-13"}, "ShootMania Storm": {"composer": "Mick Gordon", "description": "ShootMania Storm is a first-person shooter video game by Ubisoft and Nadeo.\nJust like its sister games TrackMania 2 and the yet-unreleased QuestMania, it features 3 different environments, of which two have so far been revealed; a snow-based environment called Cryo, and another called Storm. Storm was released first, with Cryo to be released later.Nadeo have stated they intend to make ShootMania stand out from other FPS games through design features such as using a rocket launcher-style weapon as the game's primary weapon. Florent Castelnérac (the game's project leader) has stated there will be relatively few different weapons, the idea being to minimize game time spent not in gameplay.\nThe game still uses the map editor introduced in TrackMania. Character editing is restricted, with only a shield on the player's back customizable.The game was set to be released on 23 January 2013, but was delayed to 10 April 2013 with an open beta started on 12 February.", "developer": ["Nadeo"], "genre": "First-person shooter", "date_release": "2013-04-10"}, "Sid Meier's Railroads!": {"description": "Sid Meier's Railroads!  is a business simulation game developed by Firaxis Games on the Gamebryo game engine that was released in October 2006 and is the sequel to Railroad Tycoon 3. Although Sid Meier created the original Railroad Tycoon, subsequent versions were developed by PopTop Software. Railroads! was the first game in the series since the original to have direct input from Sid Meier himself. After a visit to Miniatur Wunderland in Hamburg, Germany, Meier was inspired to reinvent his original creation. A version for the Mac OS X was published by Feral Interactive on November 1, 2012, under the latter's Feral Legends label.", "developer": ["Firaxis Games", "Feral Interactive"], "genre": "Business simulation", "date_release": "2006-10-17"}, "Silent Hunter": {"producer": "Carl C. Norman", "composer": "Doug Brandon", "description": null, "genre": "Submarine simulator", "date_release": "1996-01-01"}, "Silent Hunter II": {"composer": "Kevin Manthei", "description": null, "genre": "Submarine simulator", "date_release": "2001-11-06"}, "Silent Hunter III": {"producer": "Florin Boitor", "composer": "Patrick Giraudi", "description": null, "developer": ["Ubisoft Bucharest"], "genre": "Submarine simulator", "date_release": "2005-03-15"}, "Silent Hunter 4: Wolves of the Pacific": {"producer": "Emil Gheorghe", "composer": "Rod Abernethy", "description": null, "developer": ["Ubisoft Bucharest"], "genre": "Submarine simulator", "date_release": "2007-03-20"}, "Silent Hunter 5: Battle of the Atlantic": {"producer": "Alexandru Gris", "composer": "Jason Graves", "description": null, "developer": ["Ubisoft Bucharest"], "genre": "Submarine simulator", "date_release": "2010-03-02"}, "Silkroad Online": {"description": null, "developer": ["Joymax"], "genre": "MMORPG", "date_release": "2004-01-01"}, "SimCity": {"producer": null, "composer": "Chris Tilton", "description": "SimCity is an open-ended city-building video game series originally designed by Will Wright. The first game in the series, SimCity, was published by Maxis in 1989. The success of SimCity sparked the creation of several sequels and many other spin-off \"Sim\" titles, including 2000's The Sims, which itself became a best-selling computer game and franchise.In the SimCity games, the player develops a city from a patch of undeveloped land. The player controls where to place development zones, infrastructure like roads and power plants, landmarks, and public services such as schools, parks, hospitals and fire stations. The player also determines the tax rate, the budget, and social policy. The city is populated by \"Sims\", simulated persons, who live in the city created by the player. The three development zone types are the major areas in which Sims inhabit: residential zones for houses and apartment buildings; commercial zones for shops and offices; industrial zone for factories, warehouses, laboratories and farms.\nWhile there is no particular win condition in a game of SimCity, the balancing act of the above-mentioned factors provide the constraints which make gameplay possible. To maximize population or profitability, to re-create real-life locations in-game, achieve an aesthetic design or to trigger as many natural disasters as possible are among the many possible goals one can determine for oneself while playing a SimCity game.", "developer": ["Maxis"], "genre": "City-building", "date_release": "2013-03-05"}, "SimCity 2000": {"composer": null, "description": "SimCity 2000 is a city-building simulation video game jointly developed by Will Wright and Fred Haslam of Maxis. It is the successor to SimCity Classic and was released for Apple Macintosh personal computers in 1993, after which it was released on other platforms over the following years, such as the Sega Saturn and SNES game consoles in 1995 and the PlayStation in 1996.SimCity 2000 is played from an isometric perspective as opposed to the previous title, which was played from a top-down perspective. The objective of the game is to create a city, develop residential and industrial areas, build infrastructure and collect taxes for further development of the city. Importance is put on increasing the standard of living of the population, maintaining a balance between the different sectors, and monitoring the region's environmental situation to prevent the settlement from declining and going bankrupt, as extreme deficit spending gets a game over.SimCity 2000 was critically praised for its vibrant and detailed graphics, improved control menu, gameplay and music. An approximate total of 4.23 million copies of SimCity 2000 have been sold, mainly in the United States, Europe and Japan. While its predecessor pioneered the city-building genre of video games, SimCity 2000 would become the model on which subsequent urban simulators would be based upon over the course of the next decade. In 1995, SimCity 2000 won \"Best Military or Strategy Computer Game\" Origins Award.", "developer": ["Maxis"], "genre": "City-building", "date_release": "1994-01-01"}, "SimCity 3000": {"composer": "Jerry Martin", "description": "SimCity 3000 is a city building simulation video game released in 1999, and the third major installment in the SimCity series. It was published by Electronic Arts (EA) and developed by series creator Maxis. It was released for Microsoft Windows, Macintosh, and, through an arrangement with Loki Games, Linux.", "developer": ["Maxis"], "genre": "City-building", "date_release": "1999-01-31"}, "SimCity 4": {"producer": null, "composer": "Jerry Martin", "description": "SimCity 4 is a city-building simulation computer game developed by Maxis, a subsidiary of Electronic Arts. It was released on January 14, 2003. It is the fourth major installment in the SimCity series. SimCity 4 has a single expansion pack called Rush Hour which adds features to the game. SimCity 4: Deluxe Edition contained the original game and Rush Hour combined as a single product.\nThe game allows players to create a region of land by terraforming, and then to design and build a settlement which can grow into a city. Players can zone different areas of land as commercial, industrial, or residential development, as well as build and maintain public services, transport and utilities. For the success of a city, players must manage its finances, environment, and quality of life for its residents. SimCity 4 introduces night and day cycles and other special effects for the first time in the SimCity series. External tools such as the Building Architect Tool (BAT) allow custom third-party buildings and content to be added to the gameplay.\nSimCity 4 was praised for being the second game in the SimCity series to primarily use a 3D engine to render its graphics, the first being SimCity 64 for the discontinued Nintendo 64DD. It received widespread acclaim, won several awards, and was one of the top ten selling PC games of 2003. However, it was criticized for its difficulty and its demands on computer performance.", "developer": ["Maxis"], "genre": "City-building", "date_release": "2003-01-14"}, "SimCity Societies": {"producer": "Mat Williams", "composer": "Trevor Morris", "description": "SimCity Societies is a city-building simulation video game developed by Tilted Mill Entertainment and published by Electronic Arts, and is part of the SimCity series. The gameplay is significantly different from previous SimCity titles, with a greater focus on social development. SimCity Societies was released on November 13, 2007 and received mixed reviews, with praise for the game's improved accessibility and visuals, but criticism for being oversimplified and having poor performance.", "developer": ["Tilted Mill Entertainment"], "genre": "City-building", "date_release": "2007-11-13"}, "Sins of a Solar Empire": {"composer": "Paul Schuegraf", "description": "Sins of a Solar Empire is a 2008 science fiction real-time strategy video game developed by Ironclad Games and published by Stardock Entertainment for Microsoft Windows operating systems. It is a real-time strategy (RTS) game that incorporates some elements from 4X games; its makers describe it as \"RT4X\". Players are given control of a spacefaring empire in the distant future, and are tasked with conquering star systems using military, economic and diplomatic means.\nThe game was released on February 4, 2008, receiving positive reviews and multiple awards from the gaming press. Its first content expansion, titled Entrenchment, was released as a download on February 25, 2009, and its second content expansion, titled Diplomacy, was released as a download on February 9, 2010. A package combining the original game with the first two expansions was released at that time, with the title Sins of a Solar Empire: Trinity. A third expansion, the stand-alone Rebellion, was released in June 2012.", "developer": ["Ironclad Games"], "genre": "RTS", "date_release": "2008-01-01"}, "Sleeping Dogs": {"producer": [null, null], "composer": "Jeff Tymoschuk", "description": "Sleeping Dogs is an action-adventure video game developed by United Front Games and published by Square Enix. It was originally released for PlayStation 3, Xbox 360 and Windows. A remastered version subtitled Definitive Edition was later released for PlayStation 4, Xbox One, Windows and macOS.\nSet in contemporary Hong Kong, the story follows Wei Shen, an undercover Hong Kong-American police officer on assignment to infiltrate the Sun On Yee Triad organization. Gameplay focuses on Shen's fighting, shooting and parkour abilities, and on gadgets that can be used for combat and exploration. Players must complete missions to unlock content and continue the story, but they may instead freely roam the game's open world environment and engage in both legal and criminal activities. The latter may incite a police response, the intensity of which is controlled by a \"heat\" system. Actions such as fighting, driving and racing grant Shen statistical rewards and earn the player achievements.\nSleeping Dogs' difficult and prolonged development began in 2008. The game was announced in 2009 as part of the True Crime series but was canceled by Activision Blizzard in 2011, as a result of the project's delays and budget issues. Six months later, Square Enix bought the publishing rights and renamed the game Sleeping Dogs, without the True Crime license, but considered a spiritual successor. During development, United Front staff visited Hong Kong to conduct field research for the visual environments and sound.\nUpon its release in 2012, the game received positive reviews for its combat, voice acting, experience system and depiction of the city; but its graphics, camera, and animations were criticized. Within one year, the game had sold over 1.5 million copies. New outfits, missions and add-ons, as well as three expansion packs, were released as downloadable content in the six months following the game's debut. A remastered version, subtitled Definitive Edition, was released in October 2014 for PlayStation 4, Xbox One and Windows. It features improved gameplay, setting and audio-visual quality based on community feedback. The macOS version of Definitive Edition was released on 31 March 2016 by Feral Interactive.The game's success spawned a spin-off multiplayer game entitled Triad Wars, which was canceled in 2015. In 2017, a live action film adaptation was also announced, with Donnie Yen set to star as Shen.", "developer": ["United Front Games"], "genre": "Action-adventure", "date_release": "2012-09-14"}, "Smite": {"description": "Smite is a free-to-play, third-person multiplayer online battle arena (MOBA) video game developed and published by Hi-Rez Studios for Microsoft Windows, macOS, PlayStation 4, Nintendo Switch, and Xbox One. In Smite, players control a god, goddess, or other mythological figures, and take part in team based combat, using abilities and tactics against other player-controlled gods and non-player-controlled minions.\nThe game has multiple player versus player modes, many playable characters, and has a successful esports scene with multiple tournaments, including the annual million dollar Smite World Championship.", "developer": ["Hi-Rez Studios"], "genre": "MOBA", "date_release": "2014-03-25"}, "Sonic Heroes": {"producer": "Yuji Naka", "composer": "Jun Senoue", "description": "Sonic Heroes is a 2003 3D platform game in Sega's Sonic the Hedgehog series. The player races a team of series characters through levels to amass rings, defeat robots, and collect the seven Chaos Emeralds needed to defeat Doctor Eggman. Within each level, the player switches between the team's three characters, who each have unique abilities, to overcome obstacles. Sonic Heroes abandons the action-adventure and exploration-based gameplay of its predecessors Sonic Adventure (1998) and Sonic Adventure 2 (2001) and instead returns to the linear style of Sega Genesis-era Sonic games.\nThe game was the first multi-platform Sonic game, produced for the GameCube, PlayStation 2, Windows, and Xbox platforms. Sonic Team USA's Yuji Naka and Takashi Iizuka led the game's 20-month development. The team wanted Sonic Heroes to appeal beyond Sonic series fans and so designed a game that did not depend on the continuation of its predecessors. The team revived elements not seen since the Genesis Sonic games, such as special stages and the Chaotix characters. Sega released Sonic Heroes in Japan in December 2003 and worldwide in early 2004.\nReviewers were polarized. They praised the game's focus on fast gameplay and noted its similarities to the series' original 2D entries, a choice that some considered an improvement from the Sonic Adventure games. Reviewers also highlighted its graphic design and detailed environments and textures. Critics, however, derided the game for not addressing the problems of previous series games, such as poor camera controls and voice acting. Despite mixed reviews, it was a major commercial success, with 3.41 million copies sold by 2007.", "developer": ["Sonic Team USA"], "genre": "platform", "date_release": "2003-12-05"}, "Sonic & Knuckles Collection": {"description": "Sonic the Hedgehog is a video game series. It is published by Sega, with entries developed by Sega, Sonic Team, Dimps, SIMS Co., Ltd., BioWare, and Sumo Digital. The series debuted in 1991 with the video game, Sonic the Hedgehog, released for the Mega Drive video game console (named Genesis in North America). Most Sonic the Hedgehog games have either been platform games or released for Sega video game consoles and handheld game consoles (handhelds) dating from the Genesis to the eighth generation of video game consoles (2012–present). However, some of the original games were ported into versions on third-party home consoles and developed by several companies. As of February 2013, the series has collectively sold over 85 million copies worldwide across both the platform games and spin-offs.Most of the games in the franchise are platform games, although the series also includes other genres such as racing video games, fighting games, action-adventure games, role-playing video games, and sports games. Each game focuses on the titular protagonist Sonic the Hedgehog, an anthropomorphic blue hedgehog. It also features a large cast of other characters such as Doctor Ivo \"Eggman\" Robotnik, Miles \"Tails\" Prower, Knuckles the Echidna, Amy Rose, Shadow the Hedgehog, and the Chao creatures.", "developer": ["Sega PC"], "genre": "platform", "date_release": "1997-01-01"}, "Space Engineers": {"composer": "Karel Antonín", "description": "Space Engineers is a voxel-based sandbox game set in space and on planets. It was developed and published by Czech Republic independent developer Keen Software House. In 2013, the initial developmental release of the game joined the Steam early access program. During the following years of active development, Space Engineers sold over one million units. In total as of 2019 the game has sold over 3.5 million copies\nIn May of 2015, for approximately a year and a half, the game's source code was officially available and maintained by KSH to assist the modding community.\nOn December 15, 2016, the game entered Beta and was later officially released on February 28, 2019.", "developer": ["Keen Software House"], "genre": "Sandbox", "date_release": "2013-10-23"}, "Space Station 13": {"description": "Space Station 13 (or SS13) is a top-down role-playing multiplayer video game on the BYOND game engine, originally released in 2003. The game, like most BYOND games, is tile based and is played from a 2D angle.Set on a futuristic space station, players choose to play from a selection of different jobs available on the crew roster; the outcome of which is determined by the interactions players have with the environment around them.", "genre": "MMORPG", "date_release": "2003-02-16"}, "SpaceChem": {"composer": "Evan LE NY", "description": "SpaceChem is an indie puzzle game developed by Zachtronics Industries, based on principles of automation and chemical bonding. In the game, the player is tasked to produce one or more specific chemical molecules via an assembly line by programming two remote manipulators (called \"waldos\" in the game) that interact with atoms and molecules through a visual programming language. SpaceChem was the developer's first foray into a commercial title after a number of free Flash-based browser games that feature similar puzzle-based assembly problems.\nThe game was initially released for Microsoft Windows at the start of 2011 via Zachtronics' own website. Though it was initially rejected for sale on the Steam platform, Valve later offered to sell the game after it received high praise from game journalists; further attention came from the game's release alongside one of the Humble Indie Bundles. The game has since been ported to other computing platforms and mobile devices. Reviewers found the game's open-ended problem-solving nature as a highlight of the title. SpaceChem was incorporated into some academic institutions for teaching concepts related to both chemistry and programming.", "developer": ["Zachtronics Industries"], "genre": "Puzzle", "date_release": "2011-01-01"}, "Spore": {"composer": null, "description": "In biology, a spore is a unit of sexual or asexual reproduction that may be adapted for dispersal and for survival, often for extended periods of time, in unfavourable conditions. Spores form part of the life cycles of many plants, algae, fungi and protozoa. Bacterial spores are not part of a sexual cycle but are resistant structures used for survival under unfavourable conditions. Myxozoan spores release amoebulae into their hosts for parasitic infection, but also reproduce within the hosts through the pairing of two nuclei within the plasmodium, which develops from the amoebula.Spores are usually haploid and unicellular and are produced by meiosis in the sporangium of a diploid sporophyte. Under favourable conditions the spore can develop into a new organism using mitotic division, producing a multicellular gametophyte, which eventually goes on to produce gametes. Two gametes fuse to form a zygote which develops into a new sporophyte. This cycle is known as alternation of generations.\nThe spores of seed plants are produced internally, and the megaspores (formed within the ovules) and the microspores are involved in the formation of more complex structures that form the dispersal units, the seeds and pollen grains.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2008-09-07"}, "Spore: Galactic Adventures": {"producer": "Kip Katsarelis", "composer": "Kent Jolly", "description": "Spore: Galactic Adventures is an expansion pack for the multigenre game  Spore, developed by Maxis Emeryville and published by Electronic Arts. The US version of the game was released on June 23, 2009. The European version was released on June 26, 2009.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2009-06-23"}, "S.T.A.L.K.E.R.: Call of Pripyat": {"producer": "Sergey Grygorovych", "composer": null, "description": "S.T.A.L.K.E.R.: Call of Pripyat is a first-person shooter survival horror video game developed by Ukrainian video game developer GSC Game World for Microsoft Windows. It is the third game released in the S.T.A.L.K.E.R. series of computer games, following S.T.A.L.K.E.R.: Shadow of Chernobyl and S.T.A.L.K.E.R.: Clear Sky, with the game's narrative and events following the former. It was first published in the CIS territories by GSC World Publishing in October 2009, before later being released by Deep Silver and bitComposer Games in North America and the PAL region in February 2010.", "developer": ["GSC Game World"], "genre": "First-person shooter", "date_release": "2010-02-02"}, "S.T.A.L.K.E.R.: Clear Sky": {"producer": "Sergey Grygorovych", "composer": null, "description": "S.T.A.L.K.E.R.: Clear Sky is a first-person shooter, survival horror video game with role-playing elements developed by Ukrainian developer GSC Game World and published by Deep Silver in 2008 as a prequel to S.T.A.L.K.E.R.: Shadow of Chernobyl.", "developer": ["GSC Game World"], "genre": "First-person shooter", "date_release": "2008-09-15"}, "S.T.A.L.K.E.R.: Shadow of Chernobyl": {"producer": "Sergey Grygorovych", "composer": null, "description": "S.T.A.L.K.E.R.: Shadow of Chernobyl is a first-person shooter survival horror video game developed by Ukrainian game developer GSC Game World and published by THQ in 2007 following a long development. The game is set in an alternative reality, where a second nuclear disaster occurred at the Chernobyl Nuclear Power Plant Exclusion Zone, causing strange changes in the area around it. The game features a non-linear storyline and includes role-playing gameplay elements such as trading and two-way communication with NPCs.\nIn the game, the player assumes the identity of the Marked One, an amnesiac man trying to find and kill the mysterious Strelok within the Zone, a forbidden territory surrounding the Chernobyl Nuclear Power Plant. It is set after a fictitious second Chernobyl disaster, which further contaminated the surrounding area with radiation, and caused strange otherworldly changes in local fauna, flora, and the laws of physics. The background and some terminology of the game are borrowed from the Russian novella Roadside Picnic and the film Stalker that was based on it.\nA prequel, S.T.A.L.K.E.R.: Clear Sky, was released in 2008. A sequel, S.T.A.L.K.E.R.: Call of Pripyat, followed in 2010. There are also multiple fan remakes trying to restore the cut content from the original version of the game like S.T.A.L.K.E.R.: Oblivion Lost.", "developer": ["GSC Game World"], "genre": "First-person shooter", "date_release": "2007-03-20"}, "Starbound": {"producer": [null, null], "composer": "Curtis Schweitzer", "description": "Starbound is an action-adventure video game developed and published by Chucklefish. Starbound takes place in a two-dimensional, procedurally generated universe which the player is able to explore in order to obtain new weapons, armor, and items, and to visit towns and villages inhabited by various intelligent lifeforms. Starbound was released out of early access in July 2016 for Microsoft Windows, OS X, and Linux, and is in development for Xbox One, PlayStation 4, and PlayStation Vita.", "developer": ["Chucklefish"], "genre": "Action-adventure", "date_release": "2016-07-22"}, "Star Citizen": {"composer": null, "description": "Star Citizen is an upcoming multiplayer space trading and combat game developed and published by Cloud Imperium Games for Microsoft Windows. Development of the game began in 2011 led by director Chris Roberts, and is being mostly financed from a large crowdfunding campaign of over US$250 million. The game's full launch was originally anticipated to be in 2014, but significant expansion of gameplay features have led to postponement. Squadron 42, a single-player story-driven game set in the same universe as Star Citizen, is also being developed.", "developer": ["Cloud Imperium Games Corporation"], "genre": "Space trading and combat simulator", "date_release": null}, "Star Trek Online": {"description": "Star Trek Online is a massively multiplayer online role-playing game (MMORPG) developed by Cryptic Studios based on the Star Trek franchise. The game is set in the 25th century, 30 years after the events of Star Trek: Nemesis. Star Trek Online is the first massively multiplayer online role-playing game within the Star Trek franchise and was released for Microsoft Windows  in February 2010. At launch, the game required a game purchase and a recurring monthly fee. In January 2012, it relaunched with a tier of free-to-play access available. After a public beta testing period, a version of the game was released for OS X in March 2014. Due to technical issues with the port, support for OS X ended in February 2016. It was later released on PlayStation 4 and Xbox One in September 2016.", "developer": ["Cryptic Studios"], "genre": "MMORPG", "date_release": "2010-02-02"}, "Star Wars: Empire At War": {"producer": "Charles J. Kroegel Jr.", "composer": null, "description": "Star Wars: Empire at War is a 2006 real-time strategy video game developed by Petroglyph Games and published by LucasArts. Set between Episode III and Episode IV, it focuses on the fledgling struggle between the Empire and the Rebels. It uses Petroglyph's game engine Alamo. In October 2006, an expansion titled Star Wars: Empire at War: Forces of Corruption was released. On May 31, 2014, online functionality, including network multiplayer and wireless chat, was discontinued after Glu Mobile's purchase of GameSpy and the subsequent shutdown of all game servers. As of September 1, 2017, the multiplayer has been re-enabled on the Steam version as well as workshop support being added.", "developer": ["Petroglyph Games"], "genre": "Real-time strategy", "date_release": "2006-02-16"}, "Star Wars Galaxies": {"producer": "John Donham", "description": "Star Wars Galaxies was a Star Wars themed massively multiplayer online role-playing game (MMORPG) for Microsoft Windows, developed by Sony Online Entertainment and published by LucasArts.Released June 26, 2003, to much critical acclaim, it spawned three expansions through 2005. The game was completely overhauled in the last expansion, which frustrated many longtime subscribers. Star Wars Galaxies continued operation for six more years.\nThe servers shut down on December 15, 2011. Notwithstanding the game's closure, there are several private emulator projects in various stages of development that intend to allow users to experience Star Wars Galaxies in different incarnations of the game's existence.", "developer": ["Sony Online Entertainment"], "genre": "MMORPG", "date_release": "2006-02-17"}, "Star Wars: Knights of the Old Republic": {"producer": "Casey Hudson", "composer": "Jeremy Soule", "description": "Star Wars: Knights of the Old Republic (sometimes known simply as Knights of the Old Republic or KOTOR) is a role-playing video game set in the Star Wars universe. Developed by BioWare and published by LucasArts, the game was released for the Xbox on July 15, 2003, and for Microsoft Windows on November 19, 2003. The game was later ported to Mac OS X, iOS, and Android by Aspyr, and it is playable on the Xbox 360 and Xbox One via their respective backward compatibility features.\nThe story of Knights of the Old Republic takes place almost 4,000 years before the formation of the Galactic Empire, where Darth Malak, a Dark Lord of the Sith, has unleashed a Sith armada against the Republic. The player character, as a Jedi, must venture to different planets in the galaxy to defeat Malak. Players choose from three character classes and customize their characters at the beginning of the game, and engage in round-based combat against enemies. Through interacting with other characters and making plot decisions, the alignment system will determine whether the player's character aligns with the light or dark side of the Force.\nThe game was directed by Casey Hudson, designed by James Ohlen, and written by Drew Karpyshyn. LucasArts proposed developing a game tied to Star Wars: Episode II – Attack of the Clones, or a game set thousands of years before the prequels. The team chose the latter as they thought that they would have more creative freedom. Ed Asner, Ethan Phillips, and Jennifer Hale were hired to perform voices for the game's characters, while Jeremy Soule composed the soundtrack. Announced in 2000, the game was delayed several times before its release on July 2003.\nThe game received critical acclaim upon release, with critics applauding the game's characters, story, and sound. It was nominated for numerous awards and is considered one of the best video games ever made. A sequel, Star Wars: Knights of the Old Republic II – The Sith Lords, developed by Obsidian Entertainment at BioWare's suggestion, was released in 2004. The series' story continued with the 2011 release of Star Wars: The Old Republic, an MMORPG developed by BioWare.", "developer": ["BioWare"], "genre": "RPG", "date_release": "2003-11-19"}, "Star Wars: Knights of the Old Republic II – The Sith Lords": {"producer": "Chris Parker", "composer": "Mark Griskey", "description": "Star Wars Knights of the Old Republic II: The Sith Lords is a role-playing video game developed by Obsidian Entertainment and published by LucasArts. It is the sequel to BioWare's Star Wars: Knights of the Old Republic and was released for the Xbox on December 6, 2004, for Microsoft Windows on February 8, 2005, and OS X and Linux on July 21, 2015. Like its predecessor, it is set in the Star Wars universe 4,000 years before the events of the film Episode I: The Phantom Menace and is based on the d20 System developed by Wizards of the Coast. The game uses the Odyssey Engine, which was originally used in Knights of the Old Republic. The plot first started being written before the original Knights of the Old Republic was released, and development began in October 2003, after BioWare offered Obsidian their Star Wars license due to being confident in their previous work.\nKnights of the Old Republic II starts five years after the events of the first game and follows the story of The Exile, a Jedi Knight who was exiled from the Jedi Order. During this time, the Jedi Order has been almost completely wiped out by the Sith. The game begins with the protagonist waking up from unconsciousness on an asteroid mining facility. After he or she escapes with the help of their party members, they find the person who exiled them ten years ago, who sends the protagonist on a mission to seek out the remaining Jedi to fight against the Sith.\nThe game's critical reception upon its release was generally positive; praise was given to the story, characters, and writing, which were noted to be more grey than the original Knights of the Old Republic. Particular praise was given to one of the game's party members Kreia,  with GameSpy naming her the best video game character of 2005. However, the game received criticism for being too similar to its predecessor in terms of graphics and gameplay systems. The game was included in the book 1001 Video Games You Must Play Before You Die.", "developer": ["Obsidian Entertainment"], "genre": "RPG", "date_release": "2005-02-08"}, "Star Wars: Republic Commando": {"producer": null, "composer": "Jesse Harlin", "description": "Star Wars: Republic Commando is a tactical first-person shooter video game, set in the Star Wars universe, released in 2005. It was developed and published by LucasArts for the Xbox and Microsoft Windows. The game uses Unreal Engine. As of April 19, 2007, this game is backward compatible for the Xbox 360 with a downloadable patch. It was also made backwards compatible on the Xbox One on April 26, 2018.The game received positive reviews at release. Many critics praised the story and combat, but criticized the short length and average multiplayer.", "developer": ["LucasArts"], "genre": "Tactical shooter", "date_release": "2005-02-17"}, "Star Wars: The Old Republic": {"producer": "Dallas Dickinson", "composer": null, "description": "Star Wars: The Old Republic is a massively multiplayer online role-playing game (MMORPG) based in the Star Wars universe. Developed by BioWare Austin and a supplemental team at BioWare Edmonton, the game was announced on October 21, 2008. The video game was released for the Microsoft Windows platform on December 20, 2011 in North America and part of Europe. Early access to the game was granted one week before release, on December 13, 2011, for those who had pre-ordered the game online; access opened in \"waves\" based on pre-order date.This story takes place in the Star Wars universe shortly after the establishment of a tenuous peace between the re-emergent Sith Empire and the Galactic Republic. The game features eight different classes. Each of the eight classes has a three act storyline that progresses as the character levels up. Players join either the Republic or the Sith, but players may possess a morality at any point along the light/dark spectrum. Different classes favor different styles of gameplay, and the game features extensive customization options, fully voiced dialogue, companion characters, and dialogue options similar to BioWare's other role-playing games.\nAlthough not officially disclosed, based on estimates, it is one of the most developmentally expensive games made. The game had one million subscribers within three days of its launch, making it the world's \"fastest-growing MMO ever\", however, in the following months the game lost a fair share of its subscriptions, but has remained profitable. The game has since adopted the hybrid free-to-play business model with remaining subscription option. The game was met with positive reception upon release and has received several updates and expansion packs. Several books and comics based on the game have been released. It is estimated that the game made $139 million in additional revenues on top of the subscription income in 2013.\n\n", "developer": ["BioWare"], "genre": "MMORPG", "date_release": "2011-12-20"}, "Star Wars: TIE Fighter": {"composer": "Peter McConnell", "description": "Star Wars: TIE Fighter is a 1994 Star Wars space flight simulator and space combat video game, a sequel in the Star Wars: X-Wing series. It places the player in the role of an Imperial starfighter pilot during events that occur between The Empire Strikes Back and Return of the Jedi.\nThe game was produced by Lawrence Holland and Edward Kilham's Totally Games studio. Based on X-Wing's game engine, TIE Fighter supports Gouraud shading and adds gameplay features and craft not available in X-Wing. TIE Fighter was updated and re-released several times, and it was a critical success. It is considered by some critics to be among the greatest video games of all time.", "developer": ["Lucasarts"], "genre": "Flight simulation", "date_release": "1994-07-01"}, "Star Wars: X-Wing": {"description": "Star Wars: X-Wing is a space simulation video game, the first of the X-Wing combat flight simulator game series. The player's character flies starfighters, including the eponymous X-wing, for the Rebel Alliance as part of a narrative that precedes and parallels the events of Star Wars Episode IV: A New Hope.\nDesigned by Lawrence Holland and Edward Kilham's Totally Games for LucasArts, X-Wing was one of the first games to use 3D polygon graphics for spaceships and the first non-adventure game to use the iMUSE music system. The game was updated and re-released several times, and was followed by three sequels. X-Wing was a best-seller and received critical acclaim.", "developer": ["Lucasarts"], "genre": "Flight simulation", "date_release": "1993-02-01"}, "StarCraft": {"description": "StarCraft is a military science fiction media franchise created by Chris Metzen and James Phinney and owned by Blizzard Entertainment. The series, set in the beginning of the 26th century, centers on a galactic struggle for dominance among four species—the adaptable and mobile Terrans, the ever-evolving insectoid Zerg, the powerfully enigmatic Protoss, and the \"god-like\" Xel'Naga creator race—in a distant part of the Milky Way galaxy known as the Koprulu Sector. The series debuted with the video game StarCraft in 1998. It has grown to include a number of other games as well as eight novelizations, two Amazing Stories articles, a board game, and other licensed merchandise such as collectible statues and toys.\nBlizzard Entertainment began planning StarCraft in 1995 with a development team led by Metzen and Phinney. The game debuted at E3 1996 and used a modified Warcraft II game engine. StarCraft also marked the creation of Blizzard Entertainment's film department; the game introduced high quality cinematics integral to the storyline of the series. Most of the original development team for StarCraft returned to work on the game's expansion pack, Brood War; that game's development began only shortly after StarCraft was released. In 2001, StarCraft: Ghost began development under Nihilistic Software. Unlike the previous real-time strategy games in the series, Ghost was to be a stealth-action game. After three years of development, work on the game was postponed in 2004. Development of a true RTS sequel, StarCraft II: Wings of Liberty, began in 2003; the game was announced in May 2007 and was released in July 2010. The StarCraft II franchise continued with the StarCraft II: Heart of the Swarm expansion, which was released in March 2013. The third and final StarCraft II installment, Legacy of the Void, was released in November 2015. But a nine-mission pack, Nova Covert Ops, was also released.\nThe original game and its expansion have been praised as one of the benchmark real-time strategy games of its time. The series has gathered a solid following around the world, particularly in South Korea, where professional players and teams participate in matches, earn sponsorships, and compete in televised matches. By June 2007, StarCraft and Brood War had sold nearly 10 million copies combined. In addition, the series was awarded a star on the Walk of Game in 2006, and holds four Guinness World Records in the Guinness World Records Gamer's Edition of 2008.On March 27, 2017, Blizzard announced StarCraft: Remastered, a remastered version of the original StarCraft, with the core updates being up-to-date graphics and revised dialogue and audio. As of April 19, 2017, the original StarCraft and its Brood War expansion are free to download and play from Blizzard's website.", "developer": ["Blizzard Entertainment"], "genre": "RTS", "date_release": "1998-03-31"}, "StarCraft: Brood War": {"producer": "Shane Dabiri", "composer": null, "description": "StarCraft: Brood War is the expansion pack for the military science fiction real-time strategy video game StarCraft. Released in December 1998 for Microsoft Windows and June 1999 for Mac OS, it was co-developed by Saffire Corporation and Blizzard Entertainment. The expansion pack introduces new campaigns, map tilesets, music, extra units for each race, and upgrade advancements. The campaigns continue the story from where the original StarCraft ended, with the sequel, StarCraft II: Wings of Liberty, continuing from the conclusion of Brood War. The expansion was released first in the United States on December 18, 1998.Brood War was critically well received, with reviewers praising it for being developed with the care of a full game rather than as an uninspired extra. As of May 31, 2007, StarCraft and Brood War have sold almost ten million copies combined. The game is especially popular in South Korea, where professional players and teams have participated in matches, earned sponsorships, and competed in televised matches.\nAs of April 19, 2017; StarCraft and its Brood War expansion, aka the Anthology, are free to download and play from Blizzard's website. A remastered edition of StarCraft and its expansion was released on August 14, 2017.", "developer": ["Blizzard Entertainment", "Saffire Corporation"], "genre": "RTS", "date_release": "1998-11-30"}, "StarCraft II: Heart of the Swarm": {"composer": null, "description": "StarCraft II: Heart of the Swarm is an expansion pack to the military science fiction real-time strategy game StarCraft II: Wings of Liberty, and the second part of the StarCraft II trilogy developed by Blizzard Entertainment, with the final part being Legacy of the Void. The game was released on March 12, 2013.\nThe expansion includes additional units and multiplayer changes from Wings of Liberty, as well as a continuing campaign focusing on the Zerg race and following Sarah Kerrigan in her effort to regain control of the swarm and exact her revenge on the Terran Dominion's emperor, Arcturus Mengsk.\nDuring BlizzCon 2017, Blizzard announced that StarCraft II would be re-branded as a free-to-play game, hence opening the multiplayer mode to everybody and bringing some changes to previously paid features of the game. The Wings of Liberty campaign was made completely free while the campaigns for Heart of the Swarm and Legacy of the Void still required payment. However, those who had already bought Wings of Liberty before the free-to-play announcement were gifted the Heart of the Swarm campaign free of charge. This new free-to-play model and changes to the availability of the campaigns was in line with Blizzard's vision to support the game differently going forward. Micro-transactions such as Skins, Co-op Commanders, Voice Packs, and the War Chests proved to be successful enough to sustain StarCraft II as a story-driven and eSport title.", "developer": ["Blizzard Entertainment"], "genre": "RTS", "date_release": "2013-03-12"}, "StarCraft II: Legacy of the Void": {"producer": null, "composer": "Jason Hayes", "description": "StarCraft II: Legacy of the Void is a standalone expansion pack to the military science fiction real-time strategy game StarCraft II: Wings of Liberty, and the third and final part of the StarCraft II trilogy developed by Blizzard Entertainment. The game was released on November 10, 2015.The expansion includes additional units and multiplayer changes from StarCraft II: Heart of the Swarm, as well as a continuing campaign focusing on the Protoss race. The campaign, which focuses on Artanis as its protagonist, is a sequel to Wings of Liberty and Heart of the Swarm, and concludes the StarCraft II trilogy. Blizzard launched its invite-only beta testing of the game on March 31, 2015. The testing closed on November 2, 2015, a week before the November 10 release date.\nThe pre-order of the game was announced and made available for purchase on Battle.net and major game retailers on July 15, 2015. Pre-ordering the game granted immediate access to the multiplayer beta and a set of three prologue missions titled Whispers of Oblivion, which were subsequently made available to all players following the Heart of the Swarm 3.0 update on October 6, 2015.", "developer": ["Blizzard Entertainment"], "genre": "RTS", "date_release": "2015-11-10"}, "StarCraft II: Wings of Liberty": {"producer": "Chris Sigaty", "composer": null, "description": "StarCraft II: Wings of Liberty is a science fiction real-time strategy video game developed and published by Blizzard Entertainment. It was released worldwide in July 2010 for Microsoft Windows and Mac OS X. A sequel to the 1998 video game StarCraft and the Brood War expansion pack, the game is actually split into three installments: the base game, subtitled Wings of Liberty, an expansion pack, Heart of the Swarm, and a stand-alone expansion pack, Legacy of the Void. In March 2016, a campaign pack called StarCraft II: Nova Covert Ops was also released.\nLike its predecessor, the game revolves around three species: the Terrans (humans); the Zerg (a super-species of assimilated life forms), and the Protoss (a technologically advanced species with vast psionic powers). Wings of Liberty focuses on the Terrans, while the expansions, Heart of the Swarm and Legacy of the Void, focus on the Zerg and Protoss, respectively. The game is set four years after the events of 1998's StarCraft: Brood War, and follows the exploits of Jim Raynor as he leads an insurgent group against the autocratic Terran Dominion. The game includes both new and returning characters and locations from the original game.\nThe game was met with critical acclaim, receiving an aggregated score of 93% from Metacritic. Similar to its predecessor, StarCraft II was praised for its engaging gameplay, as well as its introduction of new features and improved storytelling. The game was criticized for lacking features that existed in the original StarCraft game including LAN play and the ability to switch between multiplayer regions. At the time of its release, StarCraft II became the fastest-selling real-time strategy game, with over three million copies sold worldwide in the first month.During BlizzCon 2017, it was announced that StarCraft II would be re-branded as a \"free-to-play\" game going forward, at least in part. This unlocked the Wings of Liberty single-player campaign, multiplayer mode, and two other game modes for everyone. The change was in line with Blizzard's vision going forward: supporting the game with micro-transactions such as Skins, Co-op Commanders, Voice Packs, and War Chests, which already proved to be successful.\n\n", "developer": ["Blizzard Entertainment"], "genre": "RTS", "date_release": "2010-07-27"}, "Stardew Valley": {"description": "Stardew Valley is a farming simulation role-playing video game developed by Eric \"ConcernedApe\" Barone and originally published by Chucklefish. The game was initially released for Microsoft Windows in February 2016, with later ports being released for macOS, Linux, PlayStation 4, Xbox One, Nintendo Switch, PlayStation Vita, iOS, and Android.\nIn Stardew Valley, the player takes the role of a character who, to get away from the hustle of the city, takes over their deceased grandfather's dilapidated farm in a place known as Stardew Valley. The player manages their character's time and energy levels as they clear land, plant and tend crops, raise livestock, craft goods, mine for ores, and engage in social activities, including romances leading towards marriage, with the various residents of the small town, all while earning in-game money to expand their farm. The game is open-ended, allowing the player to take on activities as they see fit. The game also features a four-player cooperative multiplayer mode.\nBarone, Stardew Valley's sole designer, developed the game over four years and frequently interacted with players during the development process. The game was heavily inspired by the Harvest Moon video game series, with additions to address some of the shortcomings of these games while using the opportunity as an exercise to improve his own programming and game design skills.  Chucklefish approached Barone midway through development with the offer to publish the game, allowing him to focus more on completing it. Stardew Valley received positive reception from critics, and was one of the top-selling games on Steam shortly after release. By the end of 2017, it had sold over 3.5 million copies across all platforms.", "genre": "RPG", "date_release": "2016-02-26"}, "StarDrive": {"description": "StarDrive is a 4X real-time strategy video game by Zero Sum Games, it was released for Microsoft Windows in April 2013. The game was funded through Kickstarter, raising $17,676 in its December 2011 crowdfunding campaign. The player's goal is to dominate the galaxy with one of the eight races through diplomacy and war while developing new technologies, exploring new star systems and colonizing new planets.  The game received a mixed critical reception, generating a score of 61/100 on reviews aggregation website Metacritic.  Its sequel, StarDrive 2 contrastingly adopts turn-based strategy gameplay and was released in April 2015.", "genre": "4X", "date_release": "2013-04-26"}, "Starsector": {"description": "The Outworlds: A Starsector Atlas is a 1981 role-playing game supplement for Space Opera published by Fantasy Games Unlimited.", "developer": ["[1]"], "genre": "4X", "date_release": "2013-04-26"}, "Starsiege: Tribes": {"producer": "Ken Embery", "description": "Starsiege: Tribes is a first-person shooter video game. It is the first of the Tribes video game series and follows the story from Metaltech: Earthsiege and Starsiege. It was developed by Dynamix and published by Sierra On-Line in 1998. An expansion pack, Tribes Extreme, was cancelled; it was supposed to add single-player missions, multiplayer maps, and bot AI.", "developer": ["Dynamix"], "genre": "First-person shooter", "date_release": "1998-11-30"}, "State of Decay": {"producer": null, "composer": null, "description": "State of Decay 2 is an open world and \"indie\" zombie survival video game developed by Undead Labs and published by Microsoft Studios. It is a sequel to the 2013 video game State of Decay. The game was released on May 22, 2018 for Windows and Xbox One. The point of the game is to build a community, manage resources and survive against the horde of zombies.", "developer": ["Undead Labs"], "genre": "Stealth", "date_release": "2013-11-05"}, "Stellar Monarch": {"description": "This is an index of grand strategy video games, sorted chronologically. Information regarding date of release, developer, platform, setting, and notability is provided when available. The table can be sorted by clicking on the small boxes next to the column headings.", "genre": "4X", "date_release": "2016-12-05"}, "Street Racing Syndicate": {"description": "Street Racing Syndicate is a multiplatform racing video game produced by Eutechnyx, and released by Namco on August 31, 2004 for the PlayStation 2, GameCube, Xbox and Windows-based personal computers. The game was also released for the Game Boy Advance on October 4, 2005.", "developer": ["Eutechnyx"], "genre": "Racing", "date_release": "2005-10-04"}, "Stronghold": {"composer": "Robert L. Euvino", "description": "A fortification is a military construction or building designed for the defense of territories in warfare, and is also used to solidify rule in a region during peacetime.  The term is derived from the Latin fortis (\"strong\") and facere (\"to make\").\nFrom very early history to modern times, walls have often been necessary for cities to survive in an ever-changing world of invasion and conquest. Some settlements in the Indus Valley Civilization were the first small cities to be fortified. In ancient Greece, large stone walls had been built in Mycenaean Greece, such as the ancient site of Mycenae (famous for the huge stone blocks of its 'cyclopean' walls). A Greek phrourion was a fortified collection of buildings used as a military garrison, and is the equivalent of the Roman castellum or English fortress. These constructions mainly served the purpose of a watch tower, to guard certain roads, passes, and lands that might threaten the kingdom. Though smaller than a real fortress, they acted as a border guard rather than a real strongpoint to watch and maintain the border.\nThe art of setting out a military camp or constructing a fortification traditionally has been called \"castrametation\" since the time of the Roman legions. Fortification is usually divided into two branches: permanent fortification and field fortification. There is also an intermediate branch known as semi-permanent fortification. Castles are fortifications which are regarded as being distinct from the generic fort or fortress in that they are a residence of a monarch or noble and command a specific defensive territory.\nRoman forts and hill forts were the main antecedents of castles in Europe, which emerged in the 9th century in the Carolingian Empire. The Early Middle Ages saw the creation of some towns built around castles.\nMedieval-style fortifications were largely made obsolete by the arrival of cannons in the 14th century. Fortifications in the age of black powder evolved into much lower structures with greater use of ditches and earth ramparts that would absorb and disperse the energy of cannon fire. Walls exposed to direct cannon fire were very vulnerable, so the walls were sunk into ditches fronted by earth slopes to improve protection.\nThe arrival of explosive shells in the 19th century led to yet another stage in the evolution of fortification. Star forts did not fare well against the effects of high explosive, and the intricate arrangements of bastions, flanking batteries and the carefully constructed lines of fire for the defending cannon could be rapidly disrupted by explosive shells. Steel-and-concrete fortifications were common during the 19th and early 20th centuries. However the advances in modern warfare since World War I have made large-scale fortifications obsolete in most situations.\nDemilitarized zones along borders are arguably another type of fortification, although a passive kind, providing a buffer between potentially hostile militaries.", "developer": ["Firefly Studios", "MacSoft"], "genre": "RTS", "date_release": "2001-10-19"}, "Stronghold 2": {"composer": "Robert L. Euvino", "description": "Stronghold 2 is a real time strategy computer game released in April 2005 in which the player develops a stronghold in the middle ages. It is the sequel to Stronghold, released in 2001, also by Firefly Studios.\nThe game engine was enhanced over the original Stronghold to provide full 3-dimensional graphics. Other changes include new military and peace campaigns and the addition of crime and punishment, allowing players to torture unruly peasants.  A number of new characters were also introduced.", "developer": ["Firefly Studios"], "genre": "RTS", "date_release": "2005-04-18"}, "Stronghold 3": {"producer": "Paul Harris", "composer": "Robert L. Euvino", "description": "Stronghold 3 is a 2011 real-time strategy video game for Microsoft Windows developed by Firefly Studios and published by 7Sixty. The game is the seventh in the series after several spin-offs, including a remake, Stronghold: Crusader Extreme, and Stronghold Kingdoms. It is the sequel to Stronghold, released in 2001, and Stronghold 2 released in 2005. Unlike previous games in the series which were published by Take-Two Interactive, the game has been published by SouthPeak Games, the new parent company of Gamecock Media Group, publisher of Stronghold Crusader Extreme.", "developer": ["Firefly Studios"], "genre": "RTS", "date_release": "2011-10-25"}, "Stronghold: Crusader": {"composer": "Robert L. Euvino", "description": "Stronghold: Crusader is the successor to Firefly Studios's 2001 real-time strategy video game Stronghold. Crusader has much in common with the original Stronghold, but differs from its predecessor in the fact that the game is no longer set in England, instead being set in the Middle East during the Crusades. The game features a multitude of new Arabian units that can be purchased in a new building, the mercenary post. Though the Arabian troops do not require any weapons to produce, they are rather expensive. The game was also released as Stronghold Warchest. This version was a compendium of Stronghold and an enhanced version of Stronghold: Crusader, containing additional characters and an additional Crusader Trail.\nStronghold Warchest was only released in a limited number of countries (i. e. USA or Poland), meaning players in the rest of the world have never encountered the second Crusader Trail, or second set of characters. This changed when an updated version of Stronghold Crusader, Stronghold: Crusader Extreme was released in early 2008.", "developer": ["Firefly Studios"], "genre": "RTS", "date_release": "2002-07-31"}, "Stronghold: Crusader Extreme": {"composer": "Robert L. Euvino", "description": "Stronghold: Crusader is the successor to Firefly Studios's 2001 real-time strategy video game Stronghold. Crusader has much in common with the original Stronghold, but differs from its predecessor in the fact that the game is no longer set in England, instead being set in the Middle East during the Crusades. The game features a multitude of new Arabian units that can be purchased in a new building, the mercenary post. Though the Arabian troops do not require any weapons to produce, they are rather expensive. The game was also released as Stronghold Warchest. This version was a compendium of Stronghold and an enhanced version of Stronghold: Crusader, containing additional characters and an additional Crusader Trail.\nStronghold Warchest was only released in a limited number of countries (i. e. USA or Poland), meaning players in the rest of the world have never encountered the second Crusader Trail, or second set of characters. This changed when an updated version of Stronghold Crusader, Stronghold: Crusader Extreme was released in early 2008.", "developer": ["Firefly Studios"], "genre": "RTS", "date_release": "2008-05-27"}, "Stronghold Kingdoms": {"producer": null, "description": "Stronghold Kingdoms is a Massively multiplayer online real-time strategy game video game with a Medieval castle building theme.  It was developed by Firefly Studios and based upon their commercially successful and popular Stronghold series of games.  Firefly Studios started development of Stronghold Kingdoms in 2007 as their first entry into the MMO  genre.  The first Alpha test began in 2009 and was open to 150 players.", "developer": ["Firefly Studios"], "genre": "RTS", "date_release": "2012-10-17"}, "Stronghold Legends": {"producer": "Paul Harris", "composer": "Robert L. Euvino", "description": "Stronghold Legends is a real-time strategy game developed by Firefly Studios and published by 2K Games in 2006. It follows in the series of Stronghold and Stronghold 2.", "developer": ["Firefly Studios"], "genre": "RTS", "date_release": "2006-10-13"}, "Sunset Overdrive": {"producer": "Bryan Intihar", "composer": "Boris Salchow", "description": "Sunset Overdrive is an action-adventure shooter video game developed by Insomniac Games and published by Microsoft Studios. It was announced at Electronic Entertainment Expo 2013, and released worldwide for Xbox One in October 2014 and for Microsoft Windows in November 2018, with the Microsoft Windows version being published by THQ Nordic. The game is set in 2027, in a fictional metropolis called Sunset City. The player controls an employee of FizzCo, who has to fight off the OD, short for Overcharge Drinkers: humans who have turned into mutants after drinking FizzCo's energy drink beverage. In the dystopian Sunset City the player character can wall-run, use zip-lines, and grind rails to swiftly navigate through it, with a large arsenal of weapons to use. The game also has a cooperative multiplayer mode called Chaos Squad, which tasks players to complete a series of missions with seven players. As the game puts emphasis on momentum, the game does not feature any cover system.\nThe development of the game began in 2010 when Insomniac completed Resistance 3. After the project was green-lit internally, the studio partnered with Microsoft Studios, which helped fund the game and allowed Insomniac to keep the rights to the franchise. Insomniac described the game as a \"celebration of games\", as the team took inspiration from different sources, including Prince of Persia, Jet Set Radio and Tony Hawk's Pro Skater, though at its early stage of development the team took inspirations from DayZ instead. The game is set in a post-apocalyptic future, but the team depicted it as an \"awesomepocalypse\" that turns the game's initial world depiction into a \"playground\" for players. Sunset Overdrive is powered by Insomniac's internal engine, previously used in Fuse, one of their previous games.\nThe game received generally positive reviews, with praise for its visuals, traversal system, combat system, and humor. However, the game was criticized for the lack of a compelling story or innovative quest design. It received numerous nominations, including Best Xbox Game of the Year awards from several gaming publications. The game was supported with multiple downloadable content, including the story-based The Mystery of the Mooil Rig and Dawn of the Rise of the Fallen Machine, after the game's release.", "developer": ["Insomniac Games"], "genre": "Action-adventure", "date_release": null}, "Super Meat Boy": {"producer": "Kevin Hathaway", "composer": null, "description": "Super Meat Boy is an independent video game designed by Edmund McMillen and Tommy Refenes, and developed by \"Team Meat\". It is the successor to Meat Boy, McMillen and Jonathan McEntee's 2008 flash game. The game was released on the Xbox 360 through Xbox Live Arcade in October 2010, on Microsoft Windows in November 2010, on OS X a year later in November 2011, on Linux in December 2011 as a part of the Humble Indie Bundle #4 (in May 2012 as a part of the Humble Indie Bundle #5), on PlayStation 4 and PlayStation Vita in October 2015, on Wii U in May 2016, and for the Nintendo Switch in January 2018.In the game, the player controls Meat Boy, a red, cube-shaped character, as he attempts to rescue his girlfriend, Bandage Girl, from the game's antagonist Dr. Fetus. The gameplay is characterized by fine control and split-second timing, as the player runs and jumps through over 300 hazardous levels while avoiding obstacles. Additional player-created levels are available for free download.\nDevelopment of the game began in January 2009. McMillen worked on level design and artwork, while Refenes coded the game; it was tested primarily by the pair and their families. Initially intended for release in early 2010 for personal computers and the WiiWare download service, the release date was pushed back as the design was changed to include more levels, yet exclude multiplayer modes. The WiiWare version was canceled due to the service's technical limitations, and instead the first release was on the Xbox 360. The music for the game was created by Danny Baranowsky, who had also composed the music for the original Meat Boy. The soundtrack was released as an album, and music from Super Meat Boy was released as downloadable content for Rock Band 3.\nThe game was critically acclaimed; in 2010, it received awards for Most Challenging Game from IGN, and for Best Downloadable Game from GameSpot and GameTrailers. Critics lauded the game's precise controls, retro artwork, and soundtrack. Reviewers generally praised the game's challenge, although some warned that not all players would appreciate the high level of difficulty (possibly a throwback to games of yore). It has been cited as one of the greatest video games of all time. The game was a commercial and economic success, and sold more than one million copies by January 2012.\nA sequel to the game, Super Meat Boy Forever is in development, scheduled for release in 2019.", "developer": ["Team Meat"], "genre": "Platformer", "date_release": "2011-04-05"}, "Supreme Commander": {"producer": null, "composer": "Jeremy Soule", "description": "The Supreme Allied Commander Europe (SACEUR) is the commander of the North Atlantic Treaty Organization's (NATO) Allied Command Operations (ACO) and head of ACO's headquarters, Supreme Headquarters Allied Powers Europe (SHAPE). The commander is based at SHAPE in Casteau, Belgium. SACEUR is the second-highest military position within NATO, below only the Chairman of the NATO Military Committee in terms of precedence.\nSACEUR has always been held by a U.S. military officer, and the position is dual-hatted with that of Commander of United States European Command.\nThe current SACEUR is General Tod D. Wolters of the United States Air Force.", "developer": ["Gas Powered Games"], "genre": "RTS", "date_release": "2007-02-16"}, "Surf's Up": {"description": "Surf's Up is a 2007 American computer-animated mockumentary comedy film directed by Ash Brannon and Chris Buck. It features the voices of Shia LaBeouf, Jeff Bridges, Zooey Deschanel, Jon Heder, Mario Cantone, James Woods, and Diedrich Bader among others. In production since 2002 at Sony Pictures Animation, it was the studio's second theatrical feature film. The film premiered in the United States on June 8, 2007, and was distributed by Columbia Pictures. It is a parody of surfing documentaries, such as The Endless Summer and Riding Giants, with parts of the plot parodying North Shore. Real-life surfers Kelly Slater and Rob Machado have vignettes as their penguin surfer counterparts. To obtain the desired hand-held documentary feel, the film's animation team motion-captured a physical camera operator's moves. It was also nominated at The 80th Academy Awards for Best Animated Feature, but lost to Pixar's Ratatouille. A sequel, titled Surf's Up 2: WaveMania, was released direct-to-video on January 17, 2017.", "developer": ["Ubisoft Montreal", "Ubisoft Quebec", "Totally Games"], "genre": "Sports", "date_release": "2007-05-30"}, "SWAT 3: Close Quarters Battle": {"producer": "Rod Fung", "composer": "Gary Spinrad", "description": "SWAT 3: Close Quarters Battle is a tactical shooter, developed by Sierra Northwest and published by Sierra Entertainment for Microsoft Windows-based PCs. It is the seventh installment of the Police Quest series.\nAs the first first-person shooter of the Police Quest series, SWAT 3 received a new game engine with cell and portal technologies for simulation of environments and advanced AI and ballistics. The developers spent some time consulting with LAPD SWAT, including a real-life SWAT element leader and LAPD SWAT founder Daryl Gates in order to create an accurate, realistic simulation. Most of the animations in the game were motion captured from a real-life SWAT officer. Unlike many other first-person shooter games, SWAT 3 places an emphasis on realistic police methods and tactics, including proper room clearance, use of less-lethal weaponry, ordering compliance and arresting enemies rather than shooting on sight, and differentiating between authorized and unauthorized use of lethal force.\nSWAT 3 is set in 2005 in Los Angeles, with the player assuming the role of a Los Angeles Police Department SWAT officer, leading a five-man element of computer-controlled teammates. Los Angeles is due to host a major, United Nations-brokered nuclear disarmament treaty signing attended by a number of world powers, including the United States, Russia, and China. LAPD SWAT is tasked with protecting the treaty event and the attending dignitaries from a number of violent criminal and terrorist groups seeking to either abuse or disrupt the treaty signing event for their own ends, culminating in a direct nuclear threat to the city and an attack at the treaty signing event itself.\nSWAT 3 also includes a multiplayer mode, including traditional Deathmatch and Team Deathmatch modes, as well as Cooperative play using the single player missions.\nSWAT 3 was met by positive critical acclaim, attracting praise for its graphics and AI sophistication, and also spawned a successor, SWAT 4 which was released in April 2005, developed and published by Irrational Games and Sierra owner Vivendi Universal.\nA Dreamcast version was planned for release in 2000, but it was ultimately cancelled for unknown reasons.", "developer": ["Sierra Northwest"], "genre": "First-person shooter", "date_release": "1999-11-23"}, "SWAT 4": {"producer": "Sara Verrilli", "composer": "Eric Brosius", "description": "SWAT 4 is a 2005 tactical shooter video game developed by Irrational Games and published by Vivendi Universal Games exclusively for Microsoft Windows. It was built on Irrational Games' Vengeance Engine powered by Unreal Engine 2 technology. In SWAT 4, the player leads a SWAT tactical element in resolving various situations, such as hostage standoffs or apprehensions of dangerous subjects, simulating the experiences of real-life Special Weapons and Tactics officers.", "developer": ["Irrational Games"], "genre": "First-person shooter", "date_release": "2005-04-05"}, "System Shock": {"producer": "Warren Spector", "composer": null, "description": "System Shock is a 1994 first-person action-adventure video game developed by LookingGlass Technologies and published by Origin Systems. It was directed by Doug Church with Warren Spector serving as producer. The game is set aboard a space station in a cyberpunk vision of the year 2072. Assuming the role of a nameless hacker, the player attempts to hinder the plans of a malevolent artificial intelligence called SHODAN.\nSystem Shock's 3D engine, physics simulation and complex gameplay have been cited as both innovative and influential. The developers sought to build on the emergent gameplay and immersive environments of their previous games, Ultima Underworld: The Stygian Abyss and Ultima Underworld II: Labyrinth of Worlds, by streamlining their mechanics into a more \"integrated whole\".\nCritics praised System Shock and hailed it as a major breakthrough in its genre. It was later placed on multiple hall of fame lists. The game was a moderate commercial success, with sales exceeding 170,000 copies, but Looking Glass ultimately lost money on the project. A sequel, System Shock 2, was released by Looking Glass Studios and offshoot developer Irrational Games in 1999. The 2000 game Deus Ex (also produced by Spector) and the 2007 game BioShock are spiritual successors to the two games. A remade version of the original game by Night Dive Studios is scheduled for release in 2020.", "developer": ["Looking Glass Studios"], "genre": "Action-adventure", "date_release": "1994-10-22"}, "System Shock 2": {"producer": "Josh Randall", "composer": null, "description": "System Shock 2 is a 1999 first-person action role-playing survival horror video game designed by Ken Levine and co-developed by Irrational Games and Looking Glass Studios. Originally intended to be a standalone title, its story was changed during production into a sequel to the 1994 game System Shock. The alterations were made when Electronic Arts—who owned the System Shock franchise rights—signed on as publisher.\nThe game takes place on board a starship in a cyberpunk depiction of 2114. The player assumes the role of a soldier trying to stem the outbreak of a genetic infection that has devastated the ship. Like System Shock, gameplay consists of first-person combat and exploration. It also incorporates role-playing system elements, in which the player can develop skills and traits, such as hacking and psionic abilities.\nSystem Shock 2 was originally released in August 1999 for Microsoft Windows. The game received critical acclaim but failed to meet commercial sales expectations. Many critics later determined that the game was highly influential in subsequent game design, particularly on first-person shooters, and considered it far ahead of its time. It has been included in several \"greatest games of all time\" lists. In 2007, Irrational Games released a spiritual successor to the System Shock series, titled BioShock, to critical acclaim and strong sales. System Shock 2 had been in intellectual property limbo following the closure of Looking Glass Studios. Night Dive Studios were able to secure the rights to the game and System Shock franchise in 2013 to release an updated version of System Shock 2 for modern operating systems, including for OS X and Linux, and announced plans to release an Enhanced Edition of the game. OtherSide Entertainment announced in 2015 that they have been licensed the rights from Night Dive Studios to produce a sequel, System Shock 3.", "developer": ["Irrational Games", "Looking Glass Studios"], "genre": "Action RPG", "date_release": "1999-08-11"}}