{"Baldur's Gate": {"producer": "Ray Muzyka", "composer": "Michael Hoenig", "description": "Baldur's Gate is a fantasy role-playing video game developed by BioWare and published in 1998 by Interplay Entertainment. It is the first game in the Baldur's Gate series and takes place in the Forgotten Realms, a high fantasy campaign setting, using a modified version of the Advanced Dungeons & Dragons (AD&D) 2nd edition rules. It was the first game to use the Infinity Engine for its graphics, with Interplay using the engine for other Forgotten Realms-licensed games, including the Icewind Dale series, as well as other licensed D&D campaign worlds such as Planescape: Torment. The game's story focuses on players controlling a protagonist of their own creation who finds themselves travelling across the Sword Coast alongside a party of companions, to unravel the mystery surrounding a sudden iron crisis affecting the region and attempting to discover the culprits behind it, while uncovering dark secrets about their origins and dealing with attempts on their life.\nThe game received critical acclaim following its release and was credited for revitalising computer role-playing games. Its success led to an expansion pack entitled Tales of the Sword Coast, as well as spawning a sequel entitled Baldur's Gate II: Shadows of Amn, which later received its own expansion called Throne of Bhaal. An enhanced version of the Infinity Engine was later created as part of Beamdog's remake, entitled Baldur's Gate: Enhanced Edition, the first new release in the franchise in nearly nine years.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "1998-12-21"}, "Baldur's Gate: Tales of the Sword Coast": {"description": "Baldur's Gate: Tales of the Sword Coast is an expansion pack of the fantasy role-playing video game Baldur's Gate. Developed by BioWare and published by Interplay in April 1999, it adds 20 to 30 extra hours of gameplay to the original game, including the addition of four new areas and minor tweaks to some of the mechanics. The expansion consists of four notable quests that take place within the same game world as Baldur's Gate, and sees players taking their character (referred to as the Ward) and their party of companions across the Sword Coast, from travelling to a distant island, to exploring the fortress dungeon of a late dwarf. Tales of the Sword Coast achieved global sales of 600,000 units by 2003.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "1999-04-30"}, "Baldur's Gate II: Shadows of Amn": {"producer": "Ben Smedstad", "composer": "Michael Hoenig", "description": "Baldur's Gate II: Shadows of Amn is a role-playing video game developed by BioWare and published by Interplay Entertainment. It is the sequel to Baldur's Gate (1998) and was released for Microsoft Windows in September 2000. Like Baldur's Gate, the game takes place in the Forgotten Realms—a fantasy campaign setting—and is based on the Advanced Dungeons & Dragons 2nd edition rules. Powered by BioWare's Infinity Engine, Baldur's Gate II uses an isometric perspective and pausable real-time gameplay. The player controls a party of up to six characters, one of whom is the player-created protagonist, while the others are certain characters recruited from the game world.\nSet in the fictional Forgotten Realms, much of Baldur's Gate II takes place in and around Athkatla, a city in the country of Amn. Opening shortly after the events of Baldur's Gate, the game continues the story of the protagonist, Gorion's Ward, whose unique heritage has now gained him or her the attention of Jon Irenicus, a powerful and sinister mage. The storyline revolves around the machinations of Irenicus and the player's encounters with him.\nDevelopment began in January 1999. BioWare set out to improve upon the first Baldur's Gate in every way possible. From a list of constructive criticism—compiled from the suggestions of fans, reviews, and internal suggestions—a list of features to be added to the game was distilled: some of these were 800 x 600 resolution, 3D support, and character kits. In Baldur's Gate, the game's engine and content were being developed at the same time; whereas in Baldur's Gate II, the engine was running from the start. Having a completed engine meant they could direct their efforts towards producing content, instead of focusing on basic functionality.\nShadows of Amn received critical acclaim, being praised for its gameplay, artwork, and voice acting, and is often noted as one of the greatest role-playing games of all time. GameSpy, GameSpot, and IGN awarded it their \"Role-Playing Game of the Year\" awards for 2000, and the game has sold more than two million units. An expansion pack, Baldur's Gate II: Throne of Bhaal, was released in 2001. Besides adding a large dungeon and enhancements to the game, this well-received expansion concluded the Child of Bhaal saga. Shadows of Amn and Throne of Bhaal have also been included together in various compilations. In 2013, an enhanced version of Baldur's Gate II was released, bearing the title Baldur's Gate II: Enhanced Edition and using an updated version of the Infinity Engine.", "developer": ["BioWare"], "genre": "Role-playing", "date_release": "2000-09-24"}, "Baldur's Gate II: Throne of Bhaal": {"composer": null, "description": "Baldur's Gate II: Shadows of Amn is a role-playing video game developed by BioWare and published by Interplay Entertainment. It is the sequel to Baldur's Gate (1998) and was released for Microsoft Windows in September 2000. Like Baldur's Gate, the game takes place in the Forgotten Realms—a fantasy campaign setting—and is based on the Advanced Dungeons & Dragons 2nd edition rules. Powered by BioWare's Infinity Engine, Baldur's Gate II uses an isometric perspective and pausable real-time gameplay. The player controls a party of up to six characters, one of whom is the player-created protagonist, while the others are certain characters recruited from the game world.\nSet in the fictional Forgotten Realms, much of Baldur's Gate II takes place in and around Athkatla, a city in the country of Amn. Opening shortly after the events of Baldur's Gate, the game continues the story of the protagonist, Gorion's Ward, whose unique heritage has now gained him or her the attention of Jon Irenicus, a powerful and sinister mage. The storyline revolves around the machinations of Irenicus and the player's encounters with him.\nDevelopment began in January 1999. BioWare set out to improve upon the first Baldur's Gate in every way possible. From a list of constructive criticism—compiled from the suggestions of fans, reviews, and internal suggestions—a list of features to be added to the game was distilled: some of these were 800 x 600 resolution, 3D support, and character kits. In Baldur's Gate, the game's engine and content were being developed at the same time; whereas in Baldur's Gate II, the engine was running from the start. Having a completed engine meant they could direct their efforts towards producing content, instead of focusing on basic functionality.\nShadows of Amn received critical acclaim, being praised for its gameplay, artwork, and voice acting, and is often noted as one of the greatest role-playing games of all time. GameSpy, GameSpot, and IGN awarded it their \"Role-Playing Game of the Year\" awards for 2000, and the game has sold more than two million units. An expansion pack, Baldur's Gate II: Throne of Bhaal, was released in 2001. Besides adding a large dungeon and enhancements to the game, this well-received expansion concluded the Child of Bhaal saga. Shadows of Amn and Throne of Bhaal have also been included together in various compilations. In 2013, an enhanced version of Baldur's Gate II was released, bearing the title Baldur's Gate II: Enhanced Edition and using an updated version of the Infinity Engine.", "developer": ["BioWare"], "genre": "Role-playingduqkwdwdwdd", "date_release": "2001-06-21"}, "Banished": {"description": null, "developer": ["Shining Rock Software"], "genre": "City building", "date_release": "2014-02-18"}, "Bastion": {"composer": "Darren Korb", "description": "A bastion or bulwark is a structure projecting outward from the curtain wall of a fortification, most commonly angular in shape and positioned at the corners. The fully developed bastion consists of two faces and two flanks with fire from the flanks being able to protect the curtain wall and also the adjacent bastions. It is one element in the style of fortification dominant from the mid 16th to mid 19th centuries. Bastion fortifications offered a greater degree of passive resistance and more scope for ranged defense in the age of gunpowder artillery compared with the medieval fortifications they replaced.", "developer": ["Supergiant Games"], "genre": "Action", "date_release": "2011-08-16"}, "Batman: Arkham Asylum": {"producer": [null, null], "composer": null, "description": "Batman: Arkham Asylum is a 2009 action-adventure video game developed by Rocksteady Studios and published by Eidos Interactive in conjunction with Warner Bros. Interactive Entertainment. Based on the DC Comics superhero Batman and written by veteran Batman writer Paul Dini, Arkham Asylum was inspired by the long-running comic book mythos. In the game's main storyline, Batman battles his archenemy, the Joker, who instigates an elaborate plot to seize control of Arkham Asylum, trap Batman inside with many of his incarcerated foes, and threaten the fictional Gotham City with hidden bombs. Most of the game's leading characters are voiced by actors who have appeared in other media based on the DC Animated Universe; Kevin Conroy, Mark Hamill, and Arleen Sorkin reprised their roles as Batman, the Joker, and his sidekick Harley Quinn respectively.\nThe game is presented from the third-person perspective with a primary focus on Batman's combat and stealth abilities, detective skills, and gadgets that can be used in combat and exploration. Batman can freely move around the Arkham Asylum facility, interacting with characters and undertaking missions, and unlocking new areas by progressing through the main story or obtaining new equipment. The player is able to complete side missions away from the main story to unlock additional content and collectible items. Combat focuses on chaining attacks together against numerous foes while avoiding damage, while stealth allows Batman to conceal himself around an area, using gadgets and the environment to silently eliminate enemies.\nDevelopment began at Rocksteady Studios in May 2007, with a 40-person team that expanded to 60 people by the project's conclusion after approximately 21 months. Among others, the game design was inspired by Batman-penned works of Neal Adams and Frank Miller, and Grant Morrison's Arkham Asylum: A Serious House on Serious Earth graphic novel. Built on Unreal Engine 3, Arkham Asylum's production underwent several variations, refining both gameplay such as the combat system, and the central story, resulting in the removal of plot elements and some of Batman's main enemies, who did not fit the tone of the rest of the game. Rocksteady began developing ideas for a sequel months before Arkham Asylum's completion, hiding hints to the sequel within the game.\nArkham Asylum was released worldwide for the PlayStation 3 and Xbox 360 video game consoles on August 25, 2009, followed by a Microsoft Windows version on September 15. The game received critical acclaim, particularly for its narrative and combat. Reviewers called it the \"greatest comic book game of all time,\" and the \"best superhero game of modern times.\" It won several awards, including Best Action Adventure game, Best Game, and Game of the Year from various media outlets, and it held the Guinness World Record for \"Most Critically Acclaimed Superhero Game Ever\". It has been cited as one of the greatest video games of all time. The game received several re-releases, including a Game of the Year edition in March 2010, a Mac OS X version in November 2011, and a remastered version for PlayStation 4 and Xbox One in October 2016. Arkham Asylum's success launched the Batman: Arkham series, comprising video game sequels and spin-offs, comic books, merchandise, and movies, beginning in October 2011 with its direct sequel Arkham City.", "developer": ["Rocksteady Studios"], "genre": "Action", "date_release": "2009-09-15"}, "Batman: Arkham City": {"producer": [null, null], "composer": null, "description": "Batman: Arkham City is a 2011 action-adventure video game developed by Rocksteady Studios and published by Warner Bros. Interactive Entertainment. Based on the DC Comics superhero Batman, it is the sequel to the 2009 video game Batman: Arkham Asylum and the second installment in the Batman: Arkham series. Written by veteran Batman writer Paul Dini with Paul Crocker and Sefton Hill, Arkham City was inspired by the long-running comic book mythos. In the game's main storyline, Batman is incarcerated in Arkham City, a super-prison enclosing the decaying urban slums of fictional Gotham City. He must uncover the secret behind a sinister scheme orchestrated by the facility's warden, Hugo Strange. The game's leading characters are predominantly voiced by actors from the DC Animated Universe, with Kevin Conroy and Mark Hamill reprising their roles as Batman and the Joker, respectively.\nThe game is presented from the third-person perspective with a primary focus on Batman's combat and stealth abilities, detective skills, and gadgets that can be used in both combat and exploration. Batman can freely move around the Arkham City prison, interacting with characters and undertaking missions, and unlocking new areas by progressing through the main story or obtaining new equipment. The player is able to complete side missions away from the main story to unlock additional content and collectible items. Arkham City gives Batman the new ability to glide using his cape, enabling him to cover greater distances than were possible in Arkham Asylum. Batman's ally Catwoman is another playable character, featuring her own story campaign that runs parallel to the game's main plot.\nRocksteady conceived ideas for a sequel while developing Arkham Asylum, commencing serious development of Arkham City's story in February 2009. The layout of Arkham City has a virtual footprint five times that of Arkham Asylum, and the city design was modified to accommodate Batman's ability to swoop and glide. Over a year and $10 million were spent on the game's marketing campaign, and its release was accompanied by two music albums; one containing the game's score, and the other featuring 11 original songs inspired by the game from various mainstream artists.\nArkham City was released worldwide for the PlayStation 3 and Xbox 360 video game consoles, beginning in North America on October 18, 2011, with a Microsoft Windows version following on November 22. The game received critical acclaim, particularly for its narrative, character and world designs, soundtrack, and Batman's combat and navigation abilities. It was tied for the highest-rated video game of 2011 according to review aggregator Metacritic, and was the recipient of several awards from media outlets, including Game of the Year, Best Action Game, Best Action Adventure Game, Best Adventure Game, and Best Original Score. It is considered one of the greatest video games of all time. A spin-off mobile game, Batman: Arkham City Lockdown was released in December. Arkham City received several re-releases, comprising: a Game of the Year edition containing all of the game's downloadable content in May 2012; Wii U and OS X versions in November and December 2012, respectively; and a remastered version for PlayStation 4 and Xbox One in October 2016. A successor, Batman: Arkham Origins, was released in October 2013, and a narrative sequel, Batman: Arkham Knight, was released in June 2015.", "developer": ["Rocksteady Studios"], "genre": "Action", "date_release": "2011-10-18"}, "Batman: Arkham Knight": {"producer": [null, null], "composer": null, "description": "Batman: Arkham Knight is a 2015 action-adventure video game developed by Rocksteady Studios and published by Warner Bros. Interactive Entertainment. Based on the DC Comics superhero Batman, it is the successor to the 2013 video game Batman: Arkham Origins, and the fourth main installment in the Batman: Arkham series. Written by Sefton Hill, Ian Ball and Martin Lancaster, Arkham Knight is inspired by the long-running comic book mythos. Set one year after the events of 2011's Batman: Arkham City, the game's main storyline follows Batman as he confronts Scarecrow, who has launched an attack on Gotham City, causing a citywide evacuation. Scarecrow, with the help of the mysterious Arkham Knight, is also able to unite Batman's greatest foes in an attempt to finally destroy Batman.\nThe game is presented from a third-person perspective, with a primary focus on Batman's melee combat, stealth abilities, detective skills, and gadgets. Batman can freely move around the open world of Gotham City, interacting with characters and undertaking missions, and unlocking new areas by progressing through the main story or obtaining new equipment. The player is able to complete side missions away from the main story to unlock additional content and collectible items. Combat focuses on chaining attacks together against numerous foes while avoiding damage, while stealth allows Batman to conceal himself around an area, using gadgets and the environment to silently eliminate enemies. Arkham Knight introduces the Batmobile as a playable vehicle, which is used for transportation, puzzle solving and combat.\nDevelopment on Arkham Knight began in 2011 after completion of Arkham City and took place over four years. Rocksteady opted to use its own writers for the main story with collaboration by comic book writer Geoff Johns, choosing to replace Paul Dini who had worked on Arkham Asylum and Arkham City. The introduction of the Batmobile required a change in the team's design methodology, as the previous games' city designs were too narrow and confined to allow smooth travel for the vehicle.\nArkham Knight was released worldwide on June 23, 2015 for PlayStation 4, Xbox One and Microsoft Windows. The console versions of Arkham Knight received favorable reviews from critics, particularly for its narrative, visuals, gameplay, combat, and world designs, with most criticism given to the overuse of the Batmobile and the portrayal of the Arkham Knight. The Windows version was subject to significant criticism for technical and performance issues that rendered it unplayable for some users, prompting Warner Bros. to temporarily withdraw it from sale. At release, the game was the fastest selling game of 2015, and the fastest selling game in the Arkham series, reaching over 5 million units sold globally by October 2015. Post-release content was released for the game, including story-based missions, challenge maps, and skins for Batman and his allies, different historical Batmobile designs, and racetracks.", "developer": ["Rocksteady Studios"], "genre": "Action", "date_release": "2015-06-02"}, "Batman: Arkham Origins": {"producer": null, "composer": "Christopher Drake", "description": "Batman: Arkham Origins is a 2013 action-adventure game developed by WB Games Montréal and published by Warner Bros. Interactive Entertainment. Based on the DC Comics superhero Batman, it is the follow-up to the 2011 video game Batman: Arkham City and is the third main installment in the Batman: Arkham series. Written by Corey May, Ryan Galletta and Dooma Wendschuh, the game's main storyline is set five years before 2009's Batman: Arkham Asylum and follows a younger, less-refined Batman. A bounty is placed on him by crime lord Black Mask, drawing eight of the world's greatest assassins to Gotham City on Christmas Eve. The villains, including the Joker and Anarky, take advantage of the chaos to launch nefarious schemes, while Gotham City police try to apprehend Batman.\nThe game is played from a third-person perspective, focusing on Batman's combat and stealth abilities, detective skills, and gadgets for combat and exploration. Batman can freely move around the open world of Gotham City, interacting with characters and undertaking missions. Aside from the main story, Batman can help the police deal with crimes, and confront other supervillains terrorizing the city. Arkham Origins introduces the ability for Batman to virtually recreate crimes, allowing him to investigate the scene and identify the culprit. The game is also the first in the series with a multiplayer mode, in which players partake in a gang war between the Joker and Bane.\nDevelopment on Arkham Origins began in 2011. WB Games Montréal took over development duties from series creator Rocksteady Studios, which was preoccupied with Batman: Arkham Knight and thus would not have been able to release a new game for considerable time. The team chose to make the game a prequel to explore certain aspects of the Batman character, such as his vulnerability and lack of experience, that previous games could not; the story was inspired by the comics Batman: Legends of the Dark Knight and \"Batman: Year One\", and was developed with input from writer Geoff Johns. Development of the multiplayer mode was handled by the British studio Splash Damage, separately from the main game.\nArkham Origins was released worldwide on October 25, 2013 for the PlayStation 3, Xbox 360, Nintendo Wii U, and Windows. In contrast to the critical acclaim of its predecessors, Arkham Origins received mixed reviews; it was criticized for technical issues, replicating previous Arkham games' content and unnecessarily modifying it, while the multiplayer aspect was considered an unnecessary addition to the series. A companion game, Batman: Arkham Origins Blackgate, was released alongside Arkham Origins for the Nintendo 3DS and PlayStation Vita, and a spin-off mobile game for iOS and Android platforms was released in October 2013. An animated sequel, Batman: Assault on Arkham, was released in 2014, and a successor video game, Arkham Knight, was released in June 2015.", "developer": ["WB Games Montréal", "Splash Damage"], "genre": "Action", "date_release": "2013-10-25"}, "BattleBlock Theater": {"description": "BattleBlock Theater is a comedy platform game developed by The Behemoth and published by Microsoft Studios for Xbox 360, Windows, Mac, and Linux. It is the third title from The Behemoth following Alien Hominid and Castle Crashers. The game was released on Xbox Live Arcade on April 3, 2013, and later temporarily made free via Games with Gold on July 16, 2014.", "developer": ["The Behemoth"], "genre": "Platformer", "date_release": "2014-05-15"}, "Battlefield 1942": {"producer": "Lars Gustavsson", "composer": "Joel Eriksson", "description": "Battlefield 1942 is a first-person shooter video game developed by Digital Illusions Creative Entertainment and published by Electronic Arts for Microsoft Windows and Mac OS X. The game can be played in single-player mode against the video game AI or in multiplayer mode against players on the Internet or in a local area network. It is a popular platform for mod developers, with many released modifications that alter the gameplay and theme.\nIn-game, players assume the role of one of five classes of infantry: Scout, Assault, Anti-Tank, Medic, and Engineer. Players also have the ability to fly various World War II fighter aircraft and bombers, navigate capital ships, submarines, and aircraft carriers, man coastal artillery defenses, drive tanks, APCs and jeeps, and take control of anti-aircraft guns and mounted machine guns.Each battle takes place on one of several maps located in a variety of places and famous battlefields in all of the major theaters of World War II: the Pacific, European, North African, Eastern, and Italian Fronts. Combat is between the Axis Powers and the Allies. The location determines which nation-specific armies are used (for example, on the Wake Island map, it is Japan versus the United States, while on the El Alamein map, it is Germany versus the United Kingdom). The maps in Battlefield 1942 are based on real battles and are somewhat realistically portrayed.", "developer": ["Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2002-09-10"}, "Battlefield 1942: The Road to Rome": {"description": "Battlefield: 1942: The Road to Rome is an expansion pack for the Battlefield 1942 video game. It was released in February 2003 by Electronic Arts and developed by Digital Illusions CE. Six maps featuring battles that took place in Italy were added (such as Operation Husky and the Battle of Anzio), along with eight vehicles, including the German Bf 110 and the British Mosquito fighter-bombers and the M3 Grant medium tank. French and Italian forces are included. Engineers can mount a bayonet on their rifle for hand-to-hand combat. The Italian Breda 30 and the British Sten SMG have been added. Extra scenes are added to the original Battlefield 1942 intro.", "developer": ["Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2003-02-02"}, "Battlefield 1942: Secret Weapons of WWII": {"description": "Battlefield 1942: Secret Weapons of WWII is the second of two expansions to the World War II first-person shooter computer game Battlefield 1942. It was released for Microsoft Windows on 4 September 2003 in North America and 5 September 2003 in Europe. It was also released for Mac OS X on 25 October 2004.Secret Weapons of WWII brings many new features to the original game, such as new weapons, vehicles, battles, factions, and a new gameplay mode that focuses on fulfilling objectives more than destroying the enemy army. These new features help to bring variety to its predecessor's gameplay without overhauling the series. For example, while an Allied engineer may still maintain his original role as being able to repair vehicles, his long-ranged rifle has been replaced with a shotgun, which is effective at short distances.", "developer": ["Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2003-09-04"}, "Battlefield 2": {"description": "Battlefield 2 is a 2005 first-person shooter military simulator video game, developed by Digital Illusions CE and published by Electronic Arts exclusively for Microsoft Windows as the third game in the Battlefield series.Players fight in a modern battlefield, using modern weapon systems. Battlefield 2 is a first-person shooter with some strategy and Tactical Shooter elements.The single-player aspect features missions that involve clashes between U.S. Marines, China and the fictional Middle Eastern Coalition. The multiplayer aspect of the game allows players to organize into squads that come under the leadership of a single commander to promote teamwork. The story takes place in the early 21st century during a fictional world war between various power blocs: China, the European Union, the fictional Middle Eastern Coalition (MEC), Russia and the United States. The game takes place in different fronts, as the Middle East and China are being invaded by US and EU forces, and the United States is being invaded by Chinese and MEC forces. A sequel, Battlefield 3, was released in October 2011. On June 30, 2014, the multiplayer master server was shut down alongside other GameSpy-powered titles.", "developer": ["Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2005-06-21"}, "Battlefield 2142": {"composer": "Gregor Narholz", "description": "Battlefield 2142 is a 2006 first-person shooter video game developed by EA DICE and published by Electronic Arts. It is the fourth game in the Battlefield series. Battlefield 2142 is set in 2142, during a new ice age, depicting a war known as \"The Cold War of the 22nd Century\", in which two military superpowers – the European Union (EU) and Pan Asian Coalition (PAC) – battle for the remaining unfrozen land during a new Ice Age.The game was designed primarily for multiplayer gameplay and allows for a maximum of 64 players on a server or a maximum of 16 players in single player mode against bots on Conquest mode. It has its own ranking system to keep track of the user's statistics similar to the one used in its predecessor, Battlefield 2. It opens up new categories of vehicles and weapons not seen in Battlefield 2. Battlefield 2142 has an unlock system that allows the player to choose a new unlock every time they achieve a new rank instead of forcing the player to purchase items. A booster pack called Northern Strike contains new maps, unlocks, and vehicles; a deluxe edition was released that contains Battlefield 2142 and Northern Strike.\nAs of July 2014, all official online components of the game have been deactivated following the shutdown of GameSpy.", "developer": ["EA Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2006-10-17"}, "Battlefield 3": {"producer": null, "composer": null, "description": "Battlefield 3 is a first-person shooter video game developed by EA DICE and published by Electronic Arts. It is a direct sequel to 2005's Battlefield 2, and the eleventh installment in the Battlefield franchise. The game was released in North America on 25 October 2011 and in Europe on 28 October 2011 for Microsoft Windows, PlayStation 3, and Xbox 360.In Battlefield 3's campaign, players take on the personas of several military roles: a U.S. Marine, an F/A-18F Super Hornet weapon systems officer, an M1A2 Abrams tank operator, and a Spetsnaz GRU operative. The campaign takes place in various locations and follows the stories of two characters, Henry Blackburn and Dimitri Mayakovsky.\nThe game sold 5 million copies in its first week of release, and received positive reviews from most game reviewers. The game's sequel, Battlefield 4, was released in 2013.", "developer": ["EA Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2011-10-25"}, "Battlefield 4": {"producer": null, "composer": null, "description": "Battlefield 4 is a first-person shooter video game developed by video game developer EA DICE and published by Electronic Arts. It is a sequel to 2011's Battlefield 3 and was released in October 2013 for Microsoft Windows, PlayStation 3, and Xbox 360; then later in November for PlayStation 4 and Xbox One.\nBattlefield 4 was met with positive reception. It was praised for its multiplayer mode, gameplay and graphics, but was also criticized for its short and shallow single-player campaign mode, and for its numerous bugs and glitches. It was a commercial success, selling over 7 million copies.", "developer": ["EA Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2013-10-29"}, "Battlefield Heroes": {"description": "Battlefield Heroes was a 2009 third-person shooter video game developed by EA DICE initially and further developed by Easy Studios, published by Electronic Arts for Microsoft Windows. Battlefield Heroes was less demanding on computer specifications than the previous games of the series to increase the audience base. In addition, the game matched players of similar levels together for fairer play.Heroes was the first Battlefield game to be made under Electronic Arts' new \"Play 4 Free\" model, which saw the game released for free with revenue generated from advertising and micropayments. Advertisements appeared on the website and the 'front-end' of the game although none appeared while playing, while micropayments were able to be made for additional items to customize the appearance of players' avatars or to buy stronger weapons. Furthermore, purchasable Play 4 Free Funds (formerly known as Battlefunds) were usable for redeeming rate boosts to experience points along with other items.\nBattlefield Heroes, along with other EA free-to-play titles Battlefield Play4Free, Need for Speed: World, and FIFA World, went offline on 14 July 2015.", "developer": ["EA Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2009-06-25"}, "Battlefield Play4Free": {"description": "Battlefield Play4Free was a first-person shooter video game developed by EA DICE and Easy Studios and published by Electronic Arts. Based on the Battlefield series, the game featured a modern warfare battlefield setting. Play4Free is built on a modified version of Battlefield 2's game engine, with improvements such as high resolution artwork and post-processing effects. The game was also less demanding on computer specifications, similar to Battlefield Heroes.The game was available to players for free online, under Electronic Arts' free-to-play  model called Play4Free. Play4Free uses a similar micropayment store system similar to that in Battlefield Heroes. Battlefield Play4Free was announced on 5 November 2010. The game's open beta testing phase began on 4 April. Closed beta codes originally started being distributed via email on 30 November 2010. The game was released as an open beta on 4 April 2011. Battlefield Play4Free, along with other EA free-to-play titles Battlefield Heroes, Need for Speed: World, and FIFA World, went offline on 14 July 2015.", "developer": ["EA Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2011-04-04"}, "Battlefield V": {"producer": [null, null, null, null, null], "composer": null, "description": "Battlefield V is a first-person shooter video game developed by EA DICE and published by Electronic Arts. Battlefield V is the sixteenth installment in the Battlefield series. It was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on November 20, 2018. Those who pre-ordered the Deluxe Edition of the game were granted early access to the game on November 15, 2018, and Origin Access Premium subscribers on PC received access to the game on November 9, 2018. The game is based on World War II and is a thematic continuation of its World War I based precursor Battlefield 1.\nPre-release reception of the game was mixed, with the announcement trailer causing backlash from fans of the series for the degree of historical inaccuracy and the inclusion of female soldiers. Upon release, Battlefield V received generally favourable reviews from critics, being praised for its gameplay but criticized for its shortage of content at launch and lack of innovation. The game sold 7.3 million copies by the end of 2018 but was a commercial disappointment for Electronic Arts.", "developer": ["EA Digital Illusions CE"], "genre": "First-person shooter", "date_release": "2018-10-19"}, "Battleforge": {"description": "BattleForge is a discontinued video game that was developed by EA Phenomic and published by Electronic Arts in 2009. BattleForge is an online card-based real-time strategy (RTS) game. The game's servers were shut down on October 31, 2013.", "developer": ["EA Phenomic"], "genre": "RTS", "date_release": "2009-03-23"}, "Battleground 2: Gettysburg": {"description": "Battleground 2: Gettysburg is a turn-based computer wargame developed by TalonSoft in 1995, and the second game in the Battleground series.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1995-12-31"}, "Battleground 3: Waterloo": {"description": "Battleground 3: Waterloo is the third game in the Battleground series. It was developed and published by TalonSoft and released on May 31, 1996.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1996-05-31"}, "Battleground 4: Shiloh": {"description": "Battleground 4: Shiloh is a turn-based computer wargame developed by TalonSoft in 1996, the fourth issue in the Battleground series.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1996-01-31"}, "Battleground 5: Antietam": {"description": "Battleground is a series of turn-based computer wargames developed and published by TalonSoft for Microsoft Windows between January 1996 and 1999. Nine games were released in the series, each based on a different historical battle.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1996-12-31"}, "Battleground 6: Napoleon in Russia": {"description": "Battleground is a series of turn-based computer wargames developed and published by TalonSoft for Microsoft Windows between January 1996 and 1999. Nine games were released in the series, each based on a different historical battle.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1997-03-30"}, "Battleground 7: Bull Run": {"description": "Battleground is a series of turn-based computer wargames developed and published by TalonSoft for Microsoft Windows between January 1996 and 1999. Nine games were released in the series, each based on a different historical battle.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1997-03-30"}, "Battleground 8: Prelude to Waterloo": {"description": "Battleground is a series of turn-based computer wargames developed and published by TalonSoft for Microsoft Windows between January 1996 and 1999. Nine games were released in the series, each based on a different historical battle.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1997-01-01"}, "Battleground 9: Chickamauga": {"description": "Battleground is a series of turn-based computer wargames developed and published by TalonSoft for Microsoft Windows between January 1996 and 1999. Nine games were released in the series, each based on a different historical battle.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1998-01-01"}, "Battleground 10: Middle East": {"description": "The following page is an alphabetical section from the list of PC games.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1997-01-01"}, "Battleground 11: East Front": {"description": "The following page is an alphabetical section from the list of PC games.", "developer": ["TalonSoft"], "genre": "Turn-based strategy", "date_release": "1997-01-01"}, "Battlehawks 1942": {"producer": "Noah Falstein", "description": "Battlehawks 1942 is a naval air combat flight simulation video game released in 1988 by LucasFilm Games. It is set in the World War II Pacific air war theatre, and was the first of Lucasfilm Games' trilogy of World War II flight simulations, followed by Their Finest Hour (1989) and Secret Weapons of the Luftwaffe (1991). The 127-page manual for Battlehawks 1942 includes a 100-page illustrated overview of the Pacific War.", "developer": ["Lucasfilm Games"], "genre": "Flight simulation", "date_release": "1988-10-01"}, "Battles in Time": {"description": "Battles in Time was a PC video game and was the only product co-developed by Quantum Quality Productions and American Laser Games. The game was a time travel-based strategy game.\nIn the far future, humans no longer needed war. When aliens decide to invade the planet, a test is made up to provide commanders for the army. Four time periods are used: 2025, World War II, the Roman Empire, and prehistoric times. Succeeding in these four missions will allow the human to take on the alien threat.\n\n", "developer": ["Quantum Quality Productions", "American Laser Games"], "genre": "Strategy", "date_release": "1995-01-01"}, "Battles of Napoleon": {"description": "Battles of Napoleon is a 1988 computer wargame by Chuck Kroegel and David Landrey published by Strategic Simulations. It was released for the Apple II, Commodore 64, and MS-DOS.", "developer": ["Chuck Kroegel"], "genre": "Wargame", "date_release": "1988-01-01"}, "Battleship: Surface Thunder": {"composer": "Jeff van Dyck", "description": "Battleship: Surface Thunder is a PC video game by Hasbro Interactive. It was released in the United States on September 12, 2000. The game is split into two modes, one being the regular classic battleship, and the other being a new arcade version which expands on the classic game in the form of a mission-based third-person shooter.", "developer": ["Hasbro Interactive"], "genre": "Action", "date_release": "2000-09-12"}, "Beam Breakers": {"description": "Beam Breakers is a racing game released in 2002. It was published by JoWooD Productions and developed by Similis. The game takes place in the year 2173. It features flying cars in the city of New York.", "genre": "Futuristic", "date_release": "2002-10-31"}, "Beasts and Bumpkins": {"composer": "James Hannigan", "description": "Beasts and Bumpkins is a single player real-time strategy video game.  It was developed by Worldweaver Ltd and published by Electronic Arts in 1997 and is available for the Windows platform.\nIn the game's storyline, the player was exiled by the king. They begin with limited resources and a few peasants to control. After building an empire and increasing their resources, the player can challenge Dark Lord Sabellian, who attacks the surrounding area.", "developer": ["Worldweaver Ltd"], "genre": "Real-time simulation", "date_release": "1997-01-01"}, "Beyond Divinity": {"composer": "Kirill Pokrovsky", "description": "Beyond Divinity is a role-playing video game from Larian Studios, a sequel to Divine Divinity that was released in 2004.\nA Deluxe Edition was also released that same year, containing copies of both Beyond Divinity and Divine Divinity. In 2009 a digital download version was released, equivalent to the updated disc version. The game was released for Mac OS X on November 15, 2013.", "developer": ["Larian Studios"], "genre": "RPG", "date_release": "2004-01-01"}, "Billy the Wizard: Rocket Broomstick Racing": {"description": "Billy the Wizard: Rocket Broomstick Racing is a racing and platform game by developer and publisher Data Design Interactive. It was originally released for the PlayStation 2 and Microsoft Windows, while the Wii version was released later.The game was originally announced under the title \"Barry Hatter: The Sorcerer's Broomstick\", but this later changed to \"Billy the Wizard\".", "genre": "Racing", "date_release": "2006-01-27"}, "BioShock": {"composer": "Garry Schyman", "description": "BioShock is a first-person shooter video game developed by 2K Boston (later Irrational Games) and 2K Australia, and published by 2K Games. The first game in the Bioshock series, it was released for Microsoft Windows and Xbox 360 platforms in August 2007; a PlayStation 3 port by Irrational, 2K Marin, 2K Australia and Digital Extremes was released in October 2008, and an OS X port by Feral Interactive in October 2009. A scaled-down mobile version was developed by IG Fun, which contained the first few levels of the game.The game's concept was developed by Irrational's creative lead, Ken Levine, and incorporates ideas by 20th century dystopian and utopian thinkers such as Ayn Rand, George Orwell, and Aldous Huxley, as well as historical figures such as John D. Rockefeller and Walt Disney. The game is considered a spiritual successor to the System Shock series, on which many of Irrational's team, including Levine, had worked previously.BioShock is set in 1960. The player guides the protagonist, Jack, after his airplane crashes in the ocean near the bathysphere terminus that leads to the underwater city of Rapture. Built by the business magnate Andrew Ryan, the city was intended to be an isolated utopia, but the discovery of ADAM, a genetic material which can be used to grant superhuman powers, initiated the city's turbulent decline. Jack tries to find a way to escape, fighting through hordes of ADAM-obsessed enemies, and the iconic, deadly Big Daddies, while engaging with the few sane humans that remain and eventually learning of Rapture's past. The player, as Jack, can defeat foes in several ways by using weapons, utilizing plasmids that give unique powers, and by turning Rapture's defenses against them.\nBioShock includes elements of role-playing games, giving the player different approaches in engaging enemies such as by stealth, as well as moral choices of saving or killing characters. Additionally, the game and biopunk theme borrow concepts from the survival horror genre, notably the Resident Evil series.\nBioShock received critical acclaim and was particularly praised by critics for its morality-based storyline, immersive environments, and its unique setting. It is considered to be one of the greatest video games of all time and a demonstration of video game as an art form. It received several Game of the Year awards from different media outlets, including from BAFTA, Game Informer, Spike TV, and X-Play.Since its release a direct sequel has been released, BioShock 2 by 2K Marin, as well as a third game titled BioShock Infinite by Irrational Games. A remastered version of the original game was released on Microsoft Windows, PlayStation 4 and Xbox One on September 13, 2016, as part of BioShock: The Collection, along with BioShock 2 and Infinite. A standalone version of BioShock Remastered was released for macOS by Feral Interactive on August 22, 2017.", "developer": ["2K Boston", "2K Australia"], "genre": "First-person shooter", "date_release": "2007-08-21"}, "BioShock 2": {"producer": "Melissa Miller", "composer": "Garry Schyman", "description": "BioShock 2 is a first-person shooter video game developed by 2K Marin and published by 2K Games. A part of the Bioshock series, it is the sequel to the 2007 video game BioShock and was released worldwide for Microsoft Windows, the PlayStation 3, and the Xbox 360 on February 9, 2010. Feral Interactive released an OS X version of the game on March 30, 2012. Set in the fictional underwater dystopian city of Rapture, the game's story takes place eight years after BioShock. Assuming control of Subject Delta, a hulking Big Daddy, players are tasked with fighting through \"splicers\", the psychotic human population of the city, using weapons and an array of genetic modifications. The game also introduces a story-driven multiplayer mode called Fall of Rapture, which takes place during Rapture's 1959 civil war, before the events of the first game.\nBioShock 2 was chiefly developed by 2K Marin, with 2K Australia, Arkane Studios, and Digital Extremes providing additional support. 2K Boston, formerly Irrational Games, also assisted the game's development, with series creator Ken Levine providing input. The story received major changes over the course of development. Garry Schyman, the composer of the first game, returned to create the score for BioShock 2.\nThe game received positive reviews upon release, with praise directed at the game's narrative, art style, characters, ending and gameplay. However, the game attracted criticism for having a slow start and being too similar to its predecessor. The game was supported with downloadable content upon launch, and a new single-player campaign, titled Minerva's Den, was released in August 2010. The game sold more than 3 million copies, but did not meet Take-Two Interactive's sales expectations. A remastered version of the game was released in 2016, as part of BioShock: The Collection.", "developer": ["2K Marin"], "genre": "First-person shooter", "date_release": "2010-02-09"}, "BioShock Infinite": {"producer": "Adrian Murphy", "composer": "Garry Schyman", "description": "BioShock Infinite is a first-person shooter video game developed by Irrational Games and published by 2K Games. It was released worldwide for the Microsoft Windows, PlayStation 3, Xbox 360, and OS X platforms in 2013, and a Linux port was released in 2015. Infinite is the third installment in the BioShock series, and though it is not immediately part of the storyline of previous BioShock games, it features similar gameplay concepts and themes. Irrational Games and creative director Ken Levine based the game's setting on historical events at the turn of the 20th century, such as the 1893 World's Columbian Exposition, and based the story on the concept of American exceptionalism, while also incorporating influences from more recent events at the time such as the 2011 Occupy movement.\nThe game is set in the year 1912 and follows its protagonist, former Pinkerton agent Booker DeWitt, who is sent to the airborne city of Columbia to find a young woman, Elizabeth, who has been held captive there for most of her life. Though Booker rescues Elizabeth, the two become involved with the city's warring factions: the nativist and elite Founders that rule Columbia and strive to keep its privileges for White Americans, and the Vox Populi, underground rebels representing the underclass of the city. During this conflict, Booker learns that Elizabeth possesses strange powers to manipulate \"Tears\" in the space-time continuum that ravage Columbia, and soon discovers her to be central to the city's dark secrets.\nThe player controls Booker Dewitt throughout the game, eventually working with the AI-controlled Elizabeth. Like previous BioShock games, the player uses a combination of weapons, clothing called Gear that offer unique attributes, and psychokinetic powers granted through Vigors. Elizabeth's powers can also be used to help fight hostile forces. In contrast to the limited spaces of the underwater city of Rapture, the openness of Columbia provides for more dynamic combat, including combat that takes place aboard the city's Sky-Line rollercoaster-like rail system. Downloadable content for the game includes a story-based mission, Burial at Sea, that links Infinite's story to that of the original BioShock game.\nThe game won over 85 pre-release awards for its display at E3 2011, including Best of Show from the Game Critics Awards. At release, BioShock Infinite received critical acclaim, with praise particularly directed at its story, setting, and visual art design, and is often regarded as one of the best video games of the seventh generation of consoles. According to review aggregator Metacritic, it was the third-highest rated video game of 2013. Within two months of release, it sold over 3.7 million retail copies, and has since sold more than 11 million copies overall. It won year-end accolades, including Game of the Year from several gaming publications. It was re-released on PlayStation 4 and Xbox One on September 13, 2016, as part of BioShock: The Collection, alongside its remastered predecessors.", "developer": ["Irrational Games"], "genre": "First-person shooter", "date_release": "2013-03-26"}, "Black Mesa": {"composer": "Joel Nielsen", "description": "Black Mesa (stylized as BLλCK MESA, formerly known as Black Mesa: Source) is a first-person shooter video game, developed and published by Crowbar Collective. It is a third-party remake of Half-Life (1998), and was originally released as a free modification for Half-Life 2 on September 14, 2012. It received a standalone commercial release through Steam Early Access on May 5, 2015.\nThe gameplay of Black Mesa is reminiscent to that of the original game: the player controls Gordon Freeman, a scientist at the titular research facility in New Mexico, as he navigates through the complex after a botched experiment, with nearly uninterrupted control of the character. The main differences include: an entirely reskinned collection of textures, models, and NPCs; a noticeably longer runtime; and additional dialogue and story elements. The initial release excluded the \"Xen\" chapters from the original game. A staggered release is used for the Xen chapters, with the public beta release of the final chapters being planned for Q3 2019.The project was initially announced in 2005, shortly after the release of the Source engine port of the original game. Over the course of its nearly decade long development cycle, the game has been overhauled several times, including redesigns of several components and effects, as well as an added multiplayer mode. It has been featured in several video game publications, including direct attention from Valve Corporation themselves. Due to its long development time, the modification became notable for its delays and dwindling updates on the status of its completion.\nBlack Mesa received highly positive reviews from critics upon its initial release, despite not being in a complete state. Praise was directed towards the gameplay and attention to detail, comparing it to that of an official Valve release. Due to its several delays, Wired included the game on their \"Vaporware of the Year\" lists in 2009 and 2010.", "genre": "First-person shooter", "date_release": "2015-05-05"}, "Blade Strangers": {"producer": "Tyrone Rodriguez", "composer": "Ridiculon", "description": "Blade Strangers is a 2D crossover fighting game developed by Studio Saizensen and published by Nicalis, released on PlayStation 4, Nintendo Switch and Microsoft Windows via Steam in August 2018, as well as a Japanese arcade release. It features one-on-one combat between several characters from various independent video game franchises.", "genre": "Fighting", "date_release": "2018-08-28"}, "Blade Symphony": {"description": "Blade Symphony is a multiplayer action video game developed by American indie studio Puny Human for Microsoft Windows. The game focuses on sword-based duelling, it is reminiscent of and inspired by Jedi Knight II: Jedi Outcast. Following a Steam Early Access release in April 2013, the game was officially released in May 2014.", "genre": "Action", "date_release": "2014-05-07"}, "Blades of Time": {"producer": "Takayuki Fujii", "description": "Blades of Time (ブレイズ オブ タイム, Bureizu obu Taimu) is an action-adventure hack-and-slash video game developed by Gaijin Entertainment and published by Konami and Iceberg Interactive for Microsoft Windows, PlayStation 3, Xbox 360 and Mac OS X.  The game is a sequel to Gaijin Entertainment's past work, X-Blades. Blades of Time was released in North America on March 6, 2012, in Japan and Australia on March 8, 2012, and in Europe on March 16, 2012. The Windows and OS X versions were announced at a later date, originally for April 18, before the release date was pushed back to April 20, 2012. Nintendo Switch version was released in Europe and North America on May 14, 2019. In the English version, the lead character is voiced by Miranda Raison.", "developer": ["Gaijin Entertainment"], "genre": "Hack and slash", "date_release": "2012-01-01"}, "Blitzkrieg": {"description": "Blitzkrieg  (German pronunciation: [ˈblɪtskʁiːk] (listen), from Blitz [\"lightning\"] + Krieg [\"war\"]) is a method of warfare whereby an attacking force, spearheaded by a dense concentration of armoured and motorised or mechanised infantry formations with close air support, breaks through the opponent's line of defence by short, fast, powerful attacks and then dislocates the defenders, using speed and surprise to encircle them with the help of air superiority. Through the employment of combined arms in manoeuvre warfare, blitzkrieg attempts to unbalance the enemy by making it difficult for it to respond to the continuously changing front, then defeat it in a decisive  Vernichtungsschlacht (battle of annihilation).During the interwar period, aircraft and tank technologies matured and were combined with systematic application of the traditional German tactic of Bewegungskrieg (maneuver warfare), deep penetrations and the bypassing of enemy strong points to encircle and destroy enemy forces in a Kesselschlacht (cauldron battle). During the Invasion of Poland, Western journalists adopted the term blitzkrieg to describe this form of armoured warfare. The term had appeared in 1935, in a German military periodical Deutsche Wehr (German Defence), in connection to quick or lightning warfare. German manoeuvre operations were successful in the campaigns of 1939–1941 and by 1940 the term blitzkrieg was extensively used in Western media. Blitzkrieg operations capitalized on surprise penetrations (e.g., the penetration of the Ardennes forest region), general enemy unreadiness and their inability to match the pace of the German attack. During the Battle of France, the French made attempts to re-form defensive lines along rivers but were frustrated when German forces arrived first and pressed on.Despite being common in German and English-language journalism during World War II, the word Blitzkrieg was never used by the Wehrmacht as an official military term, except for propaganda. According to David Reynolds, \"Hitler himself called the term Blitzkrieg 'A completely idiotic word' (ein ganz blödsinniges Wort)\". Some senior officers, including Kurt Student, Franz Halder and Johann Adolf von Kielmansegg, even disputed the idea that it was a military concept. Kielmansegg asserted that what many regarded as blitzkrieg was nothing more than \"ad hoc solutions that simply popped out of the prevailing situation\". Student described it as ideas that \"naturally emerged from the existing circumstances\" as a response to operational challenges. The Wehrmacht never officially adopted it as a concept or doctrine.In 2005, the historian Karl-Heinz Frieser summarized blitzkrieg as the result of German commanders using the latest technology in the most beneficial way according to traditional military principles and employing \"the right units in the right place at the right time\". Modern historians now understand blitzkrieg as the combination of the traditional German military principles, methods and doctrines of the 19th century with the military technology of the interwar period. Modern historians use the term casually as a generic description for the style of manoeuvre warfare practised by Germany during the early part of World War II, rather than as an explanation. According to Frieser, in the context of the thinking of Heinz Guderian on mobile combined arms formations, blitzkrieg can be used as a synonym for modern manoeuvre warfare on the operational level.", "developer": ["Nival Interactive"], "genre": "Real-time tactics", "date_release": "2003-06-04"}, "Borderlands": {"producer": [null, null], "composer": null, "description": "Borderlands 3 is an action role-playing first-person shooter video game developed by Gearbox Software and published by 2K Games. It is the sequel to 2012's Borderlands 2, and the fourth main entry in the Borderlands series. Borderlands 3 was released on 13 September 2019 for Microsoft Windows, PlayStation 4, and Xbox One. A Google Stadia port has been confirmed for a later release date.\nPlayers complete quests and side missions, in single-player or multiplayer, as one of four classes. When killed, enemies may drop weapons and gear which can be equipped. New abilities are unlocked as the player gains experience. Unlike previous games, the levels of Borderlands 3 take place on multiple planets. The plot is centered around stopping the cult-leading twins, Troy and Tyreen Calypso, from harnessing the power of the alien Vaults spread across the galaxy.", "developer": ["Gearbox Software"], "genre": "Action role-playing", "date_release": "2009-10-20"}, "Borderlands 2": {"producer": [null, null], "composer": null, "description": "Borderlands 2 is an action role-playing first-person shooter video game developed by Gearbox Software and published by 2K Games. It is the second game in the Borderlands series and the sequel to 2009's Borderlands. The game was released for Microsoft Windows, PlayStation 3, Xbox 360, and OS X on September 18, 2012. It was ported to the PlayStation Vita on May 13, 2014, and released for Linux on September 30, 2014.Borderlands 2 allows players to complete a campaign consisting of central quests and optional side-missions as one of four (six including downloadable content) treasure seekers, \"Vault Hunters\", on the planet Pandora. The game's story centers around the Vault Hunters on their quest to find a new alien vault and liberate Pandora from the tyrannical Handsome Jack. Key gameplay features from its predecessor, such as online collaborative campaign gameplay, randomly generated loot, such as weapons and shields and character-building elements commonly found in role-playing video games are in Borderlands 2.\nThe game received critical acclaim and was a commercial  success. Downloadable content for the game was released, including new characters and storylines. The Game of the Year Edition of the game was released on October 8, 2013 in the U.S. and October 11 internationally, including all the previous downloadable and upgrade packs except for the new campaign. A PlayStation Vita version was released in May 2014, and was developed by Iron Galaxy Studios in collaboration with Gearbox. PlayStation 4 and Xbox One ports of Borderlands 2 and its DLC were released as part of Borderlands: The Handsome Collection on March 24, 2015. Borderlands 2 had sold over 13 million copies, making it 2K's highest-selling title. A prequel titled Borderlands: The Pre-Sequel was released in October 2014, and a sequel titled Borderlands 3 was released in September 2019.", "developer": ["Gearbox Software", "Iron Galaxy Studios"], "genre": "Action role-playing", "date_release": "2012-09-18"}, "Borderlands 3": {"composer": null, "description": "Borderlands 3 is an action role-playing first-person shooter video game developed by Gearbox Software and published by 2K Games. It is the sequel to 2012's Borderlands 2, and the fourth main entry in the Borderlands series. Borderlands 3 was released on 13 September 2019 for Microsoft Windows, PlayStation 4, and Xbox One. A Google Stadia port has been confirmed for a later release date.\nPlayers complete quests and side missions, in single-player or multiplayer, as one of four classes. When killed, enemies may drop weapons and gear which can be equipped. New abilities are unlocked as the player gains experience. Unlike previous games, the levels of Borderlands 3 take place on multiple planets. The plot is centered around stopping the cult-leading twins, Troy and Tyreen Calypso, from harnessing the power of the alien Vaults spread across the galaxy.", "developer": ["Gearbox Software"], "genre": "Action role-playing", "date_release": "2019-09-13"}, "Borderlands: The Pre-Sequel!": {"composer": null, "description": "Borderlands: The Pre-Sequel is an action role-playing first-person shooter video game developed by 2K Australia, with assistance from Gearbox Software and published by 2K Games. It is the third game in the Borderlands series, and is set after 2009's Borderlands and before 2012's Borderlands 2. It was released for Microsoft Windows, OS X, Linux, PlayStation 3 and Xbox 360 on 14 October 2014. PlayStation 4 and Xbox One ports were released as part of Borderlands: The Handsome Collection on 24 March 2015.\nThe storyline of The Pre-Sequel focuses on Jack, an employee of the Hyperion corporation; after the company's Helios space station is captured by a military unit known as the Lost Legion, he leads a group of four Vault Hunters—all of whom were non-playable characters and bosses in previous Borderlands games—on an expedition to re-gain control of Helios, defeat the Lost Legion, and find the hidden vault on Pandora's moon Elpis. The game expands upon the engine and gameplay of Borderlands 2 and introduced gameplay mechanics, including low-gravity environments, freeze weapons, and oxygen tanks, which are used to navigate and perform ground slamming attacks.\nThe Pre-Sequel received positive reviews; while praised for its new gameplay features, character classes, and for maintaining the trademark humour and style of previous entries in the franchise with an additional Australian comedy flair, the game was criticized by some for having confusing level designs, and for not providing many significant deviations from the core mechanics and gameplay of Borderlands 2 to make the game more than simply a standalone \"expansion pack\" for it.", "developer": ["Gearbox Software", "2K Australia"], "genre": "Action role-playing", "date_release": "2014-10-14"}, "Braid": {"composer": null, "description": "A braid (also referred to as a plait) is a complex structure or pattern formed by interlacing three or more strands of flexible material such as textile yarns, wire, or hair.  The materials used have depended on the indigenous plants and animals available in the local area. Braids have been made for thousands of years, in many different cultures around the world, for a variety of uses. \nThe most simple and common version is a flat, solid, three-stranded structure. More complex patterns can be constructed from an arbitrary number of strands to create a wider range of structures (such as a fishtail braid, a five-stranded braid, rope braid, a French braid and a waterfall braid). The structure is usually long and narrow with each component strand functionally equivalent in zigzagging forward through the overlapping mass of the others. It can be compared with the process of weaving, which usually involves two separate perpendicular groups of strands (warp and weft).\nWhen the Industrial Revolution arrived, mechanized braiding equipment was invented to increase production. The braiding technique was used to make ropes with both natural and synthetic fibers as well as coaxial cables for radios using copper wire. In more recent times it has been used to create a covering for fuel pipes in jet aircraft and ships (first using glass fibre, then stainless steel and Kevlar). Hoses for domestic plumbing are often covered with stainless steel braid.", "developer": ["Number None"], "genre": "Puzzle", "date_release": "2009-04-10"}, "Bridge Project": {"description": "Bridge Builder is a puzzle video game series, created by indie developer Alex Austin. Bridge Builder is the first in the series, followed by four sequels in different versions. They were developed and published by Chronic Logic, the only exception being Bridge Project, which was developed by Invent4 Entertainment. Some of the games also feature secondary publishers.\nThe objective of each game is to construct a bridge which a train may cross over, given a limited budget and materials.", "genre": "Simulation", "date_release": "2013-03-28"}, "Brothers in Arms: Earned in Blood": {"producer": "Mike Wardwell", "composer": "David McGarry", "description": "Brothers in Arms: Earned in Blood is a first-person shooter video game developed by Gearbox Software and published by Ubisoft for Microsoft Windows, OS X, Xbox and PlayStation 2. It was ported to the Wii in 2008 as a part of the Brothers in Arms: Double Time compilation.\nEarned in Blood continues the Brothers In Arms saga as newly promoted Sergeant Joe \"Red\" Hartsock (Hartsock was the Corporal of Baker's Fire Team), who was part of the historic Normandy invasion in the previous game. Earned in Blood includes several new multiplayer missions, weapons, and vehicles, plus a new co-op skirmish mode. The AI of enemies has also been improved considerably in this game, while level designs are more open-ended than the original.", "developer": ["Gearbox Software"], "genre": "First-person shooter", "date_release": "2005-10-04"}, "Brothers in Arms: Hell's Highway": {"composer": null, "description": "Brothers in Arms: Hell's Highway is a 2008 first-person shooter video game developed by Gearbox Software and published by Ubisoft for PlayStation 3, Xbox 360 and Microsoft Windows. The game is the third installment in the Brothers in Arms series. Brothers in Arms: Hell's Highway follows the men of the 101st Airborne Division (502nd Parachute Infantry Regiment) in the later stages of World War II, during Operation Market Garden in the Netherlands, with the player returning to the role of Staff Sergeant Matt Baker (based on Harrison C. Summers) from the previous titles in the Brothers in Arms series.", "developer": ["Gearbox Software"], "genre": "First-person shooter", "date_release": "2008-09-23"}, "Brothers in Arms: Road to Hill 30": {"composer": "Stephen Harwood", "description": "Brothers in Arms: Road to Hill 30 is a first-person shooter video game developed by Gearbox Software and published by Ubisoft for PlayStation 2, Xbox, Microsoft Windows and OS X. It is the first game in the Brothers in Arms series. The game takes place during World War II and focuses on tactics. It was ported to the Wii in 2008, as part of the Brothers in Arms: Double Time compilation.\nBrothers in Arms: Road to Hill 30 was also used to recreate scenarios in a 2005 History Channel special, also titled Brothers in Arms.", "developer": ["Gearbox Software"], "genre": "First-person shooter", "date_release": "2005-02-15"}, "Burnout Paradise: The Ultimate Box": {"producer": null, "description": "Burnout Paradise is an open world racing video game developed by Criterion Games and published by Electronic Arts for PlayStation 3, Xbox 360 and Microsoft Windows. It was also released on the PlayStation Store and via Xbox Live Marketplace's Games on Demand. It was later added to the libraries of Greatest Hits and Platinum Hits titles and was made backward compatible with the Xbox One in November 2016. It is the first game in the Burnout series to be released on Microsoft Windows.\nParadise's gameplay is set in the fictional \"Paradise City\", an open world in which players can compete in several types of races.  Players can also compete online, which includes additional game modes, such as \"Cops and Robbers\".  Several free game updates introduce new features such as a time-of-day cycle and motorcycles.  The game also features paid downloadable content in the form of new cars and the fictional \"Big Surf Island\".\nThe game was very well received upon release, with aggregate score sites GameRankings reporting an average score of 88% and Metacritic reporting an average score of 88 out of 100. The game won several awards in 2008, with Spike TV, GameTrailers and GameSpot all awarding it Best Driving Game. Reviewers felt the game had an excellent sense of speed, and praised the open world gameplay, a first for the Burnout series.\nA remastered version titled Burnout Paradise Remastered, which includes all downloadable content (except the Time Savers Pack) and support for higher-resolution displays, was released on 16 March 2018 for PlayStation 4 and Xbox One, and on 21 August 2018 for Windows via EA's Origin platform. On 17 April 2019, Criterion announced via Twitter that online service for the original version of the game which ended in August of that same year.", "developer": ["Criterion Games"], "genre": "Racing", "date_release": "2009-02-03"}}