{"Game Dev Tycoon": {"composer": null, "description": "Game Dev Tycoon is a business simulation video game developed by Greenheart Games, which first released on 10 December 2012. In the game, the player creates and develops video games. Game Dev Tycoon was inspired by the iOS and Android game, Game Dev Story (by Kairosoft), and many critics find substantial similarities between the two games. Game Dev Tycoon was created by Greenheart Games, a company founded in July 2012 by brothers Patrick and Daniel Klug.", "developer": ["Greenheart Games"], "genre": "Casual", "date_release": "2012-12-10"}, "Garry's Mod": {"description": "Garry's Mod (commonly abbreviated as GMod) is a sandbox physics game developed by British Facepunch Studios and published by Valve Corporation. The game uses Source Engine's modified version of the Havok physics engine, allowing players to build contraptions that follow the laws of physics, allowing realistic simulations of structures. Garry's Mod was originally a mod, created by Garry Newman for Valve's Half-Life 2, but was later made into a standalone release on 29 November 2006 for Microsoft Windows. Later updates saw an OS X port added in 2010, and a Linux port in 2013.", "developer": ["Facepunch Studios"], "genre": "Nonlinear", "date_release": "2013-08-29"}, "Goat Simulator": {"description": "Goat Simulator is a third-person perspective action video game developed and published by Coffee Stain Studios. It was released for Microsoft Windows in April 2014, and ports for Linux and OS X were released in June 2014. Mobile versions for Android and iOS  were released in September 2014. Versions for the Xbox 360 and Xbox One were released in April 2015, and for PlayStation 3 and PlayStation 4 in August 2015; these ports were developed by Double Eleven. A Nintendo Switch version containing the base game and all previous DLC was released in January 2019.\nThe game has been compared by the developer to skateboarding games, but where the player controls a goat aimed at doing as much damage as possible around an open world map, without any other larger goals. The game, initially developed as a joke prototype from an internal game jam and shown in an early alpha state in YouTube videos, was met with excitement and attention, prompting the studio to build the game into a releasable state while still retaining various non-breaking bugs and glitches to maintain the game's entertainment value.\nThe game received mixed reviews; some reviewers praised the title for providing a humorous sandbox interface to experiment with, while others criticized the game's reliance on social media to popularize what was otherwise a simple and buggy product.", "developer": ["Coffee Stain Studios"], "genre": "Nonlinear", "date_release": "2014-04-01"}, "Gone Home": {"composer": "Chris Remo", "description": "Gone Home is a first-person exploration video game developed and published by The Fullbright Company. Gone Home was first released for Microsoft Windows, OS X, and Linux computers in August 2013, followed by console releases for the PlayStation 4 and Xbox One in January 2016, the Nintendo Switch in September 2018, and iOS in December 2018.\nSet in the year 1995, Gone Home puts the player in the role of a young woman returning from overseas to her rural Oregon family home to find her family currently absent and the house empty, leaving her to piece together recent events. She comes to learn that her younger sister had recently come out as a lesbian to her family, creating strife with their parents that led to the current state of the house. Atypical of most video games, Gone Home does not feature much interactivity, but instead has the player explore the house at their own pace and determine what has transpired by examining items, journals, and other items left around the various rooms. The Fullbright team, having had previously worked on BioShock 2: Minerva's Den, took concepts and ideas from that game to craft an exploration game to engage the player into uncovering the narration by non-linear progression in their searching of the house, while keeping the project manageable for their small team.\nGone Home was critically praised at release. Several outlets used the game as an example of video games as art, as its non-standard gameplay format demonstrates progression of the video game industry into more artistic forms. However, this also raised the question of whether Gone Home should be considered a game, and led to the derogatory term \"walking simulators\" to describe exploration games with little interactivity, though since then, the industry has come to embrace the term. Gone Home's characters and story were praised for addressing LGBT issues with which some players could identify.", "developer": ["The Fullbright Company"], "genre": "Adventure", "date_release": "2013-08-15"}, "Gothic": {"composer": "Kai Rosenkranz", "description": null, "developer": ["Piranha Bytes"], "genre": "Action role-playing", "date_release": "2001-04-15"}, "Gothic II": {"composer": "Kai Rosenkranz", "description": "Gothic II is a role-playing video game and the sequel to Gothic, by the German developer Piranha Bytes. It was first released on November 29, 2002 in Germany, and in North America almost one year later on October 28, 2003. The game was published by JoWooD Productions and Atari, Inc. \nGothic II was a commercial success in Germany, and became JoWood's biggest hit at the time of its release. By 2004, it had sold over 300,000 units when combined with its expansion pack, Night of the Raven. Sales of Gothic II alone ultimately surpassed 400,000 units by 2007, following its re-release as a budget title in Germany.", "developer": ["Piranha Bytes"], "genre": "Action role-playing", "date_release": "2002-11-29"}, "Gothic 3": {"composer": null, "description": "Gothic 3 is a fantasy-themed open world action role-playing game for Microsoft Windows from the German game developer Piranha Bytes. It is the sequel to Gothic II. Although widely available in English, the native release of the game is German. The North American release incorporates two patches that appeared after the initial UK edition.\nA Collector's Edition was also released containing bonus collectible material. JoWooD released a standalone expansion, entitled Gothic 3: Forsaken Gods, in November 2008.", "developer": ["Piranha Bytes"], "genre": "Action role-playing", "date_release": "2006-10-13"}, "Gothic 3: Forsaken Gods": {"description": "Forsaken Gods is a standalone expansion for Gothic 3. It was developed by Trine Games and published by JoWooD Productions.  The game was released in Europe and North America in 2008. An Enhanced Edition was released in 2011 developed by Mad Vulture Games.", "genre": "Action role-playing", "date_release": "2008-11-21"}, "Arcania: Gothic 4": {"producer": "BVT Games Fund III", "composer": "Dynamedion", "description": "Arcania: Gothic 4 is an action role-playing video game, part of the Gothic series, developed by Spellbound. It was published by JoWooD Entertainment in 2010.The game was released on October 12, 2010 for Microsoft Windows and Xbox 360. In 2013, Nordic Games released ArcaniA and its expansion, Arcania: Fall of Setarrif, as Arcania: The Complete Tale for PlayStation 3 and Xbox 360, followed by the PlayStation 4 version in May 2015.", "developer": ["Spellbound Entertainment"], "genre": "Action role-playing", "date_release": "2010-10-14"}, "Arcania: Fall of Setarrif": {"producer": "Daniel Miller", "composer": "Dynamedion", "description": "Arcania: Fall of Setarrif is the standalone expansion for Arcania: Gothic 4. It was released on October 25, 2011 after a long period of silence from both publishers and after being delayed indefinitely in March 2011.It was announced by Spellbound and JoWooD on December 9, 2010.", "developer": ["Spellbound Entertainment"], "genre": "Action role-playing", "date_release": "2011-10-25"}, "Grand Theft Auto": {"producer": "David Jones", "composer": null, "description": "Grand Theft Auto (GTA) is an action-adventure video game series created by David Jones and Mike Dailly; the later titles of which were created by brothers Dan and Sam Houser, Leslie Benzies and Aaron Garbut. It is primarily developed by British development house Rockstar North (formerly DMA Design), and published by its parent company, Rockstar Games. The name of the series references the term \"grand theft auto\", used in the U.S. for motor vehicle theft.\nMost games in the series are set in fictional locales modelled on cities, usually either Liberty City, Vice City or San Andreas, which are stand-ins for New York City, Miami and the state of California, respectively. The first game encompassed three fictional cities, while subsequent titles tend to emphasise a single setting. Gameplay focuses on an open world where the player can choose missions to progress an overall story, as well as engaging in side activities, all consisting of action-adventure, driving, third-person shooting, carjacking, occasional role-playing, stealth and racing elements. The series focuses on many different protagonists who attempt to rise through the ranks of the criminal underworld, although their motives for doing so vary in each game. The series also has elements of the earlier beat 'em up games from the 16-bit era. The antagonists are commonly characters who have betrayed the protagonist or his organisation, or characters who have the most impact impeding the protagonist's progress. Film and music veterans have voiced characters, including Ray Liotta, Dennis Hopper, Samuel L. Jackson, James Woods, Debbie Harry, Axl Rose and Peter Fonda.DMA Design began the series in 1997, with the release of Grand Theft Auto. As of 2019, the series has eleven stand-alone games and four expansion packs. The third chronological title, Grand Theft Auto III, is considered a landmark title, as it brought the series to a 3D setting and more immersive experience. Subsequent titles have followed and built upon the concept established in Grand Theft Auto III, and received significant acclaim. They have influenced other open-world action games, and led to the label Grand Theft Auto clone on similar games.\nThe series has been critically acclaimed and commercially successful, having shipped more than 280 million units, making it the fourth-highest selling video game franchise of all time, behind Nintendo's Mario and Pokémon franchises, and Tetris. In 2006, Grand Theft Auto was featured in a list of British design icons in the Great British Design Quest organised by the BBC and the Design Museum. In 2013, The Telegraph ranked Grand Theft Auto among Britain's most successful exports. The series has also been controversial for its adult nature and violent themes.", "developer": ["DMA Design"], "genre": "Open world", "date_release": "1997-10-01"}, "Grand Theft Auto: The Ballad of Gay Tony": {"producer": "Leslie Benzies", "composer": null, "description": "Grand Theft Auto: The Ballad of Gay Tony is the second of the two episodic expansion packs available for the PlayStation 3, Microsoft Windows and Xbox 360 versions of Grand Theft Auto IV, developed by Rockstar North. It was first released for Xbox 360 on 29 October 2009, before then being released for PlayStation 3 and Microsoft Windows on 13 April 2010. It is the fourth expansion pack in the Grand Theft Auto series and the 14th release in the series.\nThe Ballad of Gay Tony follows the exploits of Luis Fernando Lopez, an ex-member of the Dominican drug dealers and the personal bodyguard (referred to by himself as \"business associate\") of Anthony \"Gay Tony\" Prince, who featured in a number of missions in both Grand Theft Auto IV and The Lost and Damned. The storyline focuses on Luis' efforts to help Prince, who is the owner of the two largest nightclubs in Liberty City and a high-status socialite, overcome several issues, including drugs, debt, mafia families and attempts on both of their lives. The story also ties up loose ends in regards to the diamond deal of Grand Theft Auto IV.\nRockstar Games said in their press release that this episode \"injects Liberty City with an overdose of guns, glitz, and crime\" and that \"players will struggle with the competing loyalties of family and friends, and with the uncertainty about who is real and who is fake in a world in which everyone has a price.\" A combined standalone disc-based package titled Grand Theft Auto: Episodes from Liberty City, which does not require the original Grand Theft Auto IV game to be played, was released alongside the second expansion and contains both The Lost and Damned and The Ballad of Gay Tony.", "developer": ["Rockstar North"], "genre": "Open world", "date_release": "2010-04-13"}, "Grand Theft Auto: London 1961": {"producer": [null, null, null], "description": "Grand Theft Auto: London 1969 is a mission pack for Grand Theft Auto. London 1969 was developed by Rockstar Canada and released by Rockstar Games on 31 March 1999 for Microsoft Windows and on 30 April 1999 for PlayStation. The game was awarded the BAFTA Interactive Entertainment Award in the category \"Sound\" in 1999.", "developer": ["Rockstar Canada"], "genre": "Open world", "date_release": "1999-06-01"}, "Grand Theft Auto: London 1969": {"producer": [null, null, null], "description": "Grand Theft Auto: London 1969 is a mission pack for Grand Theft Auto. London 1969 was developed by Rockstar Canada and released by Rockstar Games on 31 March 1999 for Microsoft Windows and on 30 April 1999 for PlayStation. The game was awarded the BAFTA Interactive Entertainment Award in the category \"Sound\" in 1999.", "developer": ["Rockstar Canada"], "genre": "Open world", "date_release": "1999-03-31"}, "Grand Theft Auto 2": {"producer": [null, null], "composer": null, "description": "Grand Theft Auto 2 is an action-adventure video game developed by DMA Design and published by Rockstar Games. It was released on 22 October 1999 for Microsoft Windows and the PlayStation, followed by Dreamcast and Game Boy Color releases in 2000. It is the sequel to 1997's Grand Theft Auto as well as the second installment of the Grand Theft Auto series. The open world design lets players freely roam Anywhere City, the setting of the game.\nThe game is played from a top-down perspective and its world is navigated on foot or by vehicle. The game was made available on Steam on 4 January 2008 as part of a collection.Its successor, Grand Theft Auto III, was released in October 2001.", "developer": ["DMA Design"], "genre": "Open world", "date_release": "1999-10-27"}, "Grand Theft Auto III": {"producer": "Leslie Benzies", "composer": null, "description": "Grand Theft Auto III is an action-adventure video game developed by DMA Design and published by Rockstar Games. It was released in October 2001 for the PlayStation 2, in May 2002 for Microsoft Windows, and in October 2003 for the Xbox. An enhanced version of the game was released on mobile platforms in 2011, for the game's tenth anniversary. It is the fifth title in the Grand Theft Auto series, and the first main entry since 1999's Grand Theft Auto 2.\nSet within the fictional Liberty City, based on New York City, the game follows Claude after he is left for dead and quickly becomes entangled in a world of gangs, crime and corruption. The game is played from a third-person perspective and its world is navigated on foot or by vehicle. The open world design lets players freely roam the three islands of Liberty City. Development was shared between DMA Design, based in Edinburgh, and Rockstar, based in New York City. Much of the development work involved transforming popular elements from the Grand Theft Auto series into a fully 3D world for the first time. The game was delayed following the September 11 attacks to allow the team to change references and gameplay deemed inappropriate.\nUpon release, Grand Theft Auto III received critical acclaim, with praise particularly directed at its concept and gameplay. However, the game also generated controversy, with criticism directed at its depictions of violence and sex. It became the best-selling video game of 2001, and has sold over 14.5 million copies since. Considered by many critics as one of the most significant titles of the sixth generation of video games, and one of the greatest video games of all time, it won a number of year-end accolades, including Game of the Year awards from several gaming publications. Since its release, it has received ports to many different gaming platforms. Its successor, Grand Theft Auto: Vice City, was released in October 2002.", "developer": ["DMA Design"], "genre": "Open world", "date_release": "2002-05-21"}, "Grand Theft Auto IV": {"producer": "Leslie Benzies", "composer": "Michael Hunter", "description": "Grand Theft Auto IV is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released for the PlayStation 3 and Xbox 360 consoles on 29 April 2008, and for Microsoft Windows on 2 December 2008. It is the eleventh title in the Grand Theft Auto series, and the first main entry since 2004's Grand Theft Auto: San Andreas. Set within the fictional Liberty City (based on New York City), the single-player story follows a war veteran, Niko Bellic, and his attempts to escape his past while under pressure from loan sharks and mob bosses. The open world design lets players freely roam Liberty City, consisting of three main islands.\nThe game is played from a third-person perspective and its world is navigated on-foot or by vehicle. Throughout the single-player mode, players play as Niko Bellic. An online multiplayer mode is included with the game, allowing up to 32 players to engage in both co-operative and competitive gameplay in a recreation of the single-player setting. Two expansion packs were later released for the game, The Lost and Damned and The Ballad of Gay Tony, which both feature new plots that are interconnected with the main Grand Theft Auto IV storyline, and follow new protagonists.\nDevelopment began soon after the release of Grand Theft Auto: San Andreas and was shared between many of Rockstar's studios worldwide. The game introduced a shift to a more realistic and detailed style and tone for the series. Unlike previous entries, Grand Theft Auto IV lacked a strong cinematic influence, as the team attempted an original approach to the story. As part of their research for the open world, the developers conducted field research around New York throughout development and captured footage for the design team.\nFollowing its announcement in May 2006, Grand Theft Auto IV was widely anticipated. Upon release, the game received universal critical acclaim, with praise particularly directed at the narrative and open world design. Grand Theft Auto IV broke industry sales records and became the fastest-selling entertainment product in history at the time, earning US$310 million in its first day and $500 million in its first week. Considered one of the most significant titles of the seventh generation of video games, and by many critics as one of the greatest video games of all time, it won year-end accolades, including Game of the Year awards from several gaming publications. It has sold over 25 million copies worldwide as of 2019; it remains the best-selling PlayStation 3 game of all time. However, the game also generated controversy, with criticism directed at the game's depiction of violence and players' ability to drive under the influence of alcohol. Its successor, Grand Theft Auto V, was released in September 2013.", "developer": ["Rockstar North"], "genre": "Open world", "date_release": "2008-12-02"}, "Grand Theft Auto: The Lost and Damned": {"producer": "Leslie Benzies", "composer": "Stuart Hart", "description": "Grand Theft Auto IV: The Lost and Damned is the first of two episodic expansion packs developed for the Xbox 360, PlayStation 3 and Microsoft Windows versions of Grand Theft Auto IV, developed by Rockstar North and published by Rockstar Games. It was first released for Xbox 360 on 17 February 2009, and for PlayStation 3 and Microsoft Windows on 13 April 2010. It is the third expansion pack in the Grand Theft Auto series (the first since Grand Theft Auto: London 1961, released in 1999), and the twelfth release overall.\nThe protagonist of The Lost and Damned is Johnny Klebitz, Vice-President of the Alderney chapter of The Lost MC, a motorcycle club which, along with himself, featured in a number of missions throughout the course of Grand Theft Auto IV. The main storyline of the episode focuses on Johnny's efforts to keep the chapter running, while dealing with internal conflicts, gang warfare, drug running, and various enemies. The storyline shows Johnny's perspective in regard to the infamous diamond deal of Grand Theft Auto IV.\nA combined standalone disc-based package titled Grand Theft Auto: Episodes from Liberty City, which does not require the original Grand Theft Auto IV game to be played, was released and contains both The Lost and Damned and Grand Theft Auto: The Ballad of Gay Tony.", "developer": ["Rockstar North"], "genre": "Open world", "date_release": "2010-04-13"}, "Grand Theft Auto: San Andreas": {"producer": "Leslie Benzies", "composer": "Michael Hunter", "description": "Grand Theft Auto: San Andreas is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released on 26 October 2004 for PlayStation 2 and on 7 June 2005 for Microsoft Windows and Xbox. A high definition remastered version received a physical release for both Xbox 360 and PlayStation 3 on 30 June 2015 and 1 December 2015, respectively. It is the seventh title in the Grand Theft Auto series, and the first main entry since 2002's Grand Theft Auto: Vice City. It was released on the same day as the handheld game Grand Theft Auto Advance for Game Boy Advance. On 8 June 2018, the game was added to the Xbox One Backward Compatible library.\nGrand Theft Auto: San Andreas is played from a third-person perspective in an open world environment, allowing the player to interact with the game world at their leisure. The game is set within the fictional U.S. state of San Andreas, which is heavily based on California and Nevada. The state of San Andreas consists of three metropolitan cities: Los Santos, based on Los Angeles; San Fierro, based on San Francisco; and Las Venturas, based on Las Vegas. The single-player story follows Carl \"CJ\" Johnson, an ex-gangbanger who returns home to Los Santos from Liberty City after his mother's murder. Carl finds his old friends and family in disarray, and over the course of the game, he attempts to re-establish his old gang, clashes with corrupt cops, and gradually unravels the truth behind his mother's murder. The plot is based on multiple real-life events in Los Angeles, including the rivalry between the Bloods, Crips, and Hispanic street gangs, the 1980s-early 1990s crack epidemic, the LAPD Rampart scandal, and the 1992 Los Angeles riots.\nConsidered one of the sixth generation of video gaming's most notable titles, and by many reviewers to be one of the greatest video games ever made, San Andreas received rave reviews by many critics who praised the music, story and gameplay. It became the best-selling video game of 2004, as well as one of the best-selling video games of all time. It has sold over 27.5 million copies worldwide as of 2011; it remains the best-selling PlayStation 2 game of all time. The game, like its predecessors, is cited as a landmark in video games for its far-reaching influence within the industry. However, the violence and sexual content of San Andreas has been the source of much public concern and controversy. In particular, a player-made software patch, dubbed the \"Hot Coffee mod\", unlocked a previously hidden sexual scene. The next main entry in the series, Grand Theft Auto IV, was released in April 2008. San Andreas has been ported to various other platforms and services, such as OS X, Xbox Live, PlayStation Network and mobile devices (iOS, Android, Windows Phone and Fire OS).", "developer": ["Rockstar North"], "genre": "Open world", "date_release": "2005-06-07"}, "Grand Theft Auto: Vice City": {"producer": "Leslie Benzies", "composer": "Lex Horton", "description": "Grand Theft Auto: Vice City is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released on 29 October 2002 for the PlayStation 2, on 12 May 2003 for Microsoft Windows, and on 31 October 2003 for the Xbox. An enhanced version was released for mobile platforms in 2012, for the game's tenth anniversary. It is the sixth title in the Grand Theft Auto series and the first main entry since 2001's Grand Theft Auto III. Set within the fictional Vice City, based on Miami, the game follows Tommy Vercetti following his release from prison. After he is caught up in an ambushed drug deal, he seeks out those responsible while building a criminal empire and seizing power from other criminal organisations in the city.\nThe game is played from a third-person perspective, and its world is navigated on foot or by vehicle. The open world design lets the player freely roam Vice City, consisting of two main islands. The game's plot is based on multiple real-world people and events in Miami such as Cuban, Haitian, and biker gangs, the 1980s crack epidemic, the Mafioso drug lords of Miami, and the dominance of glam metal. The game was also influenced by the film and television of the era, including Scarface and Miami Vice. Much of the development work constituted creating the game world to fit the inspiration and time period; the development team conducted extensive field research in Miami while creating the world.\nUpon release, the game received critical acclaim, with praise particularly directed at its music, gameplay and open world design. However, the game also generated controversy, with criticism directed at the depiction of violence and racial groups.  The game sparked lawsuits and protests while being labelled as violent and explicit. Vice City became the best-selling video game of 2002 and has sold over 17.5 million copies. Considered one of the most significant titles of the sixth generation of video games, and one of the greatest video games ever made, it won numerous year-end accolades including Game of the Year awards from several gaming publications. Since its release, the game has received numerous ports to many gaming platforms. Its successor, Grand Theft Auto: San Andreas, was released in October 2004, and a prequel, Vice City Stories, was released in 2006.", "developer": ["Rockstar North"], "genre": "Open world", "date_release": "2003-05-12"}, "Grand Theft Auto V": {"producer": [null, null], "composer": null, "description": "Grand Theft Auto V is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released in September 2013 for PlayStation 3 and Xbox 360, in November 2014 for PlayStation 4 and Xbox One, and in April 2015 for Microsoft Windows. It is the first main entry in the Grand Theft Auto series since 2008's Grand Theft Auto IV. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three criminals and their efforts to commit heists while under pressure from a government agency. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles.\nThe game is played from either a third-person or first-person perspective, and its world is navigated on foot or by vehicle. Players control the three lead protagonists throughout single-player and switch between them both during and outside missions. The story is centred on the heist sequences, and many missions involve shooting and driving gameplay. A \"wanted\" system governs the aggression of law enforcement response to players who commit crimes. Grand Theft Auto Online, the game's online multiplayer mode, lets up to 30 players engage in a variety of different cooperative and competitive game modes.\nThe game's development began soon after Grand Theft Auto IV's release and was shared between many of Rockstar's studios worldwide. The development team drew influence from many of their previous projects such as Red Dead Redemption and Max Payne 3 and designed the game around three lead protagonists to innovate on the core structure of its predecessors. Much of the development work constituted the open world's creation, and several team members conducted field research around California to capture footage for the design team. The game's soundtrack features an original score composed by a team of producers who collaborated over several years.\nExtensively marketed and widely anticipated, the game broke industry sales records and became the fastest-selling entertainment product in history, earning $800 million in its first day and $1 billion in its first three days. It received widespread critical acclaim, with praise directed at its multiple protagonist design, open world, presentation and gameplay. However, it caused controversies related to its depiction of violence and women. Considered one of seventh and eighth generation console gaming's most significant titles and among the best video games ever made, it won year-end accolades including Game of the Year awards from several gaming publications. It is the third best-selling video game of all time with over 110 million copies shipped and one of the most financially successful entertainment products of all time, with about $6 billion in worldwide revenue.", "developer": ["Rockstar North"], "genre": "Open world", "date_release": "2015-04-14"}, "Grid 2": {"description": "Grid 2 is a racing video game developed and published by Codemasters for Microsoft Windows, PlayStation 3, Xbox 360 and the Xbox One, via backwards compatibility. It is the eighth game in the TOCA series. On 25 September 2014, Feral Interactive released the Reloaded Edition for OS X.As of August 2019, GRID 2 was delisted from PC (Steam Store), Playstation 3 and Xbox 360. The Steam version was removed as of August 8th 2019, and presumably the others were delisted around a simillar time.", "developer": ["Codemasters"], "genre": "Racing", "date_release": "2013-05-27"}, "Ground Control": {"producer": "Jeff Pobst", "composer": "Ola Strandh", "description": null, "developer": ["Massive Entertainment"], "genre": "Real-time tactics", "date_release": "2000-06-01"}, "Ground Control II: Operation Exodus": {"producer": null, "description": "Ground Control II: Operation Exodus is a 2004 real-time tactics video game developed by Massive Entertainment. It is a sequel to Ground Control, the award-winning game of the same genre. Much like its predecessor, it features 3D graphics and a fully rotational camera system.", "developer": ["Massive Entertainment"], "genre": "Real-time tactics", "date_release": "2004-06-18"}, "Growtopia": {"composer": "Cory Mollenhour", "description": "Growtopia is a server-run MMO sandbox video game where players can chat, farm, add friends, trade, build worlds and PVP. The game was initially released for Android in November 2012, and has since been released for iOS, Android, Microsoft Windows, macOS, Nintendo Switch, PlayStation 4 and Xbox One.\nAs of February 28, 2017, an Ubisoft acquirement of Growtopia was announced and was completed during Ubisoft's 2016-17 fourth quarter, with the original developers being design and general advisors to the game's continued development.", "developer": ["Ubisoft Abu Dhabi", "Robinson Technologies", "Hamumu Software"], "genre": "MMO", "date_release": "2012-11-30"}, "GTR Evolution": {"description": "GTR Evolution is an expansion pack to Race 07 developed by SimBin Studios (later Sector3 Studios), published by Atari in Europe and Viva Media in the United States. It was released worldwide for digital download on Steam on September 1, 2008. It is also available for purchase in many countries in a DVD boxed version.", "genre": "Racing", "date_release": "2008-08-01"}, "Guild Wars": {"description": "Guild Wars is an online role-playing game series developed by ArenaNet and published by NCSOFT. The games were critically well received and won many editor's choice awards, as well as awards such as Best Value, Best Massively Multiplayer Online Role-Playing Game (MMORPG), and Best Game. Guild Wars was noted for being the \"first major MMO to adopt a business model not based on monthly subscription fees\", its instanced approach to gameplay, and the quality of the graphics and play for computers with low specifications. In April 2009, NCSoft announced that 6 million units of games in the Guild Wars series had been sold. The sequel, Guild Wars 2, was announced in March 2007 and released on August 28 2012. It features updated graphics and gameplay mechanics, and continues the original Guild Wars tradition of no subscription fees. The Guild Wars series had sold 11.5 million copies by August 2015.\n\n", "developer": ["ArenaNet"], "genre": "CORPG", "date_release": "2005-04-26"}, "Guild Wars 2": {"composer": "Jeremy Soule", "description": "Guild Wars 2 is a massively multiplayer online role-playing game developed by ArenaNet and published by NCSOFT. Set in the fantasy world of Tyria, the game follows the re-emergence of Destiny's Edge, a disbanded guild dedicated to fighting the Elder Dragons, a Lovecraftian species that has seized control of Tyria in the time since the original Guild Wars. The game takes place in a persistent world with a story that progresses in instanced environments.Guild Wars 2 claims to be unique in the genre by featuring a storyline that is responsive to player actions, something which is common in single player role-playing games but rarely seen in multiplayer ones. A dynamic event system replaces traditional questing, utilising the ripple effect to allow players to approach quests in different ways as part of a persistent world. Also of note is the combat system, which aims to be more dynamic than its predecessor by promoting synergy between professions and using the environment as a weapon, as well as reducing the complexity of the Magic-style skill system of the original game.\nAs a sequel to Guild Wars, Guild Wars 2 features the same lack of subscription fees that distinguished its predecessor from other commercially developed online games of the time, though until August 2015 a purchase was still required to install the game. As reported by NCsoft and ArenaNet, by September 13 (about 2 weeks after launch), despite temporarily halting first-party sales, the game has sold over 2 million copies. By August 2013, the peak player concurrency had reached 460,000. By August 2015, over 5 million copies had been sold, at which point the base game became free-to-play.", "developer": ["ArenaNet"], "genre": "MMORPG", "date_release": "2012-08-28"}, "Guild Wars Factions": {"description": "Guild Wars Factions is an action RPG released in 2006 by ArenaNet, the second in the Guild Wars series. Factions introduces the continent of Cantha where two warring factions, the Luxons and the Kurzicks, are locked in a global persistent war.  Players are able to join in this conflict, assisting their chosen faction in claiming towns on the game map.\nFactions has a new PvE campaign, two new professions in addition to the original six, new skills and armor for existing professions, new gameplay modes for both PvE and PvP, and gameplay modifications in response to criticism of the earlier Prophecies campaign. Factions can be bought as a stand-alone game or can be added to an existing Prophecies account to produce a merged account with several benefits. Most of the PvP content from Prophecies is available to Factions-only accounts.", "developer": ["ArenaNet"], "genre": "CORPG", "date_release": "2006-04-28"}, "Guild Wars Nightfall": {"description": "Guild Wars Nightfall is a fantasy action role-playing game and the third stand-alone campaign in the Guild Wars series developed by ArenaNet, a subsidiary of NCSOFT corporation. Nightfall was released worldwide on October 27, 2006 after beginning in development in November 2005.Nightfall takes place in the continent of Elona in the Guild Wars universe. It follows the player's character as they join the Order of the Sunspears and uncover the desire of Warmarshal Varesh to return a long forgotten god to the world through an event called Nightfall. The players, assisted by their hero allies, fight through civil war,  ignorant Vabbi princes and Varesh's demon allies as they attempt to prevent the coming of Nightfall.", "developer": ["ArenaNet"], "genre": "CORPG", "date_release": "2006-10-27"}, "Guitar Hero III: Legends of Rock": {"description": "Guitar Hero III: Legends of Rock is a music rhythm game, the third main installment in the Guitar Hero series, and the fourth title overall. The game was published by Activision and distributed by RedOctane. It is the first game in the series to be developed by Neversoft after Activision's acquisition of RedOctane and MTV Games' purchase of Harmonix, the previous development studio for the series. The game was released worldwide for the PlayStation 2, PlayStation 3, Wii and Xbox 360 in October 2007, with Budcat Creations assisting Neversoft on developing the PlayStation 2 port and Vicarious Visions solely developing on the Wii port respectively. Aspyr Media published the Microsoft Windows and Mac OS X versions of the game, releasing them later in 2007.\nGuitar Hero III: Legends of Rock retains the basic gameplay from previous games in the Guitar Hero series, where the player uses a guitar-shaped controller to simulate the playing of lead, bass, and rhythm guitar parts in rock songs by playing in time to scrolling notes on-screen. The game, in addition to existing single-player Career modes, includes a new Co-Op Career mode and competitive challenges that pit the player against in-game characters and other players. Guitar Hero III: Legends of Rock is the first game in the series to include an online multiplayer feature, which is enabled in the PlayStation 3, Wii and Xbox 360 versions. Initially the game offers over 70 songs, most of which are master tracks. The PlayStation 3 and Xbox 360 versions feature the ability to download additional songs. The musicians Tom Morello (of the bands Rage Against the Machine and Audioslave) and Slash (of Guns N' Roses and Velvet Revolver) make appearances both as guitar battle opponents and playable characters in the game. The PlayStation 3, Xbox 360 and Microsoft Windows versions also include Bret Michaels (of Poison) as a non-playable character.\nCritics and fans acclaimed the game, but reviewers noted a difference in the game's style compared to previous installments, associating it with it being Neversoft's first development attempt with the series. The game is often cited to be too difficult, creating \"walls of notes\" that are difficult to complete, and led to alterations in note placement for future games in the series.  According to Activision, Guitar Hero III: Legends of Rock is the best-selling video game of 2007, both in terms of units sold and revenue earned, and that it is the first single retail video game to exceed one billion dollars in sales. The company also claimed that it is the second-best selling video game title since 1995, following Wii Play, and is one of the best-selling third-party games available for the Wii.", "developer": ["Neversoft"], "genre": "Music", "date_release": "2007-11-13"}, "Gunpoint": {"composer": null, "description": null, "developer": ["Suspicious Developments"], "genre": "Action", "date_release": "2013-06-03"}}