{"X3: Terran Conflict": {"description": "X3: Terran Conflict (Usually shortened to X3TC and trademarked as X3: Terran Conflict), is a space trading and combat simulator from German developer Egosoft and is the culmination of their X series of computer games. Described as a stand-alone game, based on X3: Reunion, it boasts new plot lines, features and assets. It was first released on October 2008 for the European market and Steam.", "developer": ["Egosoft"], "genre": "Space simulation", "date_release": "2008-10-16"}, "X-Plane": {"description": "X-Plane is a   flight simulator produced by Laminar Research. X-Plane can be used professionally with the correct license, or used personally. A personal use desktop version is available for macOS, Windows, and Linux, while a mobile version is available for Android, iOS, and webOS. X-Plane is packaged with several commercial, military, and other aircraft, as well as basic global scenery which covers most of the Earth. X-Plane also ships with other software to build and customize aircraft and scenery. X-Plane also has a plugin architecture that allows users to create their own modules, extending the functionality of the software by letting users create their own worlds or replicas of places on Earth. This is further enhanced by the Scenery Gateway which allows users to share airports with other users and eventually the airports are included by default in the base product.\nOn November 25, 2016, Laminar Research released the first public beta of X-Plane 11 to the general public. A second public beta was released on December 6, 2016, which fixed some major bugs. The official release of X-Plane 11 was on March 30, 2017.", "developer": ["Laminar Research"], "genre": "Flight simulator", "date_release": "1993-01-01"}, "XCOM: Enemy Unknown": {"producer": "Garth DeAngelis", "composer": "Michael McCann", "description": "XCOM: Enemy Unknown is a 2012 turn-based tactical video game developed by Firaxis Games and published by 2K Games. The game is a \"reimagined\" remake of the 1994 cult classic strategy game UFO: Enemy Unknown (also known as X-COM: UFO Defense) and a reboot of MicroProse's 1990s X-COM series.\nXCOM: Enemy Unknown was released for Microsoft Windows, PlayStation 3, and Xbox 360 in North America on October 9, 2012, and in Europe and Australia on October 12, 2012. An \"Elite Edition\", containing all previously released downloadable content, was released as a Mac OS X exclusive by Feral Interactive in April 2013. A port for iOS was released in June 2013 and an Android conversion was released in May 2014. An expansion pack, titled XCOM: Enemy Within, was released in November 2013. In June 2014, Feral released both XCOM: Enemy Unknown and its expansion pack XCOM: Enemy Within for Linux. A bundle containing both Enemy Unknown and Enemy Within was launched on the PlayStation Store for PlayStation Vita in March 2016 under the title XCOM: Enemy Unknown Plus.\nSet in an alternative version of year 2015, during an alien invasion of Earth, the game puts the player in control of an elite multinational paramilitary organization called XCOM and is tasked with defending the Earth. The player commands troops in the field in a series of turn-based tactical missions; between missions, the player directs the research and development of new technologies from recovered alien technology and captured prisoners, expands XCOM's base of operations, manages XCOM's finances, and monitors and responds to alien activity.\nXCOM: Enemy Unknown was critically acclaimed, with several reviewers commenting on the game's difficulty, replayability, and addictiveness. A number of publications, including GameSpy, GameTrailers and Giant Bomb, named it Game of the Year. A sequel to the game, titled XCOM 2, was released on February 5, 2016 for Microsoft Windows, OS X, and Linux.", "developer": ["Firaxis Games", "Feral Interactive"], "genre": "Turn-based tactics", "date_release": "2012-10-09"}, "XCOM: Enemy Within": {"producer": null, "description": "XCOM: Enemy Within is an expansion pack for the turn-based tactical video game XCOM: Enemy Unknown. The expansion pack primarily adds new gameplay elements to the base game, as well as introducing new themes of transhumanism via aggressive gene therapy.\nXCOM: Enemy Within was released for Microsoft Windows, PlayStation 3, and Xbox 360 in November 2013. In June 2014, Feral released both XCOM: Enemy Within and its base game XCOM: Enemy Unknown for Linux. The game also came to the iOS App Store and Google Play Store a year after the initial release, on November 12, 2014. On March 22, 2016, the game was released on the PlayStation Store for PlayStation Vita.\nThe Windows, OS X and Linux editions require XCOM: Enemy Unknown to play; Enemy Within was released for Xbox 360 and PlayStation 3 as part of the Commander Edition bundle with Enemy Unknown. The iOS and Android versions were released as stand-alone apps not requiring the original mobile port of Enemy Unknown to play. The PlayStation Vita version is only available bundled with Enemy Unknown under the title, XCOM: Enemy Unknown Plus.", "developer": ["Firaxis Games", "Feral Interactive"], "genre": "Turn-based tactics", "date_release": "2013-11-12"}, "Xenonauts": {"composer": "Aleksi Aubry-Carlson", "description": "Xenonauts is a turn-based science fiction video game developed and published as the maiden title of London-based independent game studio Goldhawk Interactive. Inspired by the 1994 game UFO: Enemy Unknown (Called X-COM: UFO Defense in North America), gameplay involves the player taking the role of the commander of a clandestine organization known as the Xenonauts, and attempting to defeat an alien invasion of Earth in the alternate history year 1979. The game was released on June 17, 2014 for Microsoft Windows. Ports to Mac OS X and Linux were initially based on the Wine compatibility layer, until native ports became available in September 2015.", "developer": ["Goldhawk Interactive"], "genre": "Turn-based tactics", "date_release": "2014-06-17"}}