{"M.U.D. TV": {"description": null, "genre": "Business simulation", "date_release": "2010-02-23"}, "M.U.G.E.N": {"description": "M.U.G.E.N (also known as Mugen, MUGEN and M.U.G.E.N.) is a freeware 2D fighting game engine designed by Elecbyte.  Content is created by the community, and thousands of fighters, both original and from popular fiction, have been created. It is written in C and originally used the Allegro library.  The latest versions of the engine now use the SDL library.", "developer": ["ElecByte"], "genre": "Fighting", "date_release": "1999-07-17"}, "M1 Tank Platoon": {"description": "M1 Tank Platoon is a tactical simulator of tank warfare developed and published by MicroProse for the Commodore Amiga, Atari ST and MS-DOS in 1989. The game features a mixture of first-person tank warfare and tactical simulation gameplay. It was followed by a sequel, M1 Tank Platoon II, released by MicroProse in 1998 for Windows. M1 Tank Platoon was sold to Interplay Entertainment in 2009.", "developer": ["MPS Labs"], "genre": "Simulation", "date_release": "1989-01-01"}, "M1 Tank Platoon II": {"description": "M1 Tank Platoon II (sometimes referred to simply as M1TP2) is a tank simulation video game developed and published by MicroProse Software in 1998 for the PC Windows. It is a simulator of the M1 Abrams main battle tank and a follow-up to MicroProse's 1989 release M1 Tank Platoon. M1 Tank Platoon II was sold to Interplay Entertainment in 2009.", "developer": ["MicroProse"], "genre": "Simulation", "date_release": "1998-02-28"}, "Magicka": {"description": "Magicka is an action-adventure video game developed by Swedish independent developer Arrowhead Game Studios. It was released via Steam for Microsoft Windows on January 25, 2011. The game was developed by eight students at Luleå University of Technology in Skellefteå, Sweden and sold over 200,000 copies in its first 17 days on sale. It had sold 1.3 million copies and 4 million DLC packs as of January 2012, making it one of the most successful games published by Paradox Interactive and was credited with a 250% rise in profits for Paradox during 2012. As of June 2014, it has sold 2.8 million copies on Steam.Magicka is based on Norse mythology. Up to four mages of a sacred order travel to fight against an evil sorcerer and his creations. The game world is based loosely on Norse mythology, drawing inspiration from other fantasy games like Warhammer and Diablo, while also making regular use of comedy and self-referential humor. The game also takes liberties when it comes to the classic fantasy setting, at one point supplying the players with an M60 machine gun. In expansions the game also explores a Vietnam War setting as well as the Lovecraftian Cthulhu universe.\nA sequel, Magicka 2, was announced on  June 9, 2014. It was developed by Pieces Interactive, the developers of some of the downloadable content for the original game, and was released in May, 2015.", "developer": ["Arrowhead Game Studios"], "genre": "Fantasy", "date_release": "2011-01-25"}, "Mass Effect": {"description": "Mass Effect is a third-person shooter, action role-playing video game series developed by BioWare and released for the Xbox 360, PlayStation 3, and Microsoft Windows, with the third installment also released on the Wii U. The fourth game was released on Windows, PlayStation 4 and Xbox One in March 2017.\nThe original trilogy largely revolves around a soldier named Commander Shepard, whose mission is to save the galaxy from a race of powerful mechanical beings known as the Reapers and their agents, including the first game's antagonist Saren Arterius. The first game, released in 2007, sees Shepard investigating Saren, whom Shepard slowly comes to understand is operating under the guidance of Sovereign, a Reaper left behind in the Milky Way 50,000 years before, when the Reapers exterminated all sentient organic life determined to have met or exceeded a threshold of technological advancement in the galaxy as part of a recurrent cycle of genocide for an unknown purpose. Sovereign's purpose is to trigger the imminent return of the Reaper fleet hibernating in extra-galactic dark space, restarting the process of extermination. The second game takes place two years later, and sees Shepard battling the Collectors, an alien race abducting entire human colonies in a scheme to aid the Reapers' return to the  Milky Way. The final game of Shepard's trilogy centres on the war being waged against the Reapers. The fourth installment takes place in the Andromeda Galaxy and features a new cast of characters.The original trilogy was all met with commercial success as well as universal acclaim. The series is highly regarded for its narrative, character development, voice acting, the universe, and emphasis on player choice affecting the experience.", "developer": ["BioWare Corporation"], "genre": "RPG", "date_release": "2007-11-20"}, "Mass Effect 2": {"producer": [null, null], "composer": null, "description": "Mass Effect 2 is an action role-playing video game developed by BioWare and published by Electronic Arts. It was released for Microsoft Windows and Xbox 360 in 2010, and PlayStation 3 in 2011. Mass Effect 2 is the second installment of the Mass Effect series and a sequel to the original Mass Effect. The game takes place within the Milky Way galaxy during the 22nd century, where humanity is threatened by an insectoid species known as the Collectors. The player assumes the role of Commander Shepard, an elite human soldier who must construct and gain the loyalty of a diverse team and stop the enemy in a suicide mission. With the use of a completed saved game of its predecessor, the player can impact the story of the game in numerous ways.\nFor the game, BioWare changed several gameplay elements and put further emphasis on third-person shooter aspects, including limited ammunition and regenerable health. In contrast to the exclusive focus on the main story of the original Mass Effect, the developers opted to create a plot where optional missions had as much intensity as the main mission. Mass Effect composer Jack Wall returned to compose Mass Effect 2's music, aiming for a darker and more mature sound to match the mood of the game. Mass Effect 2 also supports a variety of downloadable content packs, ranging from single in-game character outfits to entirely new plot-related missions. Notable packs include Kasumi – Stolen Memory, Overlord, Lair of the Shadow Broker, and Arrival.\nMass Effect 2 was a commercial success and received critical acclaim from video game publications, with the Xbox 360 version holding a score of 96 out of 100 at the review aggregate website Metacritic. Critics praised multiple aspects of the game, including its interactive storytelling, characterization, and combat. In contrast, some reviewers expressed concerns about the game's simplified gameplay compared to the previous game in the series. The game received numerous year-end awards, including Game of the Year at the 14th Annual Interactive Achievement Awards, and Best Game at the 2011 British Academy of Film and Television Arts Awards. The game is frequently cited as one of the greatest video games of all time. A sequel, Mass Effect 3, was released in 2012.", "developer": ["BioWare Corporation"], "genre": "RPG", "date_release": "2010-01-26"}, "Mass Effect 3": {"producer": "Jesse Houston", "composer": null, "description": null, "developer": ["BioWare Corporation"], "genre": "RPG", "date_release": "2012-03-06"}, "Max Payne": {"producer": [null, null], "composer": null, "description": "Max Payne is a third-person shooter video game series developed by Remedy Entertainment (Max Payne and Max Payne 2) and Rockstar Studios (Max Payne 3). The series is named after its protagonist, Max Payne, a New York City police detective turned vigilante after his family had been murdered by drug dealers. The series' first and second installments were written by Sam Lake, while Max Payne 3 was primarily written by Rockstar Games' Dan Houser.\nThe first game of the series Max Payne, was released in 2001 for Microsoft Windows and in 2002 for Xbox, PlayStation 2, and Apple Macintosh; a different version of the game was released for the Game Boy Advance in 2003. A sequel entitled Max Payne 2: The Fall of Max Payne was released in 2003 for Xbox, PlayStation 2 and Microsoft Windows. In 2008, a movie adaption, loosely based on the original game, entitled Max Payne was released, distributed by 20th Century Fox, starring Mark Wahlberg and Mila Kunis in the roles of Max Payne and Mona Sax, respectively. Max Payne 3 was developed by Rockstar Studios and released on May 15, 2012 for Xbox 360 and PlayStation 3, and on June 1, 2012 for Microsoft Windows.\nThe franchise is notable for its use of \"bullet time\" in action sequences, as well as being positively received by critics, although Max Payne 2's sales were considered underwhelming. As of 2011, the Max Payne franchise has sold over 7.5 million copies. The film rendition received negative reviews but was commercially successful.", "developer": ["Remedy Entertainment"], "genre": "Third-person shooter", "date_release": "2001-07-23"}, "Max Payne 2: The Fall of Max Payne": {"composer": null, "description": "Max Payne is a third-person shooter video game series developed by Remedy Entertainment (Max Payne and Max Payne 2) and Rockstar Studios (Max Payne 3). The series is named after its protagonist, Max Payne, a New York City police detective turned vigilante after his family had been murdered by drug dealers. The series' first and second installments were written by Sam Lake, while Max Payne 3 was primarily written by Rockstar Games' Dan Houser.\nThe first game of the series Max Payne, was released in 2001 for Microsoft Windows and in 2002 for Xbox, PlayStation 2, and Apple Macintosh; a different version of the game was released for the Game Boy Advance in 2003. A sequel entitled Max Payne 2: The Fall of Max Payne was released in 2003 for Xbox, PlayStation 2 and Microsoft Windows. In 2008, a movie adaption, loosely based on the original game, entitled Max Payne was released, distributed by 20th Century Fox, starring Mark Wahlberg and Mila Kunis in the roles of Max Payne and Mona Sax, respectively. Max Payne 3 was developed by Rockstar Studios and released on May 15, 2012 for Xbox 360 and PlayStation 3, and on June 1, 2012 for Microsoft Windows.\nThe franchise is notable for its use of \"bullet time\" in action sequences, as well as being positively received by critics, although Max Payne 2's sales were considered underwhelming. As of 2011, the Max Payne franchise has sold over 7.5 million copies. The film rendition received negative reviews but was commercially successful.", "developer": ["Remedy Entertainment"], "genre": "Third-person shooter", "date_release": "2003-10-14"}, "MDK": {"producer": [null, null], "composer": "Tommy Tallarico", "description": "MDK is a 1997 third-person shooter video game developed by Shiny Entertainment for Microsoft Windows. It was ported to Mac OS by Shokwave, and to the PlayStation by Neversoft. It was published on all systems by PIE in North America, with Shiny Entertainment publishing it themselves in Europe. The Windows version was released in April 1997, the Mac version in June and the PlayStation version in November. The game was released on GOG.com in September 2008, and on Steam in September 2009.The game tells the story of Kurt Hectic, a janitor who reluctantly must attempt to save Earth from an alien invasion of gigantic strip mining city-sized vehicles named \"Minecrawlers\". These Minecrawlers are removing all of earth's natural resources, and crushing any people and cities that get in their way. Aided by his boss, the possibly insane inventor and scientist Dr. Fluke Hawkins, and a robotic two-legged/four-armed dog named Bones, Kurt must infiltrate each Minecrawler, and fight his way to the pilot, whom he must then kill before returning to Hawkins' in-orbit space station, the Jim Dandy.\nConceived and co-designed by Nick Bruty, MDK was Shiny's first PC game, and was notable for using software rendering, requiring a Pentium or equivalent microprocessor, rather than necessitating any GPU enhancements, despite its large 3D levels and complex polygon-based enemies. As the developers were attempting things never before seen in a PC game, they had to write their own programming language from scratch. Additionally, when in sniper mode, the player has the ability to zoom up to 100x, but the developers chose not to employ any of the standard solutions to pop-up, such as clipping or fogging. They also worked to ensure the game ran at a minimum of 30fps at all times on all machines. The game's original system requirements were a 60 MHz Pentium, 16MB of RAM, 17MB of hard drive storage, an SVGA compatible video card, and a Sound Blaster or equivalent sound card.\nMDK received generally positive reviews, with critics praising the gameplay, the level design, the sardonic sense of humor, the game's technical accomplishments and, in particular, the use of sniper mode. The most oft repeated criticisms were that the game was too short and the story was weak. The game was a commercial success, and Interplay approached Bruty to work on a sequel immediately. However, he was already developing Giants: Citizen Kabuto, and so BioWare was hired to develop the game. MDK2 was published for Windows and the Dreamcast in 2000, and for the PlayStation 2 (as MDK 2: Armageddon) in 2001. In 2007, Interplay announced a third game was planned, but it was never made.", "developer": ["Shiny Entertainment"], "genre": "Third-person shooter", "date_release": "1997-11-21"}, "MDK2": {"producer": [null, null], "composer": null, "description": "MDK2 is a 2000 third-person shooter, action-adventure video game developed by BioWare and published by Interplay Entertainment for the Dreamcast, Windows and PlayStation 2. It is a sequel to the 1997 game MDK. First released for the Dreamcast in March 2000, it was later released for Windows in May, with newly selectable difficulty levels and the ability to manually save. In March 2001, a slightly reworked version, featuring level design modifications and gameplay tweaks, was released for the PlayStation 2 as MDK 2: Armageddon. The PC version was released on GOG.com in September 2008, and on Steam in September 2009. A port of the PlayStation 2 version was released for Wii via WiiWare in 2011. Also in 2011, a HD remastered version was released for Windows. Called MDK2 HD, this version features new 3D models, textures, improved lighting, and remastered music, and was released on Beamdog in October, and on Steam in July 2012.\nThe game begins moments after the end of the original MDK. Believing they had vanquished the alien invaders, Kurt Hectic, Dr. Hawkins and Max are shocked to find a single Minecrawler remains. Kurt heads to destroy it, but upon doing so, encounters a massive alien called Shwang Shwing, who reveals the invasion of Earth is far from over. The main difference between MDK and MDK2 is the ability to control three playable characters (Kurt, Hawkins and Max), each with their own strengths and weaknesses. As such, the variety of gameplay in the sequel is more varied than in the original game, with more emphasis on platforming and puzzles than straight run-and-gun shooting.\nMDK2 received generally positive reviews across all systems, with critics praising the graphics, variety of gameplay styles, level design, boss fights, the game's sense of humor, and its fidelity to the original MDK. The most commonly criticized aspects of the game were the difficulty level, which was felt to be too high, and the platforming sections, which many critics found frustrating and too exacting. Hawkins' levels in general were seen as inferior to Kurt's and Max's. In 2007, Interplay announced plans for a third game, but it was never made.", "developer": ["BioWare"], "genre": "Third-person shooter", "date_release": "2000-03-31"}, "Mechwarrior Online": {"description": "MechWarrior Online is a free-to-play vehicular combat video game, officially launched during September 2013 by Piranha Games for Microsoft Windows. The game takes place within the larger BattleTech universe.", "developer": ["Piranha Games"], "genre": "Vehicular combat", "date_release": "2013-09-17"}, "Medal of Honor": {"producer": null, "composer": "Ramin Djawadi", "description": "The Medal of Honor is the United States of America's highest and most prestigious personal military decoration that may be awarded to recognize U.S. military service members who have distinguished themselves by acts of valor. The medal is normally awarded by the President of the United States in the name of the U.S. Congress.  Because the medal is presented \"in the name of Congress\", it is often referred to informally as the \"Congressional Medal of Honor\".  However, the official name of the current award is \"Medal of Honor\". Within the United States Code the medal is referred to as the \"Medal of Honor\", and less frequently as \"Congressional Medal of Honor\". U.S. awards, including the Medal of Honor, do not have post-nominal titles, and while there is no official abbreviation, the most common abbreviations are \"MOH\" and \"MH\".There are three versions of the medal, one each for the Army, Navy, and Air Force. Personnel of the Marine Corps and Coast Guard receive the Navy version. The Medal of Honor was introduced for the Navy in 1861, soon followed by an Army version in 1862. The Medal of Honor is the oldest continuously issued combat decoration of the United States armed forces.The President typically presents the Medal at a formal ceremony intended to represent the gratitude of the U.S. people, with posthumous presentations made to the primary next of kin. According to the Medal of Honor Historical Society of the United States, there have been 3,524 Medals of Honor awarded to 3,505 individuals since the decoration's creation, with over 40% awarded for actions during the American Civil War.In 1990, Congress designated March 25 annually as \"National Medal of Honor Day\". Since 1948, the Medal of Honor and all service decorations awarded to members of the armed forces by any of the armed services have been afforded special protection under U.S. law against any unauthorized adornment, sale, or manufacture, which includes any associated ribbon or badge.", "developer": ["DICE", "Danger Close Games"], "genre": "First-person shooter", "date_release": "2010-10-08"}, "Medal of Honor: Warfighter": {"producer": "Greg Goodrich", "composer": "Ramin Djawadi", "description": "Medal of Honor: Warfighter is a first-person shooter video game developed by Danger Close Games and published by Electronic Arts. It is a sequel to 2010's series reboot Medal of Honor and the fourteenth installment in the Medal of Honor series. The title was announced on February 23, 2012, and was released in North America on October 23, 2012, in Australia on October 25, 2012, and in Europe on October 26, 2012 on Microsoft Windows, PlayStation 3, and Xbox 360. The games' single-player campaign picks up where Medal of Honor left off, as it reveals U.S. special forces operator Preacher returning home to find his family torn apart from years of deployment around the world. Upon release, the game received mixed to negative reviews; criticism was aimed at the low texture quality on consoles, glitches, confusing storyline and poor artificial intelligence.", "developer": ["Danger Close Games"], "genre": "First-person shooter", "date_release": "2012-10-23"}, "Medieval: Total War": {"producer": "Luci Black", "composer": "Jeff van Dyck", "description": "Medieval II: Total War is a turn-based strategy and real-time tactics video game developed by The Creative Assembly and published by Sega. It was released for Microsoft Windows on  10 November 2006. Feral Interactive published versions of the game for macOS and Linux on 14 January 2016. It is the sequel to 2002's Medieval: Total War and the fourth title in the Total War series.\nThe game is set between the years 1080 and 1530. Like the original Medieval: Total War, it focuses on medieval warfare, religion and politics in Europe, North Africa and the Middle East.", "developer": ["The Creative Assembly"], "genre": "Turn-based strategy", "date_release": "2002-08-20"}, "Medieval II: Total War": {"composer": null, "description": "Medieval II: Total War is a turn-based strategy and real-time tactics video game developed by The Creative Assembly and published by Sega. It was released for Microsoft Windows on  10 November 2006. Feral Interactive published versions of the game for macOS and Linux on 14 January 2016. It is the sequel to 2002's Medieval: Total War and the fourth title in the Total War series.\nThe game is set between the years 1080 and 1530. Like the original Medieval: Total War, it focuses on medieval warfare, religion and politics in Europe, North Africa and the Middle East.", "developer": ["The Creative Assembly"], "genre": "Turn-based strategy", "date_release": "2006-11-11"}, "MegaRace": {"composer": "Stéphane Picq", "description": "MegaRace is a racing video game created by Cryo. It features pre-rendered 3-D graphics and over twenty minutes of full motion video of fictional game show host, Lance Boyle. It was released for DOS in 1993. It was then released for the Sega CD and the 3DO the following year. It spawned two sequels, MegaRace 2 and MegaRace 3.", "developer": ["Cryo Interactive"], "genre": "Racing video game", "date_release": null}, "MegaRace 2": {"description": "MegaRace 2 is a vehicular combat racing released by Cryo in 1996, for the PC. It was published by Mindscape and is the first sequel of the original MegaRace, which was later followed by MegaRace 3.\nThis game features host Lance Boyle (Christian Erickson), joined by his assistant Lucinda (Alice Evans). The player is an \"enforcer\", attempting to win a series of races against computer opponents, by finishing in first place, or destroying their cars, automatically disqualifying them.\nMicroïds, owners of the Cryo brand, made the game available on GOG.com on April 30, 2009 alongside the first MegaRace. It also received a version for OS X on June 18, 2013 via GOG.com.", "developer": ["Cryo Interactive"], "genre": "Racing video game", "date_release": null}, "MegaRace 3": {"description": "MegaRace 3 is a racing/vehicular combat video game developed by Cryo Interactive in 2002, released for Windows and the Sony PlayStation 2. MegaRace 3 is the third game in the MegaRace series, after MegaRace and MegaRace 2.\nThis game also features host, Lance Boyle, played by Christian Erickson. It renders the game graphics in full real-time 3D, unlike the previous two games.\nMicroïds, owners of the Cryo brand, made the game available on GOG.com on 2 June 2009.", "developer": ["Cryo Interactive"], "genre": "Racing video game", "date_release": "2002-01-09"}, "Metal Gear": {"composer": null, "description": "Metal Gear (Japanese: メタルギア, Hepburn: Metaru Gia) is a series of action-adventure stealth video games created by Hideo Kojima and developed and published by Konami. The first game, Metal Gear, was released in 1987 for MSX home computers. The player often takes control of a special forces operative (usually Solid Snake or Big Boss), who is assigned the task of finding the titular superweapon \"Metal Gear\", a bipedal walking tank with the ability to launch nuclear weapons. Liquid Snake, Solid's twin brother, appears as an antagonist taking control of U.S. special forces unit FOXHOUND. \nSeveral sequels have been released for multiple consoles, which have expanded the original game's plot, adding characters opposing and supporting Snake, while there have also been a few prequels exploring the origins of Metal Gear and recurring characters. The third game in the series, Metal Gear Solid for the PlayStation, marked the beginning of a whole new line of 3D for Metal Gear. As of March 2018, over 53.8 million copies of games in the franchise have been sold worldwide, with individual installments critically and commercially acclaimed and receiving several awards.\nThe series is credited for pioneering and popularizing stealth video games and \"cinematic video games\". Notable traits of the series include stealth mechanics, cinematic cutscenes, intricate storylines, offbeat and fourth wall humour, and exploration of cyberpunk, dystopian, political and philosophical themes, with references to Hollywood films to add flavor. The franchise has also been adapted into other media, such as comics, novels, and drama CDs. Solid Snake also appeared as a guest character in Super Smash Bros. Brawl and Super Smash Bros. Ultimate.", "developer": ["Konami"], "genre": "Action-adventure", "date_release": "1987-07-07"}, "Metal Gear 2: Solid Snake": {"composer": null, "description": "Metal Gear 2: Solid Snake is an overhead action-adventure stealth video game released by Konami for the MSX2 computer platform in 1990. It serves as a direct sequel to the MSX2 version of the original Metal Gear, written and designed by series's creator Hideo Kojima, who conceived the game in response to Snake's Revenge, a separately-produced sequel that was being developed at the time for the NES specifically for the North American and European markets. The MSX2 version of Metal Gear 2 was only released in Japan, although Kojima would later direct another sequel titled Metal Gear Solid, which was released worldwide for the PlayStation in 1998 to critical acclaim. This later led to Metal Gear 2 being re-released alongside the original Metal Gear as additional content in the Subsistence version of Metal Gear Solid 3 for the PlayStation 2 in 2005. It was also included in the HD remastered ports of Metal Gear Solid 3 released for PlayStation 3, Xbox 360 and PlayStation Vita and was given a stand-alone re-release in Japan as a downloadable game for mobile phones and the Wii Virtual Console.\nSet in 1999, a few years after the events of the original game, Solid Snake must infiltrate a heavily defended territory known as Zanzibar Land to rescue a kidnapped scientist and destroy the revised \"Metal Gear D\". The game significantly evolved the stealth-based game system of its predecessor \"in almost every way\", introduced a complex storyline dealing with themes such as the nature of warfare and nuclear proliferation, and is considered \"one of the best 8 bit games ever made.\"", "developer": ["Konami"], "genre": "Action-adventure", "date_release": "1990-07-20"}, "Metal Gear Rising: Revengeance": {"producer": "Atsushi Inaba", "composer": "Jamie Christopherson", "description": "Metal Gear Rising: Revengeance is an action hack and slash video game developed by PlatinumGames and published by Konami Digital Entertainment. Released for the PlayStation 3, Xbox 360 and Microsoft Windows, it is a spin-off in the Metal Gear series, and is set four years after the events of Metal Gear Solid 4: Guns of the Patriots. In the game, players control Raiden, a cyborg who confronts the private military company Desperado Enforcement, with the gameplay focusing on fighting enemies using a sword and other weapons to perform combos and counterattacks. Through the use of Blade Mode, Raiden can dismember cyborgs in slow motion and steal parts stored in their bodies. The series' usual stealth elements are also optional to reduce combat.\nThe game was originally being developed internally by Kojima Productions, who announced the game in 2009 under the title of Metal Gear Solid: Rising. However, the team met with difficulties in developing a game based on swordplay, so executive producer Hideo Kojima postponed its development until a solution could be found. The project resurfaced in late 2011 under its finalized title, with PlatinumGames as the new developer. The game underwent significant changes in its play mechanics and storyline under PlatinumGames' involvement, although Kojima Productions retained responsibility for the game's overall plot and Raiden's design.\nUpon its worldwide release in February 2013, Metal Gear Rising: Revengeance was well-received by critics, being praised for its sophisticated cutting system, its use of Metal Gear elements to complement the story despite the game's focus on action, its soundtrack, and its boss fights; some criticism was directed at its camera and the length of the story mode. The game also enjoyed positive sales, with the three versions selling over 1.1 million copies. While those involved in the game's production have expressed desire to develop a sequel, such prospects have yet to come to fruition due to the ongoing conflicts between Konami and Kojima Productions.", "developer": ["PlatinumGames"], "genre": "Action", "date_release": "2014-01-09"}, "Metal Gear Solid": {"producer": null, "composer": null, "description": "Metal Gear Solid is a stealth game developed by Konami and released for the PlayStation in 1998. It was directed, produced, and written by Hideo Kojima, and follows the MSX2 video games Metal Gear and  Metal Gear 2: Solid Snake, which Kojima also worked on. The game was unveiled in the Tokyo Game Show in 1996 and shown in the Electronic Entertainment Expo in 1997.The game follows Solid Snake, a soldier who infiltrates a nuclear weapons facility to neutralize the terrorist threat from FOXHOUND, a renegade special forces unit. Snake must liberate two hostages, the head of DARPA and the president of a major arms manufacturer, confront the terrorists, and stop them from launching a nuclear strike. Cinematic cutscenes were rendered using the in-game engine and graphics, and voice acting was used throughout.Metal Gear Solid was well received, shipping more than six million copies, along with 12 million demos, and scoring an average of 94/100 on the aggregate website Metacritic. It is regarded as one of the greatest and most important video games of all time and helped popularize the stealth genre and in-engine cinematic cutscenes. Its success prompted the release of an expanded version for the PlayStation and PC, Metal Gear Solid: Integral, and a GameCube remake, Metal Gear Solid: The Twin Snakes. The game was followed by Metal Gear Solid 2: Sons of Liberty and numerous other sequels and other media, including a radio drama, comics, and novels.", "developer": ["KCEJ"], "genre": "Action-adventure", "date_release": "1998-09-03"}, "Metal Gear Solid 2: Substance": {"producer": "Hideo Kojima", "composer": null, "description": "Metal Gear Solid 2: Sons of Liberty is an action-adventure stealth game developed and published by Konami for the PlayStation 2 on November 2001. It is the fourth Metal Gear game written and directed by Hideo Kojima and is a direct sequel to the original Metal Gear Solid. An expanded edition, titled Metal Gear Solid 2: Substance, was released the following year for Xbox and Microsoft Windows in addition to the PlayStation 2.\nThe story revolves around the \"Big Shell,\" a massive offshore clean-up facility seized by a group of terrorists who call themselves the \"Sons of Liberty.\" They demand an enormous ransom in exchange for the life of the President of the United States and threaten to destroy the facility and create a cataclysmic environmental disaster if their demands are not met. The motives and identities of many of the antagonists and allies change throughout the course of the game, as the protagonists discover a world-shaking conspiracy constructed by a powerful organization known as the Patriots.\nThe game had sold over seven million copies worldwide, and received acclaim for its gameplay, graphics, and attention to detail. However, critics were initially divided on the protagonist and the philosophical nature and execution of the game's storyline, which explores themes such as memetics, social engineering, political conspiracies, censorship, artificial intelligence, existentialism, and postmodernism. Metal Gear Solid 2 has since been considered to be one of the greatest video games of all time, as well as a leading example of artistic expression in video games. The game is considered to be ahead of its time, for dealing with themes that later became culturally relevant in the 2010s, drawing comparisons to concepts such as social media, news feeds, post-truth politics, fake news, alternative facts and echo chambers.", "developer": ["KCEJ", "Success"], "genre": "Action-adventure", "date_release": "2003-03-27"}, "Metal Gear Solid V: Ground Zeroes": {"producer": [null, null, null], "composer": null, "description": "Metal Gear Solid V: Ground Zeroes is an action-adventure stealth video game developed by Kojima Productions and published by Konami. It was released for PlayStation 3, PlayStation 4, Xbox 360 and Xbox One in March 2014, and for Microsoft Windows via Steam in December 2014. It is the eighth game in the Metal Gear series directed, written and designed by Hideo Kojima, and serves as a prologue to Metal Gear Solid V: The Phantom Pain, which was released the following year.Set in 1975, a few months after the events of Metal Gear Solid: Peace Walker, the story follows Snake a.k.a. \"Big Boss\" as he infiltrates an American black site in Cuba called Camp Omega, attempting to rescue Cipher agent Paz Ortega Andrade and former Sandinista child soldier Ricardo \"Chico\" Valenciano Libre. The game offers players new sneaking and traversal methods as well as the choice in what order the story events take place by selecting missions in any order they chose.\nGround Zeroes was originally developed as a mission for The Phantom Pain but an extended development time resulted in director Hideo Kojima splitting the specific portion of the game as a stand-alone product so that players could get early access to Metal Gear Solid V. Critical reception to the game was generally positive, with praise aimed towards its mechanics, voice acting, story, and graphics, while the majority of the criticism was aimed towards its short length. Metal Gear Solid V: The Definitive Experience, a bundle that includes both Ground Zeroes and The Phantom Pain, along with all additional content for both games, was released in October 2016.", "developer": ["Kojima Productions"], "genre": "Action-adventure", "date_release": "2015-09-01"}, "Metal Gear Solid V: The Phantom Pain": {"producer": [null, null, null], "composer": null, "description": "Metal Gear Solid V: The Phantom Pain is a stealth game developed by Kojima Productions and published by Konami. It was released worldwide for Microsoft Windows, PlayStation 3, PlayStation 4, Xbox 360 and Xbox One on September 1, 2015. It is the ninth installment in the Metal Gear series that was directed, written and designed by Hideo Kojima following Metal Gear Solid V: Ground Zeroes, a stand-alone prologue released the previous year, as well as his final work at Konami.\nSet in 1984, nine years after the events of Ground Zeroes and eleven years before the events of the original Metal Gear, the story follows mercenary leader Punished \"Venom\" Snake as he ventures into Soviet-occupied Afghanistan and the Angola–Zaire border region to exact revenge on the people who destroyed his forces and came close to killing him during the climax of Ground Zeroes. It carries over the tagline of Tactical Espionage Operations first used in Metal Gear Solid: Peace Walker.\nThe Phantom Pain was critically acclaimed upon release, with its gameplay drawing praise for its variety of mechanics and interconnected systems, which allow a high degree of player freedom in approaching objectives. While the story was acknowledged for its emotional power and exploration of mature themes, its writing and focus were criticized as lacking for a Metal Gear title, with further scrutiny over the story's second half and ending that left several plot points unresolved; this was linked to conclusive evidence of removed content, which led some to suggest that the game was released unfinished. Despite this, The Phantom Pain received perfect review scores from several publications and was described by some critics as one of the greatest stealth games of all time. A complete edition that bundles The Phantom Pain and Ground Zeroes together, titled Metal Gear Solid V: The Definitive Experience, was released in October 2016.", "developer": ["Kojima Productions"], "genre": "Action-adventure", "date_release": "2015-09-01"}, "Metro 2033": {"composer": null, "description": "Metro 2033 (Russian: Метро 2033) is a 2002 post-apocalyptic fiction novel by Russian author Dmitry Glukhovsky. It is set within the Moscow Metro, where the last survivors hide after a global nuclear holocaust. It has been followed by two sequels, Metro 2034 and Metro 2035, and spawned the vast Metro media franchise. The book's English edition was published as a tie-in with its video game adaptation in 2010.", "developer": ["4A Games"], "genre": "Post-apocalyptic", "date_release": "2010-03-16"}, "Metro: Last Light": {"composer": "Alexei Omelchuk", "description": "Metro: Last Light is a post-apocalyptic-themed, first-person shooter video game with stealth and survival horror elements. It was developed by Ukrainian studio 4A Games, published by Deep Silver, distributed by Square Enix in North America for Microsoft Windows, PlayStation 3 and Xbox 360 in May 2013. A remastered version of the game was released for PlayStation 4 and Xbox One in August 2014 as Metro: Last Light Redux within the Metro Redux package.\nA sequel to the video game Metro 2033, its story follows Artyom, a young soldier living in the Moscow Metro after a devastating nuclear war. Tasked with finding the mysterious Dark Ones, Artyom must venture to different parts of the metro system, and the surface filled with radiated gases, and fight against different factions and mutated monsters. The game improves on various gameplay mechanics of 2033, and introduces elements such as weapon customization.\nDeveloped by a team of about 80 people, Last Light is a direct sequel to 2033, with franchise creator Dmitry Glukhovsky writing the game's dialogue and main story outline. Multiplayer modes were planned but were eventually scrapped in order to focus on single-player, which the developers hoped would \"rekindle memories of Half-Life 2\". Originally set to be published by THQ, which provided a very limited budget for the game's development, Koch Media acquired it after THQ's bankruptcy. A Wii U version was planned but was ultimately canceled.\nThe game received generally positive reviews from critics. Praise was focused largely on its atmosphere, world design, tone, graphics, and gameplay, while criticism was directed particularly at the artificial intelligence and technical issues. The pre-order bonus Ranger mode, marketed as the definitive way of playing the game, triggered controversy. The game was a commercial success, with its first-week retail sales in the United States surpassing the lifetime retail sales of 2033. The game's novelization written by Glukhovsky was published as Metro 2035 in 2015. A sequel, Metro Exodus, was released in 2019.", "developer": ["4A Games"], "genre": "Post-apocalyptic", "date_release": "2013-05-14"}, "Microsoft Minesweeper": {"description": "Microsoft Minesweeper (formerly just Minesweeper, and also known as Flower Field) is a minesweeper-type computer game created by Curt Johnson, originally for IBM's OS/2, that was ported to Microsoft Windows by Robert Donner, both Microsoft employees at the time. First officially released as part of the Microsoft Entertainment Pack 1 in 1990, it was first included in the standard install of Windows 3.1 in 1992, replacing Reversi from Windows 3.0. Microsoft Minesweeper was included without major changes in all subsequent Windows releases until Windows Vista, at which time an updated version by Oberon Media replaced it. In Windows 8 and later the game is not included with a fresh Windows install, but Microsoft Studios has published an updated version of it, developed by Arkadium, on Windows Store.", "developer": ["Arkadium"], "genre": "\n", "date_release": "2012-01-01"}, "Middle-earth: Shadow of Mordor": {"producer": "Michael Forgey", "composer": null, "description": "Middle-earth: Shadow of Mordor is an open world  action-adventure and hack and slash video game developed by Monolith Productions and published by Warner Bros. Interactive Entertainment. The game was released for Microsoft Windows, PlayStation 4, and Xbox One in September 2014 and PlayStation 3 and Xbox 360 in November 2014. An original non-canon story set in the legendarium created by J. R. R. Tolkien, the game takes place between the events of The Hobbit and The Lord of the Rings. The player controls Talion, a Ranger who bonds with the wraith of the Elf Lord Celebrimbor, as the two set out to avenge the deaths of their loved ones. Players can engage in melee combat, and use wraith abilities to fight and manipulate enemies. The game introduces the Nemesis System, which allows the artificial intelligence of non-playable characters to remember their prior actions against the game's protagonist and react accordingly.\nThe game's development began in 2011. In order to create an accurate environment and be consistent with Tolkien's books, the developers consulted many people from Warner Brothers, as well as Peter Jackson, director of the Lord of the Rings and The Hobbit film trilogies. They also received assistance from Weta Workshop, who advised on the special effects. Monolith focused on the development of the PC, PlayStation 4, and Xbox One versions, while the development of the PlayStation 3 and Xbox 360 versions was outsourced to Behaviour Interactive.\nMiddle-earth: Shadow of Mordor received critical acclaim upon release. Most praise was directed at its combat, open-world design, and the Nemesis System. Some criticism was aimed at the game's story and boss battles. Shadow of Mordor marked the biggest launch for a game based upon Tolkien's universe, and would go on to win several awards from video gaming publications, including Game of the Year in 2015. The game was supported by downloadable content upon release. A sequel, Middle-earth: Shadow of War, was released in October 2017.", "developer": ["Monolith"], "genre": "Action-adventure", "date_release": "2014-09-30"}, "Might & Magic X: Legacy": {"composer": null, "description": "Might & Magic X: Legacy is the latest installment of the Might and Magic role-playing video game series, announced on March 21, 2013, developed by Limbic Entertainment and published by Ubisoft. Instead of being a sequel to Might and Magic IX the game follows the events of Might & Magic Heroes VI and is set in the world of Ashan. It was released on January 23, 2014 as a downloadable title for Microsoft Windows. An OS X version was released on April 16, 2014.The game focuses on events occurring in the Agyn Peninsula of Ashan, on the continent of Thallan, following the war created by the archangel Uriel. A coup has occurred in the city of Karthal, and a party of raiders who arrive in the region are drawn into a complex plot in the region that threatens to escalate tensions in the various nations.", "developer": ["Limbic Entertainment"], "genre": "RPG", "date_release": "2014-01-23"}, "Might and Magic VI": {"composer": null, "description": "Might and Magic VI: The Mandate of Heaven, commonly abbreviated to Might and Magic VI or simply  MM6, is a role-playing video game developed by New World Computing and published by 3DO in 1998. It is the sixth installment in the Might and Magic series, the sequel to Might and Magic V: Darkside of Xeen and the first of the Might and Magic titles to take place in the same world as Heroes of Might and Magic. It continues the storyline of Heroes of Might and Magic II, and takes place at the same time as Heroes of Might and Magic III in the series chronology.\nA critical success upon release, the game was compared favorably with its peer role-playing video games such as The Elder Scrolls II: Daggerfall and Ultima. It was universally praised for its non-linear, user-friendly premise, an interactive, detailed game world and a polished,  bug-free initial release. Modern retrospectives credit its tagline of \"Witness the rebirth of a legend\" as an appropriate harbinger of the renaissance of western RPGs, and credit Might and Magic VI as an important part of that revival.A Limited Edition version of the game was also released, including a cloth map of Enroth, a strategy guide and the first five games of the series on CD-ROM. It was followed by three sequels, with Might and Magic VII: For Blood and Honor directly continuing the story arc.", "developer": ["New World Computing"], "genre": "RPG", "date_release": "1998-04-30"}, "Might and Magic VII": {"producer": "Peter Ryu", "composer": "Paul Romero", "description": "Might & Magic Heroes VII is a turn-based strategy game in the Heroes of Might and Magic series. Like the other games in the series, players control leaders with magical abilities termed as \"heroes\", who recruit a variety of forces from strongholds. The heroes and their armies battle the opponents, who also use heroes to lead their forces. It features a campaign series of levels, standalone and multiplayer scenarios.\nIn 2016, the downloadable content Lost Tales of Axeoth was released. On August 4, 2016 Trial by Fire was released, featuring two new campaigns, new faction (fortress) and many gameplay improvements available for all owners of the main game as well. However, the expansion itself is sold as standalone. Along with the expansion the game was updated to feature Denuvo DRM (since version 2.0).  While all versions of MMH7 include a random map generator in the map editor, the Trial by Fire expansion added an in-game random map generator (which can also be used in other version of MMH7)Two months after the release of the last expansion Ubisoft announced that further game development was halted which left many critical bugs unresolved.", "developer": ["New World Computing"], "genre": "RPG", "date_release": "1999-05-15"}, "A Mind Forever Voyaging": {"description": "A Mind Forever Voyaging (AMFV) is a 1985 interactive fiction game designed and implemented by Steve Meretzky and published by Infocom. The name is taken from book three of The Prelude by William Wordsworth:\n\nAMFV is not a conventional Infocom adventure, having only a single puzzle near the end of the game. Unlike most other Infocom titles, particularly those written by Steve Meretzky, the game has a serious tone and a political theme, attributes which the company would revisit with the following year's Trinity. The game is among Infocom's most respected titles, although it was not a commercial success. It is also the first of the \"Interactive Fiction Plus\" line, meaning that AMFV has greater memory requirements, unlike earlier Infocom games that use a less advanced version of the company's Z-machine interpreter. It is Infocom's seventeenth game.  The game is explicitly intended as a polemical critique of Ronald Reagan's political policies.", "developer": ["Infocom"], "genre": "Interactive fiction", "date_release": "1985-08-14"}, "Minecraft": {"composer": "C418", "description": "Minecraft is a sandbox video game created by Swedish game developer Markus Persson and released by Mojang in 2011. The game allows players to build with a variety of different blocks in a 3D procedurally generated world, requiring creativity from players. Other activities in the game include exploration, resource gathering, crafting, and combat. Multiple game modes that change gameplay are available, including—but not limited to—a survival mode, in which players must acquire resources to build the world and maintain health, and a creative mode, where players have unlimited resources to build with. The Java Edition of the game allows players to modify the game with mods to create new gameplay mechanics, items, textures and assets. In September 2014, Microsoft announced a deal to buy Mojang and the Minecraft intellectual property for US$2.5 billion, with the acquisition completed two months later.\nMinecraft received critical acclaim and won numerous awards, and has been described as one of the most influential and greatest video games in history. Social media, parodies, adaptations, merchandise, and the MineCon convention played large roles in popularizing the game. It has also been used in educational environments, especially in the realm of computing systems, as virtual computers and hardware devices have been built in it. It is the single best-selling video game of all time, selling over 176 million copies across all platforms by late 2019, while having over 112 million monthly active players. A number of spin-off games have also been developed, such as Minecraft: Story Mode, Minecraft Earth, and Minecraft Dungeons.", "developer": ["Mojang"], "genre": "Sandbox", "date_release": "2011-11-18"}, "Minecraft: Story Mode": {"description": "Minecraft: Story Mode is an episodic point-and-click graphic adventure video game developed and published by Telltale Games, based on the sandbox video game Minecraft. The first five episodes of the game were released between October 2015 through March 2016, and an additional three episodes were released as downloadable content in mid-2016. The game was released for Microsoft Windows, macOS, PlayStation 3, PlayStation 4, Wii U, Nintendo Switch, Xbox 360, Xbox One, Android, iOS, Apple TV, and browser through Netflix. The game was developed in association with Mojang, the original developer of Minecraft. A retail version was released in December 2016.The game follows the episodic format that Telltale Games used for its titles The Walking Dead, The Wolf Among Us, Tales from the Borderlands, and Game of Thrones. The game centers around a new character named Jesse, who can be either male or female, as they and their allies attempt to save their world by defeating the Wither Storm.\nA second five-episode season was released by Telltale in July 2017, continuing the story from the first season and influenced by players' choices made during that season.", "developer": ["Mojang"], "genre": "Graphic adventure", "date_release": "2015-10-13"}, "Mirror's Edge": {"producer": "Owen O'Brien", "composer": "Solar Fields", "description": "Mirror's Edge is a first-person action-adventure platform video game developed by EA DICE and published by Electronic Arts. It was released for the Xbox 360 and PlayStation 3 in November 2008, and in January 2009 for Microsoft Windows. Mirror's Edge is powered by Unreal Engine 3, with the addition of a new lighting solution, developed by Illuminate Labs in association with DICE.\nMirror's Edge is set in a quasi-futuristic dystopian society, in which a network of 'runners', including the main character, Faith Connors, act as couriers to transmit messages while evading government surveillance. In the style of a three-dimensional platform game, the player guides Faith over rooftops, across walls, through ventilation shafts, and otherwise within urban environments, negotiating obstacles using movements inspired by parkour. \nThe game has a brightly colored, minimalist style and differs from most previous first-person perspective video games in allowing for a greater freedom of movement with regard to its 3D environment. This allows for a wider range of actions—such as sliding under barriers, tumbling, wall-running, and shimmying across ledges; in having no heads-up display; and in allowing a range of vision which incorporated the legs, arms, and torso of the character as frequently visible elements on-screen.\nMirror's Edge received positive reviews from critics, who praised its uniqueness and its expansive environments, while criticism has centred on its weakness of plot, trial and error gameplay, and short length. The game won the Annual Interactive Achievement Award for Adventure Game of the Year, and spawned a side-scroller mobile game, also titled Mirror's Edge, which was released for iPad in April 2010, for the iPhone in September 2010, and for Windows Phone in July 2012. A reboot, titled Mirror's Edge Catalyst, was released in June 2016.", "developer": ["EA Digital Illusions CE"], "genre": "First-person action-adventure", "date_release": "2008-11-12"}, "Monaco: What's Yours Is Mine": {"composer": "Austin Wintory", "description": "Monaco: What's Yours Is Mine is a stealth and action video game released in 2013 for the Xbox 360, Microsoft Windows, Mac OS X, and Linux; the latter three were developed and published by Pocketwatch Games and the Xbox 360 version was published by Majesco Entertainment.\nSeparate from the game's single-player mode, Monaco's cooperative mode allows up to four players to partake in heists and robberies in different locations. Players choose one of eight characters, each of which has a unique and beneficial skill. The story consists of four acts; the first three follow characters' recollections of prior experiences and the final act is played from the perspective of the police.\nDevelopment of Monaco began while lead developer Andy Schatz was working for TKO Software and before he founded his independent company, Pocketwatch Games. The soundtrack was composed by Austin Wintory. Andy Nguyen—whom Schatz met while he was looking for playtesters—helped with the development of Monaco as a level designer and producer, and also worked in festival booths. Majesco Entertainment handled the release of the Xbox 360 version after Microsoft Game Studios rejected it twice because of marketability problems.\nThe game was positively received by reviewers and won two awards at the 2010 Independent Games Festival. Critics praised the cooperative modes highly but said the single-player was inferior because there was less gameplay. Many comparisons were made between Monaco and other media, most commonly the heist film from 1960, Ocean's 11. Reviewers liked the art style and said the minimalist design suited the game.", "developer": ["Pocketwatch Games"], "genre": "Action", "date_release": "2013-04-24"}, "Mount & Blade": {"composer": "Jesse Hopkins", "description": "Mount & Blade is a medieval action role-playing game for Microsoft Windows, developed by the Turkish company TaleWorlds, and published by the Swedish company Paradox Interactive.\nMount & Blade initially received a mixed critical reception overall. Reviewers praised the game for its innovative combat mechanics, complex character skill system, and large modding community, but also criticized it for its repetitive quests, dialogues, and locations, as well as low graphics quality.A standalone expansion, Mount & Blade: Warband, was released in March 2010, and a spin-off stand-alone expansion, Mount & Blade: With Fire & Sword, based on the historical novel With Fire and Sword, was released in May 2011. As of 2015, the series sold over 6 million units. A sequel, Mount & Blade II: Bannerlord, is currently in production.", "developer": ["TaleWorlds Entertainment"], "genre": "Action RPG", "date_release": "2008-09-16"}, "Mount & Blade: Warband": {"composer": "Jesse Hopkins", "description": "Mount & Blade: Warband is the stand-alone expansion pack to the action role-playing video game Mount & Blade. Announced in January 2009, the game was developed by the Turkish company TaleWorlds Entertainment and was published by Paradox Interactive on March 30, 2010. The game is available as a direct download from the TaleWorlds website, through the Steam digital distribution software, as a DRM-free version from GOG.com, or as a DVD with required online activation. The macOS and Linux versions were released on July 10, 2014 through Steam.Warband expands on the original game by introducing a sixth faction (The Sarranid Sultanate), increasing political options, adding the ability for the player to start their own faction, and incorporating multiplayer modes. Reviews of the game were generally favourable, with the addition of multiplayer praised. The game places a focus on the horse-mounted combat and giving orders to one's warband in the field, such as telling archers to hold a position or infantry to use blunt weapons.\nAs of January 31, 2014, Paradox Interactive is no longer the publisher for Warband and has given publishing back to the developer.Warband was released for both the Xbox One and PlayStation 4 in September 2016 for most regions, with an Australian and New Zealand release on December 20, 2016.", "developer": ["TaleWorlds Entertainment"], "genre": "Action RPG", "date_release": "2010-03-30"}, "Mount & Blade: With Fire & Sword": {"description": "Mount & Blade: With Fire & Sword is a stand-alone expansion for the action role-playing video game Mount & Blade. The game is developed by Sich Studio and TaleWorlds and was published by Paradox Interactive in Europe. The game and its storyline is loosely based on the novel With Fire and Sword by Henryk Sienkiewicz, depicting Poland's 1648–1651 war against the Khmelnytsky Uprising in present-day Ukraine, and its sequels dealing with the invasion of Poland by Sweden and with Polish wars against the Ottoman Empire.", "developer": ["TaleWorlds Entertainment"], "genre": "Action RPG", "date_release": "2011-05-03"}, "MouseCraft": {"description": "MouseCraft is an adventure indie 3D video game, developed and published by Poland-based game studio Crunching Koalas, for Microsoft Windows, PlayStation 4 and PlayStation Vita.", "genre": "Puzzle", "date_release": "2014-06-09"}, "MVP Baseball 2005": {"description": "MVP Baseball 2005 is a baseball video game developed and published by Electronic Arts. It features then-Boston Red Sox left fielder Manny Ramirez on its cover. The game features full Major League Baseball, Minor League Baseball, and Major League Baseball Players Association licenses. It holds the 98th spot on IGN's reader's choice top 100 games ever as of 2006. As with previous versions of the game, the announcers are Duane Kuiper and Mike Krukow, real-life announcers for the San Francisco Giants.\nA PlayStation Portable version of the game, titled just MVP Baseball, was later released in May 2005.", "developer": ["EA Canada"], "genre": "Sports", "date_release": "2005-02-22"}, "Myth Makers: Super Kart GP": {"description": "Myth Makers Super Kart GP is a racing game from English developer/publisher Data Design Interactive. It was released in January 2006 for Windows. In February 2007, Data Design announced it would release the game on the Wii.", "genre": "Racing video game", "date_release": "2006-01-01"}, "Myth Makers: Trixie in Toyland": {"description": "Myth Makers: Trixie in Toyland is a platforming video game for the PC, PlayStation 2, and the Nintendo Wii. The game was created by UK-based Data Design Interactive.  It is one of three parts of their Myth Makers franchise of video games.", "genre": "Platformer", "date_release": "2005-08-19"}}