{"Team Fortress 2": {"composer": "Mike Morasky", "description": "Team Fortress 2 (TF2) is a team-based multiplayer first-person shooter video game developed and published by Valve Corporation. It is the sequel to the 1996 mod Team Fortress for Quake and its 1999 remake, Team Fortress Classic. It was released as part of the video game bundle The Orange Box in October 2007 for Microsoft Windows and the Xbox 360. A PlayStation 3 version followed in December 2007. The game was released for Windows as a standalone entry in April 2008 and was updated to support OS X in June 2010 and Linux in February 2013. It is distributed online through Valve's digital retailer Steam, with retail distribution being handled by Electronic Arts.\nIn Team Fortress 2, players join one of two teams comprising nine character classes, battling in a variety of game modes including capture the flag and king of the hill. The development is led by John Cook and Robin Walker, creators of the original Team Fortress. Announced in 1998, the game once had more realistic, militaristic visuals and gameplay, but this changed over the protracted nine-year development. After Valve released no information for six years, Team Fortress 2 regularly featured in Wired News' annual vaporware list among other ignominies. The finished Team Fortress 2 has cartoon-like visuals influenced by the art of J. C. Leyendecker, Dean Cornwell, and Norman Rockwell, and uses Valve's Source game engine.\nTeam Fortress 2 received critical acclaim for its art direction, gameplay, humor, and use of character in a multiplayer-only game. Valve continues to release new content, including maps, items, and game modes, as well as community-made updates and contributed content. In June 2011, it became free-to-play, supported by microtransactions for in-game cosmetics. A 'drop system' was also added and refined, allowing free-to-play users to periodically receive game equipment and items by use of a random number generator. Though the game had an unofficial competitive scene for many years, support for official competitive play through ranked matchmaking and an overhauled casual experience was added in July 2016.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "2007-10-09"}, "Team Fortress Classic": {"description": "Team Fortress Classic (also known as Team Fortress 1.5) is a 1999 first-person shooter video game developed and released by Valve Corporation. The game pits two teams against each other in online multiplayer matches; each team member plays as one of nine classes, each with different skills. The scenarios include capture the flag (CTF), territorial control, and escorting a \"VIP\" player.\nBased on the 1996 Quake modification known as just Team Fortress, Valve ported the game to the GoldSrc engine (used in Half-Life) as a way of promoting Half-Life's software development kit. Since the release of Team Fortress Classic, the game has undergone significant upgrades to the player models and game modes.", "developer": ["Valve Corporation"], "genre": "First-person shooter", "date_release": "1999-04-07"}, "Terraria": {"composer": "Scott Lloyd Shelly", "description": "Terraria is an action-adventure sandbox game developed by Re-Logic. The game was initially released for Microsoft Windows on May 16, 2011, and has since been released for other PC, consoles, handhelds, and mobile platform. Terraria features exploration, crafting, building, and combat with a variety of creatures in a procedurally generated 2D world. Terraria received generally positive critical reception upon release and praise given to its sandbox elements. By May 2019, the game had sold over 27 million copies across all platforms.", "developer": ["Re-Logic"], "genre": "Action-adventure", "date_release": "2011-05-16"}, "Thomas Was Alone": {"description": "Thomas Was Alone is an indie puzzle platformer video game created by Mike Bithell, originally released as a Flash-based browser game in October 2010. The game was expanded and released to Microsoft Windows and OS X systems in July 2012. PlayStation 3 and PlayStation Vita versions with new content were released in April 2013, while a Linux version was released as part of the game's inclusion in The Humble Indie Bundle 8 in May 2013. The game was released for iPad devices in May 2014, and for other iOS devices and Android devices in July 2014. The game was also released on Xbox One, PlayStation 4 and Wii U in November 2014.In the game, the player controls one or more simple rectangles representing several out-of-control artificial intelligence entities, working with the shapes to get each to their individual end points on each level. Each shape is characterized with a unique name and personality, including the eponymous Thomas, which are conveyed to the player through the use of a narrator voiced by Danny Wallace, whose performance earned the game a BAFTA Games Award.", "developer": ["Mike Bithell"], "genre": "Puzzle", "date_release": "2012-06-30"}, "The Adventures of Fatman": {"composer": "Mark Lovegrove", "description": "The Adventures of Fatman is a point and click adventure for Microsoft Windows released in 2003.", "genre": "Point-and-click adventure", "date_release": "2003-05-01"}, "The Adventures of Lomax": {"description": "The Adventures of Lomax (known in Europe as Lomax) is a spin-off video game of the Lemmings series. The player takes the role of Lomax, a lemming character that has to save his friends and animals from an evil doctor. The game was released for the PlayStation and Microsoft Windows in 1996. Kath Soucie provides the voice of Lomax.", "developer": ["Psygnosis"], "genre": "2D platformer", "date_release": "1996-10-22"}, "The Lord of the Rings Online": {"description": "The Lord of the Rings Online (previously titled The Lord of the Rings Online: Shadows of Angmar) is a massively multiplayer online role-playing game (MMORPG) for Microsoft Windows and OS X set in J. R. R. Tolkien's Middle-earth, taking place during the time period of The Lord of the Rings. Developed by Turbine, Inc., the game launched in North America, Australia, Japan, and Europe in spring 2007 as The Lord of the Rings Online: Shadows of Angmar. Players could create characters of four races and seven classes and adventure throughout the region of Eriador. The next fall, Mines of Moria expansion was released, adding the region of Moria and two new playable classes. It was followed by the Siege of Mirkwood in December, 2009. In 2010 the game underwent a shift from its original subscription-based payment model to being free-to-play, with a paid subscription and an in-game store.\nThe game saw continued development, alternating between expansions and free updates, which added new content in the regions of Isengard, Rohan and Gondor. In late 2016 it was announced that the publishing of the game would transfer from Warner Bros. Interactive Entertainment to Daybreak Game Company, with development being taken over by Standing Stone Games, made up of former Turbine staff. The game development continued and in 2017 the Mordor expansion was released, bringing the main storyline to a close. The story then shifted to showing how various inhabitants of Middle-earth deal with the downfall of Sauron, with a future expansion featuring Minas Morgul being hinted at.", "developer": ["Turbine, Inc."], "genre": "MMORPG", "date_release": "2007-04-27"}, "The Matrix Online": {"producer": null, "composer": "Nathan Grigg", "description": "The Matrix Online  (abbreviated as MxO) was a massively multiplayer online role-playing game (MMORPG) initially developed by Monolith Productions and later, a few months after launch, by Sony Online Entertainment. It was billed as a continuation of the storyline of The Matrix films, as The Wachowskis, the franchise's creators, gave their blessing to the notion of gamers \"inherit[ing] the storyline\". The game began closed beta-testing in June 2004 which was then opened for people who pre-ordered the game in November 2004. Warner Bros. and Sega released MxO on March 22, 2005 in the United States. It was released in Europe on April 15, 2005. In June 2005 it was announced that Warner Bros. sold the rights to the game to Sony Online Entertainment, and the game's development and operation was transitioned to the latter on August 15, 2005. Sony Online Entertainment shut down operation of the game on July 31, 2009.Ubisoft backed out of an agreement to co-publish the game, not long after canceling plans for another MMORPG. Ubisoft and Warner Bros. stated that this did not have a negative impact on their relationship. At the time, doubts about the game circled within the industry, based on the lackluster reception of the later two The Matrix films and an overcrowded MMORPG market.", "developer": ["Monolith Productions"], "genre": "Massively multiplayer online role-playing game", "date_release": "2005-03-22"}, "The Punisher (2005 video game)": {"producer": "Rick White", "composer": null, "description": null, "developer": ["Volition"], "genre": "Action", "date_release": "2004-04-12"}, "The Sacred Hero": {"description": null, "genre": "RPG", "date_release": null}, "The Secret World": {"producer": null, "composer": null, "description": "The Secret World is a massively multiplayer online role-playing video game set in a modern-day real world under attack from occult forces. Ragnar Tørnquist led development of the initial game for Funcom. The Secret World uses a subscription-optional, buy-to-play business model, requiring players only to buy the game with no additional subscription fees, with additional benefits to those members still paying a subscription.\nIn 2017, The Secret World was relaunched as Secret World Legends.In the game, the player's character joins one of three world-controlling secret societies attempting to repel, mitigate or exploit the attack of Lovecraftian entities and other immortal beings in coastal Maine, rural Egypt, Transylvania, a quarantined section of Tokyo, a utopian community outside South Africa's Capetown, and (planned) a section of the river Congo; and to advance their society's agenda over that of the others.\nThe game uses a contemporary setting, borrowing heavily from the horror fiction genre and folklore, with a fog-ringed, zombie-infested New England fishing village for the novice player, mummies and cultists in Egypt for the mid-level player, followed by vampires and werewolves in Transylvania and ghosts, robots, Oni and an interdimensional occult cancer in Tokyo. Mission content bleeds into player faction headquarters in London, Seoul and the DUMBO neighborhood in Brooklyn, and into the game's transport network, along the subterranean branches of Yggdrasil in Agartha.\nUnlike many other MMORPGs, there is no need to stop to use most of a character's attacks and abilities; as a result, combat is faster and movement-based. The character is free (and at higher levels, occasionally obliged) to redevelop their abilities on the go, to better prepare themselves for specific threats or better integrate into a group. Unlike traditional MMORPGs, advancement is primarily through equipment, using experience points to buy additional abilities and more powerful weapons.", "developer": ["Funcom"], "genre": "MMORPG", "date_release": "2012-07-03"}, "The Ship": {"description": "A ship is a large watercraft that travels the world's oceans and other sufficiently deep waterways, carrying passengers or goods, or in support of specialized missions, such as defense, research and fishing. Historically, a \"ship\" was a sailing vessel with at least three square-rigged masts and a full bowsprit. Ships are generally distinguished from boats, based on size, shape, load capacity, and tradition.\nShips have been important contributors to human migration and commerce. They have supported the spread of colonization and the slave trade, but have also served scientific, cultural, and humanitarian needs. After the 15th century, new crops that had come from and to the Americas via the European seafarers significantly contributed to the world population growth. Ship transport is responsible for the largest portion of world commerce.\nAs of 2016, there were more than 49,000 merchant ships, totaling almost 1.8 billion dead weight tons. Of these 28% were oil tankers, 43% were bulk carriers, and 13% were container ships.", "genre": "First-person shooter", "date_release": "2007-04-09"}, "The Sims": {"producer": "Kana Ryan", "composer": null, "description": "The Sims is a series of life simulation video games developed by Maxis and published by Electronic Arts. The franchise has sold nearly 200 million copies worldwide, and it is one of the best-selling video games series of all time.The games in the Sims series are largely sandbox games, in that they lack any defined goals (except for some later expansion packs and console versions which introduced this gameplay style). The player creates virtual people called \"Sims\" and places them in houses and helps direct their moods and satisfy their desires. Players can either place their Sims in pre-constructed homes or build them themselves. Each successive expansion pack and game in the series augmented what the player could do with their Sims.\nThe Sims series is part of larger Sim series.", "developer": ["Edge of Reality", "Maxis"], "genre": "Life simulation", "date_release": "2000-02-11"}, "The Sims 2": {"producer": null, "composer": "Mark Mothersbaugh", "description": "The Sims 2 is a 2004 strategic life simulation video game developed at the Redwood Shores studio of Maxis and published by Electronic Arts. It is the sequel to The Sims.The game has the same concept as its predecessor: players control their Sims in various activities and form relationships in a manner similar to real life. The Sims 2, like its predecessor, does not have a defined final goal; the gameplay is open-ended. Sims have life goals, wants and fears, the fulfillment of which can produce both positive or negative outcomes. All Sims age, and can live to 90 sim days depending on the degree to which their aspirations are fulfilled. The Sims 2 builds on its predecessor by allowing Sims to age through six stages of life and incorporating a 3D graphics engine. Although gameplay is not linear, storylines exist in the game's pre-built neighborhoods. Pleasantview is based 25 years after the town in the original The Sims. Strangetown's storyline is based on the supernatural, and is loosely connected with Pleasantview. Veronaville's characters are based on Shakespearean characters.\nThe Sims 2 was released on September 14, 2004 for Microsoft Windows. A port to macOS was released on June 17, 2005. Eight expansion packs and nine stuff packs were subsequently released. In addition several console versions have been released. The Sims 2 is offered on mobile platforms, with manufacturers such as Nokia offering The Sims 2 from the Ovi Store. A sequel, The Sims 3, was released in June 2009.The Sims 2 was a commercial success, selling one million copies in its first ten days, a record at the time.  During April 2008, The Sims 2 website announced that 100 million copies of The Sims series had been sold.The Sims 2 was well received by critics, gaining a 90% score from aggregators Metacritic and GameRankings. By March 2012, The Sims 2 had sold 13 million copies over all platforms with over six million PC copies, making it one of the best-selling PC games of all-time.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2004-09-14"}, "The Sims 2: Apartment Life": {"description": "The Sims 2: Apartment Life is the eighth and final expansion pack in the Sims 2 video game series.\nA flyer included in later copies of The Sims 2: FreeTime expansion pack and The Sims 2: Kitchen & Bath Interior Design Stuff Pack announced Apartment Life, which brings magic back to the franchise and new features like Sims' relationships with neighbors inhabiting the same apartment building, interacting with an NPC landlord, a new reputation system, and new activities for publicly accessible lots.Pre-release began on August 27, 2008, via the EA store.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2008-08-25"}, "The Sims 2: Bon Voyage": {"description": "The Sims 2: Bon Voyage is the sixth expansion pack released in The Sims 2 series of PC games. It was released on September 4, 2007 in North America and September 6, 2007 in Europe for Microsoft Windows. For Mac OS X, it was released on December 17, 2007 by Aspyr Media. It is an expansion that focuses mainly on traveling, similar to The Sims: Vacation expansion pack for the original game. The first expansion pack for The Sims 3, called The Sims 3: World Adventures, is a re-imagining of this theme of traveling and exploration.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2007-09-04"}, "The Sims 2: FreeTime": {"description": "The Sims 2: FreeTime is the seventh expansion pack in The Sims 2 video game series.\nA flyer included in The Sims 2: Bon Voyage expansion pack and The Sims 2 Teen Style Stuff announced this expansion and read: \"Now your Sims can enjoy hobbies! Your Sims will have fun taking up a variety of creative, intellectual, or active leisure-time pursuits. They can even meet Sims that share their interests and expand their social relationships. Develop your Sims' skills while they pursue their true pastime passions. Will your Sims stumble reaching for new goals or find a new sense of fulfillment?\"\nWith this expansion, Sims can pursue employment in five new careers including dance, entertainment, intelligence, oceanography and architecture.\nThe ten hobbies included in the expansion pack are fitness, cooking, music/dance, sports, nature, science, films/literature, gaming, tinkering, and arts/crafts. Every Sim is created with a predetermined \"preferred\" hobby which cannot be modified by the player. While the bar is filled, the Sim is \"in the zone\", shown graphically as a white glow around the Sim; causing their needs to decay more slowly than usual, as to allow extra time on that hobby.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2008-02-22"}, "The Sims 2: Nightlife": {"composer": null, "description": "The Sims 2: Nightlife is the second expansion pack for The Sims 2, which was released on September 13, 2005 (USA and Canada) and September 16, 2005 (European Union, Australia and New Zealand). It was released for Mac OS X on March 27, 2006. The expansion pack centers on the new downtown area, which has various activities, such as bowling, karaoke, dining and dancing, as well as a photo booth, and includes a dating minigame which allows player to engage in their Sims' relationships in greater depth. Not to be confused with The Sims 3: Late Night for The Sims 3.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2005-09-13"}, "The Sims 2: Open for Business": {"description": "The Sims 2: Open for Business is the third expansion pack for The Sims 2, released on March 3, 2006, which allows Sims to run a home or community lot based business. Aspyr released a port of the game for Mac OS X on September 4, 2006. Although it is not a direct reimagining of Open for Business, The Sims 3: Ambitions introduces a related theme of following playable sims to work and creating salable items using numerous skills.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2006-03-06"}, "The Sims 2: Seasons": {"description": "The Sims 2: Seasons is the fifth expansion pack for The Sims 2. It was developed at the Redwood Shores studio of Maxis and was released on March 1, 2007 in North America, and was followed by the European release on March 2, 2007. Aspyr released a Mac OS X port of the game in June 2007.The Sims 2: Seasons enhances gameplay by adding seasons and weather mechanics. Each season lasts around five sim days and brings with it new challenges and gameplay options. A new type of sim known as a plant-sim is also added. They operate using different mechanics to normal sims. The expansion pack introduced a new neighbourhood called Riverblossom Hills. Like previous games, it has a storyline but no linear gameplay.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2007-02-23"}, "The Sims 2: University": {"description": "The Sims 2 is a 2004 strategic life simulation video game developed at the Redwood Shores studio of Maxis and published by Electronic Arts. It is the sequel to The Sims.The game has the same concept as its predecessor: players control their Sims in various activities and form relationships in a manner similar to real life. The Sims 2, like its predecessor, does not have a defined final goal; the gameplay is open-ended. Sims have life goals, wants and fears, the fulfillment of which can produce both positive or negative outcomes. All Sims age, and can live to 90 sim days depending on the degree to which their aspirations are fulfilled. The Sims 2 builds on its predecessor by allowing Sims to age through six stages of life and incorporating a 3D graphics engine. Although gameplay is not linear, storylines exist in the game's pre-built neighborhoods. Pleasantview is based 25 years after the town in the original The Sims. Strangetown's storyline is based on the supernatural, and is loosely connected with Pleasantview. Veronaville's characters are based on Shakespearean characters.\nThe Sims 2 was released on September 14, 2004 for Microsoft Windows. A port to macOS was released on June 17, 2005. Eight expansion packs and nine stuff packs were subsequently released. In addition several console versions have been released. The Sims 2 is offered on mobile platforms, with manufacturers such as Nokia offering The Sims 2 from the Ovi Store. A sequel, The Sims 3, was released in June 2009.The Sims 2 was a commercial success, selling one million copies in its first ten days, a record at the time.  During April 2008, The Sims 2 website announced that 100 million copies of The Sims series had been sold.The Sims 2 was well received by critics, gaining a 90% score from aggregators Metacritic and GameRankings. By March 2012, The Sims 2 had sold 13 million copies over all platforms with over six million PC copies, making it one of the best-selling PC games of all-time.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2005-03-11"}, "The Sims 3": {"producer": null, "composer": null, "description": "The Sims 3 is the third major title in the life simulation video game developed by the Redwood Shores studio of Maxis and published by Electronic Arts. It is the sequel to The Sims 2. It was announced that it was in development for PlayStation 3 and Wii in November 2006, and later announced for OS X and Microsoft Windows. It was first released on June 2, 2009 simultaneously for OS X and Microsoft Windows – both versions on the same disc. Smartphone versions were also released on June 2, 2009. Console versions were released for PlayStation 3, Xbox 360, and Nintendo DS in October 2010 and a month later for the Wii. The Windows Phone version was made available on the Windows Phone Store on October 15, 2010. A Nintendo 3DS version, released on March 27, 2011, was one of its launch titles.The Sims 3 was a commercial success, selling 1.4 million copies in its first week. Critics issued mostly positive reviews, with an 86/100 score from aggregator Metacritic. The game has sold over ten million copies worldwide since its 2009 release, making it one of the best-selling PC games of all time. The last of eleven expansion packs, Into the Future, was released in October 2013. A sequel, The Sims 4, was released in September 2014 for PC and in November 2017 for consoles.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2009-06-02"}, "The Sims 3: Generations": {"description": "The Sims 3: Generations is the fourth expansion pack for The Sims 3, which EA announced by press release and video trailer on April 5, 2011. The game was released on May 31, 2011. It contains elements of The Sims 2: Family Fun Stuff, The Sims: House Party, The Sims 2: Teen Style Stuff, The Sims 2: FreeTime, The Sims 2: University, and The Sims 2: Celebration! Stuff. It is the first major expansion pack that does not contain a game manual, instead containing a simple install guide with the serial code attached. All packs from this point on do not contain a manual.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2011-05-31"}, "The Sims 3: Into the Future": {"description": "The Sims 3: Into the Future is the eleventh and final expansion pack for The Sims 3 series from Electronic Arts and was released on October 22, 2013 in North America. It is available for both Windows and OS X. In Europe it was released on October 24, 2013 and in the United Kingdom on October 25, 2013.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2013-10-22"}, "The Sims 3: Island Paradise": {"description": "The Sims 3: Island Paradise is the tenth expansion pack for The Sims 3 series from Electronic Arts. It is available on both Windows and OS X. The release dates vary from continent to continent. It was released in the US on June 25, 2013, and on June 28, 2013 in Europe.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2013-06-25"}, "The Sims 3: Late Night": {"description": "The Sims 3: Late Night (LN) is the third expansion pack for the strategic life simulation computer game The Sims 3 and is similar to previous expansions The Sims 2: Nightlife for The Sims 2 and The Sims: Hot Date for The Sims. It incorporates some elements from The Sims: House Party, The Sims: Superstar, and The Urbz: Sims in the City.\nThis expansion pack also introduces a brand new city neighborhood named 'Bridgeport', based on the cities of San Francisco and Los Angeles, which is divided into an urban/downtown area, a less dense uptown area, and a hilly, affluent suburb.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2010-10-26"}, "The Sims 3: Seasons": {"description": "The Sims 3: Seasons is the eighth expansion pack for The Sims 3 on OS X and PC.  It was released on November 13, 2012 in North America, and on November 16 in Europe.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2012-11-13"}, "The Sims 3: Showtime": {"description": "The Sims 3: Showtime is the sixth expansion pack for The Sims 3 on OS X and Windows. It was released on March 2012. A limited collector's edition includes exclusive in-game content such as a stage and two costumes along with a poster based on American singer Katy Perry.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2012-03-06"}, "The Sims 3: Supernatural": {"description": "The Sims 3: Supernatural is the seventh expansion pack for The Sims 3 on OS X and PC. It was released on September 4, 2012 in North America and Greece.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2012-09-04"}, "The Sims 3: University Life": {"description": "The Sims 3: University Life is the ninth expansion pack for The Sims 3. It is not to be confused with The Sims 2's University Life Collection, which was released in 2009 and featured The Sims 2: University, as well as two stuff packs (IKEA Home Stuff and Teen Style Stuff).", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2013-03-05"}, "The Sims: Hot Date": {"description": "The Sims: Hot Date is the third expansion pack released for the strategic life-simulation computer game The Sims developed by Maxis and published by Electronic Arts. It was released on November 14, 2001 with overall positive reviews thanks to the addition of a downtown area outside the neighborhood, which became the set up for upcoming expansions packs in which new areas were added; it also served as the inspiration for later games including The Sims 2: Nightlife and The Sims 3: Late Night.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2001-11-14"}, "The Sims: House Party": {"producer": "Kana Ryan", "composer": null, "description": "The Sims is a strategic life-simulation video game developed by Maxis and published by Electronic Arts in 2000. It is a simulation of the daily activities of one or more virtual people (\"Sims\") in a suburban household near a fictional city. The game's development was led by Will Wright and the game was a follow-up to Wright's earlier SimCity series. The Sims original series had a total of seven expansion packs produced from 2000 to 2003, with expansions adding new items, characters, skins, and features. The game has had several subsequent sequels; The Sims 2 in 2004, The Sims 3 in 2009, and The Sims 4 in 2014.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2001-04-02"}, "The Sims: Livin' Large": {"description": "The Sims: Livin' Large (known as The Sims: Livin' It Up in Europe) is the first expansion pack released for the computer simulation game, The Sims. The pack includes new characters, careers, items, and features. This expansion pack is also part of The Sims Deluxe Edition and later compilations of the core game.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2000-08-27"}, "The Sims: Makin' Magic": {"producer": "Kana Ryan", "composer": null, "description": "The Sims is a strategic life-simulation video game developed by Maxis and published by Electronic Arts in 2000. It is a simulation of the daily activities of one or more virtual people (\"Sims\") in a suburban household near a fictional city. The game's development was led by Will Wright and the game was a follow-up to Wright's earlier SimCity series. The Sims original series had a total of seven expansion packs produced from 2000 to 2003, with expansions adding new items, characters, skins, and features. The game has had several subsequent sequels; The Sims 2 in 2004, The Sims 3 in 2009, and The Sims 4 in 2014.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2003-10-29"}, "The Sims: Superstar": {"producer": "Kana Ryan", "composer": null, "description": "The Sims is a strategic life-simulation video game developed by Maxis and published by Electronic Arts in 2000. It is a simulation of the daily activities of one or more virtual people (\"Sims\") in a suburban household near a fictional city. The game's development was led by Will Wright and the game was a follow-up to Wright's earlier SimCity series. The Sims original series had a total of seven expansion packs produced from 2000 to 2003, with expansions adding new items, characters, skins, and features. The game has had several subsequent sequels; The Sims 2 in 2004, The Sims 3 in 2009, and The Sims 4 in 2014.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2003-05-13"}, "The Sims: Unleashed": {"producer": "Kana Ryan", "composer": null, "description": "The Sims is a strategic life-simulation video game developed by Maxis and published by Electronic Arts in 2000. It is a simulation of the daily activities of one or more virtual people (\"Sims\") in a suburban household near a fictional city. The game's development was led by Will Wright and the game was a follow-up to Wright's earlier SimCity series. The Sims original series had a total of seven expansion packs produced from 2000 to 2003, with expansions adding new items, characters, skins, and features. The game has had several subsequent sequels; The Sims 2 in 2004, The Sims 3 in 2009, and The Sims 4 in 2014.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2002-01-07"}, "The Sims: Vacation": {"producer": "Kana Ryan", "composer": null, "description": "The Sims is a strategic life-simulation video game developed by Maxis and published by Electronic Arts in 2000. It is a simulation of the daily activities of one or more virtual people (\"Sims\") in a suburban household near a fictional city. The game's development was led by Will Wright and the game was a follow-up to Wright's earlier SimCity series. The Sims original series had a total of seven expansion packs produced from 2000 to 2003, with expansions adding new items, characters, skins, and features. The game has had several subsequent sequels; The Sims 2 in 2004, The Sims 3 in 2009, and The Sims 4 in 2014.", "developer": ["Maxis"], "genre": "Life simulation", "date_release": "2002-03-28"}, "The Song of Seven : Overture": {"description": "The William Tell Overture is the overture to the opera William Tell (original French title Guillaume Tell), whose music was composed by Gioachino Rossini. William Tell premiered in 1829 and was the last of Rossini's 39 operas, after which he went into semi-retirement (he continued to compose cantatas, sacred music and secular vocal music). The overture is in four parts, each following without pause.\nThere has been repeated use (and sometimes parody) of parts of this overture in both classical music and popular media, most famously as the theme music for The Lone Ranger in radio, television and film. Two different parts were also used, as theme music for the British television series The Adventures of William Tell, the fourth part (popularly identified in the US with The Lone Ranger) in the UK, and the third part, rearranged as a stirring march, in the US.\nFranz Liszt prepared a piano transcription of the overture in 1838 (S.552) which became a staple of his concert repertoire. There are also transcriptions by other composers, including versions by Louis Gottschalk for two and four pianos and a duet for piano and violin.", "genre": "Adventure", "date_release": "2016-05-17"}, "The Stanley Parable": {"composer": null, "description": "The Stanley Parable is an interactive storytelling and walking simulator video game designed by American developer Davey Wreden. The game was originally released on July 27, 2011 as a free modification for Half-Life 2. A high-definition stand-alone remake, including new story elements, was again designed by Davey Wreden together with Source engine modeler William Pugh, under the Galactic Cafe studio name. The remake was announced and approved via Steam Greenlight in 2012, and was released on October 17, 2013 for Microsoft Windows. Later updates of the game added support for OS X on December 19, 2013, and for Linux on September 9, 2015.\nWhile both the mod and the remake use the first-person perspective common to other Source engine mods, there are no combat or other action-based sequences. Instead, the player guides Stanley, the game's protagonist, through a surreal environment while the narrator, voiced in the remake by British actor Kevan Brighting, delivers exposition. The player has the opportunity to make numerous decisions on which paths to take, and because at times the narrator says what Stanley will do next, the player can choose to ignore the narration and make a different choice. Every choice made by the player is commented on by the narrator, and depending on the choices the player makes, they will encounter different endings to the game before it restarts.\nWreden envisioned the game after considering that most major video game titles confine the user to its rules, and considered how to construct a narrative to challenge that notion. Outside of Brighting's voice work as the narrator, Wreden built the modification himself, initially as a personal project for his career goals but soon expanding to a wider release once he had shown it to friends and other players. The modification received critical attention as a new variation of creating interactive storytelling within a game engine, and provided a thought-provoking narration to discuss with others on the nature of choice and predestination within video games.\nThe remake expanded the experience, recreating many of the original mod's decisions within new environments while adding several more story pathways that could be followed. The standalone game has received similar critical praise from journalists favoring the expanded narrative and commentary on player choice and decision-making in modern video games.\nAn expanded edition entitled The Stanley Parable: Ultra Deluxe is scheduled for release in 2019, which will include release on consoles together with additional content.", "developer": ["Galactic Cafe"], "genre": "Interactive fiction", "date_release": "2013-10-17"}, "The Sting!": {"description": "The Sting is a 1973 American caper film set in September 1936, involving a complicated plot by two professional grifters (Paul Newman and Robert Redford) to con a mob boss (Robert Shaw). The film was directed by George Roy Hill, who had directed Newman and Redford in the western Butch Cassidy and the Sundance Kid. Created by screenwriter David S. Ward, the story was inspired by real-life cons perpetrated by brothers Fred and Charley Gondorff and documented by David Maurer in his book The Big Con: The Story of the Confidence Man.\nThe title phrase refers to the moment when a con artist finishes the \"play\" and takes the mark's money. If a con is successful, the mark does not realize he has been cheated until the con men are long gone. The film is played out in distinct sections with old-fashioned title cards, the lettering and illustrations rendered in a style reminiscent of the Saturday Evening Post. The film is noted for its anachronistic use of ragtime, particularly the melody \"The Entertainer\" by Scott Joplin, which was adapted (along with others by Joplin) for the film by Marvin Hamlisch (and a top-ten chart single for Hamlisch when released as a single from the film's soundtrack). The film's success created a resurgence of interest in Joplin's work.The Sting was hugely successful at the 46th Academy Awards, being nominated for ten Oscars and winning seven, including Best Picture, Best Director and Best Writing (Original Screenplay). In 2005, The Sting was selected for preservation in the U.S. National Film Registry of the Library of Congress as being \"culturally, historically, or aesthetically significant.\"", "developer": ["Neo Software"], "genre": "Strategy", "date_release": "2001-07-01"}, "Thief": {"producer": [null, null], "composer": "Luc St-Pierre", "description": "In common usage, theft is the taking of another person's property or services without that person's permission or consent with the intent to deprive the rightful owner of it. The word is also used as an informal shorthand term for some crimes against property, such as burglary, embezzlement, larceny, looting, robbery, shoplifting, library theft, and fraud (obtaining money under false pretenses). In some jurisdictions, theft is considered to be synonymous with larceny; in others, theft has replaced larceny. Someone who carries out an act of or makes a career of theft is known as a thief. The act of theft is also known by other terms such as stealing, thieving, and filching.Theft is the name of a statutory offence in California, Canada, England and Wales, Hong Kong, Northern Ireland, the Republic of Ireland, and the Australian states of South Australia, and Victoria.", "developer": ["Eidos Montréal"], "genre": "Stealth", "date_release": "2014-02-25"}, "Thief II: The Metal Age": {"composer": "Eric Brosius", "description": "Thief II: The Metal Age is a 2000 stealth video game developed by Looking Glass Studios and published by Eidos Interactive. Like its predecessor Thief: The Dark Project, the game follows Garrett, a master thief who works in and around a steampunk metropolis called the City. The player assumes the role of Garrett as he unravels a conspiracy related to a new religious sect. Garrett takes on missions such as burglaries and frameups, while trying to avoid detection by guards and automated security.\nThief II was designed to build on the foundation of its predecessor. In response to feedback from players of Thief, the team placed a heavy focus on urban stealth in the sequel, and they minimized the use of monsters and maze-like levels. The game was made with the third iteration of the Dark Engine, which had been used previously to develop Thief and System Shock 2. Thief II was announced at the 1999 Electronic Entertainment Expo, as part of an extended contract between Looking Glass and Eidos to release games in the Thief series. Looking Glass neared bankruptcy as the game was developed, and the company was kept running by advances from Eidos.\nThief II received positive reviews from critics, and its initial sales were stronger than those of its predecessor. However, the game's royalties were processed slowly, which compounded Looking Glass's financial troubles. As a result, the company closed in May 2000, with plans for Thief III cancelled. The third game in the series, entitled Thief: Deadly Shadows, was developed by Ion Storm and published by Eidos in 2004. Thief 2X: Shadows of the Metal Age, a widely praised expansion mod for Thief II, was released in 2005. In 2014, Square Enix published a reboot of the series, developed by Eidos Montréal.", "developer": ["Looking Glass Studios"], "genre": "Stealth", "date_release": "2000-03-23"}, "Thief: The Dark Project": {"producer": "Josh Randall", "composer": "Eric Brosius", "description": "Thief: The Dark Project is a 1998 first-person stealth video game developed by Looking Glass Studios and published by Eidos Interactive. Set in a medieval steampunk metropolis called the City, players take on the role of Garrett, a master thief trained by a secret society who, while carrying out a series of robberies, becomes embroiled in a complex plot that ultimately sees him attempting to prevent a great power from unleashing chaos on the world.\nThief was the first PC stealth game to use light and sound as game mechanics, and combined complex artificial intelligence with simulation systems to allow for emergent gameplay. The game is notable for its use of first-person perspective for non-confrontational gameplay, which challenged the first-person shooter market and led the developers to call it a \"first-person sneaker\", while it also had influences in later stealth games such as Tom Clancy's Splinter Cell and Hitman.\nThe game received critical acclaim and has been placed on numerous hall-of-fame lists, achieving sales of half a million units by 2000, making it Looking Glass' most commercially successful game. It is regarded as one of the greatest video games of all time and helped popularize the stealth genre. Thief was followed by an expanded edition entitled Thief Gold (1999) which modified certain missions and included a few brand new levels, two sequels - Thief II: The Metal Age (2000), and Thief: Deadly Shadows (2004) - and a reboot of the series - Thief (2014). Thief was one of two games in the series that Looking Glass worked on before it was forced to close.", "developer": ["Looking Glass Studios"], "genre": "Stealth", "date_release": "1998-11-30"}, "Thief: Deadly Shadows": {"producer": "Denise Fulton", "composer": "Eric Brosius", "description": "Thief: Deadly Shadows is a stealth video game developed by Ion Storm for Microsoft Windows and Xbox that was released in 2004, on May 25 in North America and on June 11 in Europe. It is the third video game in the Thief series.\nIn Thief: Deadly Shadows the player takes the role of Garrett, a master thief. It is set in a fantasy world resembling a cross between the Late Middle Ages and the Victorian era, with more advanced steampunk technologies interspersed. One of the game's major new features was the ability to explore the City. While previous games sent Garrett straight from mission to mission, Thief: Deadly Shadows allows him to walk the City streets between missions where he can steal from passersby, spy on the townspeople's daily lives, and search for side quests in addition to major story missions. The game also introduced an ability to switch between first and third person views, and to flatten against walls.\nDevelopment for both platforms started simultaneously. Thief: Deadly Shadows received generally positive reviews. The level \"Robbing the Cradle\" received particular praise for its horror design. A reboot of the Thief series, Thief, was released by Eidos Montréal in 2014.", "developer": ["Ion Storm"], "genre": "Stealth", "date_release": "2004-05-25"}, "Titan Quest": {"producer": "Jeff Goodsill", "composer": null, "description": "Titan Quest is an action role playing hack and slash video game developed by Iron Lore Entertainment for Microsoft Windows personal computers. It was published by THQ in 2006. It was released on Steam in 2007, and later ported to mobile devices by DotEmu and released in 2016; later versions were published by THQ Nordic. Versions for PlayStation 4, Xbox One and Nintendo Switch were released in 2018. The story follows a player-created protagonist as they navigate Ancient Greece, Egypt and China on a quest to defeat the Titans after they escape from their ancient prison. The gameplay is similar to the Diablo series, with player navigation being handled with a mouse-driven tile-based interface, and gameplay revolving around role-playing mechanics and real-time combat. Three expansions were released for the game: Titan Quest: Immortal Throne in 2007, Titan Quest: Ragnarök in 2017 and Titan Quest: Atlantis in 2019.\nTitan Quest was envisioned by game designer Brian Sullivan as a role-playing game set in Ancient Greece similar to Age of Mythology. Production began in 2004 after a successful pitch to THQ. The script was written by Randall Wallace, while Sullivan acted as the designer. Despite being in a mythical setting, the team wanted to make the environments and towns feel as realistic as possible, leading to a large amount of research into ancient cultures. Enemies were inspired by the game's regional mythologies, with designs inspired by the stop-motion work of Ray Harryhausen. The music, composed by Scott Morton and Michael Verrette, was created to avoid the looping tracks of other games.\nFirst announced in 2005, Titan Quest received generally positive reviews when released, being both praised as a good example of the genre while at the same time being criticized for its traditional gameplay. Sales of the main game and its expansion have been estimated as approaching one million units. The mobile port was tricky for its developers due to adapting the game for touchscreen controls: like the console version, it received positive reviews upon release. The engine and gameplay of Titan Quest later became the foundation for Grim Dawn, a video game developed by team members from Iron Lore following the studio's closure. In 2016, an improved and expanded Anniversary Edition was released and received very positive reviews. On November 17, 2017, THQ Nordic released an expansion over ten years after Immortal Throne, entitled Titan Quest: Ragnarök.", "developer": ["Iron Lore Entertainment"], "genre": "RPG", "date_release": "2006-06-26"}, "Tom Clancy's Splinter Cell": {"producer": [null, null], "composer": "Michael Richard Plowman", "description": "Tom Clancy's Splinter Cell is a series of award-winning stealth video games, the first of which was released in 2002, and their tie-in novels. The protagonist, Sam Fisher, is a highly trained agent of a fictional  black-ops sub-division within the NSA, dubbed \"Third Echelon\". The player controls Fisher to overcome his adversaries in levels (created using Unreal Engine and emphasising light and darkness as gameplay elements). All the console and PC games in the series were positively received, and the series is commercially successful. The series, along with Assassin's Creed, is considered to be one of Ubisoft's flagship franchises, selling more than 31 million copies as of 2011.", "developer": ["Ubisoft Montreal", "Ubisoft Shanghai", "Gameloft"], "genre": "Stealth", "date_release": "2002-11-17"}, "Tom Clancy's Splinter Cell: Blacklist": {"producer": [null, null], "composer": null, "description": "Tom Clancy's Splinter Cell: Blacklist is an action-adventure stealth video game developed by Ubisoft Toronto and published by Ubisoft. The sixth installment of the Tom Clancy's Splinter Cell series, it is the sequel of Splinter Cell: Conviction. The game was released worldwide for Microsoft Windows, PlayStation 3, Wii U, and Xbox 360 in August 2013. In the game, players control Sam Fisher, a spymaster working for the Fourth Echelon, in a mission to stop the Engineers, a group of terrorists which is trying to coerce the United States into recalling all of its troops stationed abroad. Blacklist's gameplay is similar to its predecessors, with players tasked with completing objectives and defeating enemies. Blacklist marks the return of the asymmetrical multiplayer mode Spies vs. Mercs, which was introduced in Pandora Tomorrow.\nIt is the first title developed by Ubisoft Toronto, a studio founded by Ubisoft in 2009. The game was directed by Maxime Béland, who had worked on Conviction, and produced by Jade Raymond. The game endeavors to combine elements of its predecessors, including the action focus of Conviction and the stealth focus of the older games. To prepare for this game, Béland studied reviews and feature lists of the latter. Blacklist is the first Splinter Cell game starring Eric Johnson as Sam Fisher, since series veteran Michael Ironside was unable to perform motion capture for the game. The Toronto studio focused on the game's Windows, PlayStation 3 and Xbox 360 versions, and its later-announced Wii U version was developed by Ubisoft Shanghai, which also developed the game's multiplayer.\nBlacklist's pre-release reception was generally positive, despite criticism of its new voice actor. The game received generally positive reviews when it was released, with praise for its level design, story, gameplay, combat, soundtrack and multiplayer mode. However, criticism was directed at its dated graphics, lack of challenge and ending. It failed to meet Ubisoft's sales expectations, with sales of two million copies three months after its release.", "developer": ["Ubisoft Toronto", "Ubisoft Montreal", "Ubisoft Shanghai"], "genre": "Action-adventure", "date_release": "2013-08-20"}, "Tom Clancy's Splinter Cell: Chaos Theory": {"composer": null, "description": "Tom Clancy's Splinter Cell is a series of award-winning stealth video games, the first of which was released in 2002, and their tie-in novels. The protagonist, Sam Fisher, is a highly trained agent of a fictional  black-ops sub-division within the NSA, dubbed \"Third Echelon\". The player controls Fisher to overcome his adversaries in levels (created using Unreal Engine and emphasising light and darkness as gameplay elements). All the console and PC games in the series were positively received, and the series is commercially successful. The series, along with Assassin's Creed, is considered to be one of Ubisoft's flagship franchises, selling more than 31 million copies as of 2011.", "developer": ["Gameloft", "Ubisoft Montreal"], "genre": "Stealth", "date_release": "2005-03-21"}, "Tom Clancy's Splinter Cell: Conviction": {"producer": "Alexandre Parizeau", "composer": null, "description": "Tom Clancy's Splinter Cell: Conviction is an action-adventure stealth video game developed by Ubisoft Montreal as part of the Tom Clancy's Splinter Cell series. Key members of the Tom Clancy's Rainbow Six: Vegas team, such as creative director Maxime Béland worked on the game. Gameloft released a handheld version for Apple's iOS on May 27, 2010. There are also versions available for the Android, Windows Phone and Bada. The game was followed by a sequel in 2013 titled Splinter Cell: Blacklist.", "developer": ["Ubisoft Montreal", "Gameloft"], "genre": "Action-adventure", "date_release": "2010-04-13"}, "Tom Clancy's Splinter Cell: Double Agent": {"composer": null, "description": "Tom Clancy's Splinter Cell is a series of award-winning stealth video games, the first of which was released in 2002, and their tie-in novels. The protagonist, Sam Fisher, is a highly trained agent of a fictional  black-ops sub-division within the NSA, dubbed \"Third Echelon\". The player controls Fisher to overcome his adversaries in levels (created using Unreal Engine and emphasising light and darkness as gameplay elements). All the console and PC games in the series were positively received, and the series is commercially successful. The series, along with Assassin's Creed, is considered to be one of Ubisoft's flagship franchises, selling more than 31 million copies as of 2011.", "developer": ["Ubisoft Shanghai", "Ubisoft Montreal", "Ubisoft Milan"], "genre": "Stealth", "date_release": "2006-10-17"}, "Tom Clancy's Splinter Cell: Pandora Tomorrow": {"composer": null, "description": "Tom Clancy's Splinter Cell is a series of award-winning stealth video games, the first of which was released in 2002, and their tie-in novels. The protagonist, Sam Fisher, is a highly trained agent of a fictional  black-ops sub-division within the NSA, dubbed \"Third Echelon\". The player controls Fisher to overcome his adversaries in levels (created using Unreal Engine and emphasising light and darkness as gameplay elements). All the console and PC games in the series were positively received, and the series is commercially successful. The series, along with Assassin's Creed, is considered to be one of Ubisoft's flagship franchises, selling more than 31 million copies as of 2011.", "developer": ["Ubisoft Shanghai", "Ubisoft Milan", "Ubisoft Annecy", "Gameloft"], "genre": "Stealth", "date_release": "2004-03-23"}, "Tomb Raider": {"producer": "Kyle Peschel", "composer": "Jason Graves", "description": "Tomb Raider, also known as Lara Croft: Tomb Raider between 2001 and 2007, is a media franchise that originated with an action-adventure video game series created by British gaming company Core Design. Formerly owned by Eidos Interactive, then by Square Enix after their acquisition of Eidos in 2009, the franchise focuses on fictional British archaeologist Lara Croft, who travels around the world searching for lost artefacts and infiltrating dangerous tombs and ruins. Gameplay generally focuses on exploration of environments, solving puzzles, navigating hostile environments filled with traps, and fighting numerous enemies. Additional media has been developed for the franchise in the form of film adaptations, comics and novels.\nDevelopment on the original Tomb Raider game began in 1993, and it was first released in October 1996. Its critical and commercial success prompted Core Design to develop a new game annually for the next four years, which put a strain on staff. The sixth game, The Angel of Darkness, faced difficulties during development and was considered a failure at release. This prompted Eidos to switch development duties to Crystal Dynamics, which has been the series' primary developer since then. Other developers have contributed to spin-off titles within the series and ports of mainline entries.\nTomb Raider games have sold over 74 million copies worldwide. The series has generally met with critical acclaim, and is noted as one of the pioneers of the action-adventure genre. Lara Croft herself has become one of the most recognisable video game protagonists in existence, winning numerous accolades and earning places on the Walk of Game and Guinness World Records. Alongside being praised for pioneering female characters in video games, she has also been the subject of controversy due to her sex appeal being used for marketing.", "developer": ["Crystal Dynamics"], "genre": "Action-adventure", "date_release": "2013-03-05"}, "Tomb Raider: Anniversary": {"producer": "Lulu LaMer", "composer": "Troels Brun Folmann", "description": "Tomb Raider: Anniversary is an action-adventure video game co-developed by Crystal Dynamics and Buzz Monkey Software. It was published by Eidos Interactive in 2007 for Microsoft Windows, PlayStation 2, Xbox 360, PlayStation Portable, Wii and mobile phones. It was later ported to OS X in 2008 and PlayStation 3 in 2011. The eighth entry in the Tomb Raider series, Anniversary is a remake of the first Tomb Raider game released in 1996.\nTaking place in the continuity of 2006's Tomb Raider: Legend, Anniversary follows series protagonist Lara Croft's quest for the Scion of Atlantis.  Gameplay features Lara navigating linear levels, fighting enemies and solving puzzles to progress. The Wii version includes console-exclusive motion control elements, and the mobile port features side-scrolling gameplay emulating earlier mobile Tomb Raider titles.\nFollowing the completion of Legend, Crystal Dynamics began developing Anniversary. Using the Legend engine, the team rebuilt the gameplay and levels, and series creator Toby Gard expanded the narrative. Composer Troels Brun Folmann remade and added to the music using an orchestral style. A remake of the original Tomb Raider was initially being created by franchise creators Core Design, but the project was cancelled following their sale to Rebellion Developments in 2006.\nUpon release, the game was praised by journalists as an excellent remake. The Wii version divided opinion, with some critics praising the use of motion controls and other faulting their implementation. While it reached high positions in sales charts, the game sold 1.3 million copies worldwide, becoming the worst-selling entry in the franchise. The next release, 2008's Tomb Raider: Underworld, was developed alongside Anniversary for a new engine.", "developer": ["Crystal Dynamics"], "genre": "Action-adventure", "date_release": "2007-06-01"}, "Tomb Raider: Legend": {"producer": "Morgan Gray", "composer": "Troels Brun Folmann", "description": "Tomb Raider: Legend is an action-adventure video game developed by Crystal Dynamics and published by Eidos Interactive. It is the seventh entry in the Tomb Raider series and the first in a franchise reboot that reimagined the origins and character of series protagonist Lara Croft. The game released in 2006 for Microsoft Windows, PlayStation 2, Xbox, Xbox 360, PlayStation Portable, GameCube, Game Boy Advance, Nintendo DS, and mobile phones. A PlayStation 3 port was released in 2011.\nLegend details Lara Croft's quest for the mythical sword Excalibur, racing across the world against her former friend Amanda Evert. Gameplay features Lara navigating linear levels, fighting enemies and solving environmental puzzles to progress. The DS and GBA versions share the game's story while sporting gameplay adjusted for the platforms. The mobile version adapts locations from the game into on rails command-based platforming and combat scenarios.\nFollowing the critical failure of Core Design's Tomb Raider: The Angel of Darkness, Eidos transferred development of the next Tomb Raider to Crystal Dynamics, who began production in 2004. The aim was to revitalise the franchise, with both the gameplay and Lara herself being redesigned. Lara's creator Toby Gard was brought on board to help with this and was deeply involved with the project. Composer Troels Brun Folmann designed the music to change during levels as the player progresses.\nThe game received generally positive reviews, with many praising Legend as a return to form for the series, and either won or was nominated for multiple gaming awards. The GBA and DS ports received lower scores due to impact of hardware limitations on the gameplay. Selling over three million copies worldwide, Legend helped revitalise the Tomb Raider brand and re-established Lara Croft as a gaming icon. Two sequels—the remake Anniversary and true sequel Underworld—were released in 2007 and 2008 respectively.", "developer": ["Crystal Dynamics"], "genre": "Action-adventure", "date_release": "2006-04-07"}, "Torchlight": {"composer": "Matt Uelmen", "description": "Torchlight is an action role-playing hack and slash dungeon crawler video game developed by Runic Games and published by Perfect World, released for Windows in October 2009. The fantasy-themed game is set in the fictional town of Torchlight and the expansive caverns and dungeons nearby, which adventurers explore to collect valuable loot and battle hordes of monsters. Following the October 2009 digital distribution release, a Windows retail box version was released in the U.S. in January 2010 by Encore, Inc, and JoWooD Entertainment published a retail box in Europe in April 2010. A port for OS X was developed by World Domination Industries and released through Steam on May 12, 2010. Runic Games and World Domination Industries developed a port for Xbox Live Arcade which was released on March 9, 2011. A Linux port was released as part of the game's inclusion in the Humble Indie Bundle 6.\nDevelopment of the game was led by Travis Baldree, designer of Fate, joined by Max Schaefer and Erich Schaefer (co-designers of Diablo and Diablo II), and the team that worked with Baldree on the original incarnation of Mythos. In September 2012, Runic Games released a sequel, Torchlight II, for Windows. In 2018, the long-planned MMORPG was announced as Torchlight Frontiers.", "developer": ["Runic Games"], "genre": "Action RPG", "date_release": "2009-10-27"}, "Torchlight II": {"composer": null, "description": "Torchlight II is an action role-playing dungeon crawler video game developed by Runic Games, released for Microsoft Windows on September 20, 2012. It is the sequel to Torchlight, and features peer-to-peer multiplayer support and extended modding capabilities. The game was released for OS X on February 2, 2015, and for Linux on March 4, 2015. Ports for Nintendo Switch, PlayStation 4, and Xbox One are planned for a 2019 release, and are being developed by Panic Button.\nTorchlight II takes place in a fantasy world where the player character can be any of four classes, each with different skills and abilities. The plot starts with the destruction of the town of Torchlight, at the hands of the Alchemist from the first game, and has the character following the trail of destruction left in the Alchemist's wake as he searches for a cure to his illness which has driven him insane. The sequel to the first game was originally going to be an MMORPG however Torchlight II was released with both single-player and multi-player support, as the company felt they could release this much faster than the planned MMO. The game received mostly positive reviews from critics. In 2018, the MMORPG successor to the game was announced as Torchlight Frontiers.", "developer": ["Runic Games"], "genre": "Action RPG", "date_release": "2012-09-20"}, "Total Annihilation": {"producer": null, "composer": "Jeremy Soule", "description": "Total Annihilation is a real-time strategy video game created by Cavedog Entertainment, a sub-division of Humongous Entertainment, and released on September 30, 1997 by GT Interactive for Microsoft Windows and Mac OS. Two expansion packs were released, The Core Contingency on April 30, 1998 and Battle Tactics on June 30, 1998. After the closure of the Cavedog Entertainment in 1999, the intellectual property fell to Infogrames (now Atari).\nTotal Annihilation is no longer officially supported, due to the closure of Cavedog. Former lead designer Chris Taylor went on with Gas Powered Games to create Supreme Commander in 2007, considered the \"spiritual successor\" of Total Annihilation. The creators of XTA, a mod for Total Annihilation, independently developed the open-source 3D graphics Spring game engine. The Total Annihilation 3D project was begun in 2006. Other ex-members of Cavedog, including Total Annihilation's game engine developer Jon Mavor, later went on to develop Planetary Annihilation in 2014, another game in the same vein as Total Annihilation.\nIn July, 2013, Wargaming bought the Total Annihilation franchise from the Atari bankruptcy proceedings.", "developer": ["Cavedog Entertainment"], "genre": "RTS", "date_release": "1997-09-30"}, "Total War: Rome II": {"composer": null, "description": "Total War: Rome II is a strategy video game developed by The Creative Assembly and published by Sega. It was released on September 3, 2013, for Microsoft Windows as the eighth standalone game in the Total War series of video games and the successor to the 2004 game Rome: Total War.\nRome II received mostly positive reviews from critics, but suffered from significant technical problems upon release. However, it proved a commercial success, surpassing all other games in the Total War series in both sales and number of concurrent players on its release day. In September 2014, an Emperor Edition was released, which added Mac OS X support and addressed many of the technical problems in the game, as well as overhauled AI battles and upgraded certain visual elements. It was offered as a standalone edition and a free upgrade to all current players.", "developer": ["The Creative Assembly"], "genre": "RTS", "date_release": "2013-09-03"}, "Total War: Shogun 2": {"producer": "Ross Manton", "composer": "Jeff van Dyck", "description": "Total War: Shogun 2 is a strategy video game developed by The Creative Assembly and published by Sega in 2011. It is part of the Total War series and returns to the 16th-century Japan setting of the first Total War game, Shogun: Total War, after a series of games set mainly in Europe and the Middle East.\nShogun 2 is set in 16th-century feudal Japan, in the aftermath of the Ōnin War during the Ashikaga shogunate. The country is fractured into rival clans led by local warlords, each fighting for control. The player takes on the management of one of these clans, with the goal of dominating other factions and establishing rule over Japan. The standard edition of the game features a total of eight factions (plus a ninth faction for the tutorial), each with a unique starting position and different political and military strengths. The limited edition includes an exclusive ninja clan, the Hattori, and a DLC unlocks a tenth clan, the Ikko-Ikki.The game moves away from the European setting of previous Total War games and returns to the first setting in the Total War series, but making significant changes to core gameplay elements of Shogun 2. Compared to Empire which spanned almost the entire globe, the new installment focuses only on the islands of Japan (excluding Hokkaido) and on a reduced number of unit types.Shogun 2 received critical praise from reviewers, often for its simplification and refinement of the series by returning to its roots. A standalone expansion set, Total War: Shogun 2: Fall of the Samurai, was released in 2012.", "developer": ["The Creative Assembly"], "genre": "RTS", "date_release": "2011-04-15"}, "TrackMania 2: Canyon": {"description": "TrackMania 2 (stylized as TrackMania²) is a racing video game developed by Nadeo and published by Ubisoft as part of the TrackMania series.", "developer": ["Nadeo"], "genre": "Racing", "date_release": "2011-09-14"}, "TrackMania Forever": {"description": "TrackMania is a series of racing games for the Microsoft Windows, Nintendo DS, Wii, PlayStation 4 and Xbox One platforms, developed by the French team Nadeo for the PC. Instead of following the usual trend of choosing a set car and track to play the game, in TrackMania the players can create their own tracks using a \"building block\" process similar to that of the 1984 game Excitebike, the 1985 game Racing Destruction Set and the 1990 game Stunts.\nUnlike most other racing games, the TrackMania series lets the player race a track as many times as they want within a time limit. Players may choose to respawn at any time if they land upside down, leave the track or get off to a poor start. In multiplayer games, however, multiple cars race on the same track and cannot collide or otherwise influence each other.", "developer": ["Nadeo"], "genre": "Racing", "date_release": "2008-04-15"}, "TrackMania Nations ESWC": {"description": null, "developer": ["Nadeo"], "genre": "Racing", "date_release": "2006-01-28"}, "TrackMania Nations Forever": {"description": "TrackMania is a series of racing games for the Microsoft Windows, Nintendo DS, Wii, PlayStation 4 and Xbox One platforms, developed by the French team Nadeo for the PC. Instead of following the usual trend of choosing a set car and track to play the game, in TrackMania the players can create their own tracks using a \"building block\" process similar to that of the 1984 game Excitebike, the 1985 game Racing Destruction Set and the 1990 game Stunts.\nUnlike most other racing games, the TrackMania series lets the player race a track as many times as they want within a time limit. Players may choose to respawn at any time if they land upside down, leave the track or get off to a poor start. In multiplayer games, however, multiple cars race on the same track and cannot collide or otherwise influence each other.", "developer": ["Nadeo"], "genre": "Racing", "date_release": "2008-04-16"}, "TrackMania Sunrise": {"description": "TrackMania is a series of racing games for the Microsoft Windows, Nintendo DS, Wii, PlayStation 4 and Xbox One platforms, developed by the French team Nadeo for the PC. Instead of following the usual trend of choosing a set car and track to play the game, in TrackMania the players can create their own tracks using a \"building block\" process similar to that of the 1984 game Excitebike, the 1985 game Racing Destruction Set and the 1990 game Stunts.\nUnlike most other racing games, the TrackMania series lets the player race a track as many times as they want within a time limit. Players may choose to respawn at any time if they land upside down, leave the track or get off to a poor start. In multiplayer games, however, multiple cars race on the same track and cannot collide or otherwise influence each other.", "developer": ["Nadeo"], "genre": "Racing", "date_release": "2005-04-01"}, "TrackMania United": {"description": "TrackMania is a series of racing games for the Microsoft Windows, Nintendo DS, Wii, PlayStation 4 and Xbox One platforms, developed by the French team Nadeo for the PC. Instead of following the usual trend of choosing a set car and track to play the game, in TrackMania the players can create their own tracks using a \"building block\" process similar to that of the 1984 game Excitebike, the 1985 game Racing Destruction Set and the 1990 game Stunts.\nUnlike most other racing games, the TrackMania series lets the player race a track as many times as they want within a time limit. Players may choose to respawn at any time if they land upside down, leave the track or get off to a poor start. In multiplayer games, however, multiple cars race on the same track and cannot collide or otherwise influence each other.", "developer": ["Nadeo"], "genre": "Racing", "date_release": "2006-11-17"}, "Train Simulator": {"producer": "Paul Jackson", "description": "A train simulator (also railroad simulator or railway simulator) is a computer based simulation of rail transport operations. They are generally large complicated software packages modeling a 3D virtual reality world implemented both as commercial trainers, and consumer computer game software with 'play modes' which lets the user interact by stepping inside the virtual world. Because of the near view modeling, often at speed, train simulator software is generally far more complicated and difficult software to write and implement than flight simulator programs.\nWhile commercial trainers on mini-computer systems had a longer history, the first two mass-market English 'computer game' railway simulators, MSTS and Trainz, arrived within a few months of one another in 2001 and could run (poorly) on Intel 80386 microprocessor based systems. Some, like the first wide-market release, Microsoft Train Simulator (MSTS), are written and modeled for the user mainly interested in driving. Others, like MSTS's principle rival, Trainz, were aimed initially primarily at the rail enthusiast-hobbyist markets, supporting features making it possible to build a virtual railroad of one's dreams.  Accordingly, for four years Trainz releases bundled a free copy of gmax digital model building software on each CDROM, hosted an asset swap website (Trainz Exchange, later the Trainz Download Station), encouraged user participation and dialog with an active forum, and took pains to publish in-depth how-to model guidelines and specifications with its releases.\nSeveral other later challengers as well as Trainz (with a series of upgrades) soon matched or eclipsed MSTS's driving experiences one way or another. Railsim, actually a successor using the MSTS game engine upped the challenge to the aging MSTS by adding much improved graphics, so Trainz did as well, but also added interactive industries and dynamic driving features such as product loading and unloading, load-sensitive physics modeling affecting driving and operating and user interface changes to improve User eXperiences (UX), such as a free camera mode allowing roaming away from the train cars, free and clear of the Train being operated-while still controlling it. This latter makes particular sense given the dearth of an assistant on a walkie-talky while operating a train during coupling operations or other position sensitive tasks such as loading and unloading. Railsim and a couple of others came and went out of business, and Railsim was reorganized as Rail Simulator with the software company that wrote MSTS as its core, while MSTS aged and never did get upgraded as Microsoft had once begun and announced. In the last few years, Rail Simulator has changed its name to Train Simulator 2016.\nAs the world market has shaken out, Australian Trainz in 2014-2015 upgraded itself with Trainz: A New Era, still servicing the wider route builder and driving markets, but now matching the 64bit computing and graphics of Train Simulator 2013, 2015, and Train Simulator 2016. In the same five-year period, Train simulators have moved to pad computer and phone platforms.", "developer": ["Dovetail Games"], "genre": "Simulation", "date_release": "2009-01-01"}, "Transistor": {"composer": "Darren Korb", "description": "A transistor is a semiconductor device used to amplify or switch electronic signals and electrical power. It is composed of semiconductor material usually with at least three terminals for connection to an external circuit. A voltage or current applied to one pair of the transistor's terminals controls the current through another pair of terminals. Because the controlled (output) power can be higher than the controlling (input) power, a transistor can amplify a signal. Today, some transistors are packaged individually, but many more are found embedded in integrated circuits.\nAustro-Hungarian physicist Julius Edgar Lilienfeld proposed the concept of a field-effect transistor in 1926, but it was not possible to actually construct a working device at that time. The first working device to be built was a point-contact transistor invented in 1947 by American physicists John Bardeen, Walter Brattain, and William Shockley at Bell Labs. They shared the 1956 Nobel Prize in Physics for their achievement. The most widely used transistor is the MOSFET (metal–oxide–semiconductor field-effect transistor), also known as the MOS transistor, which was invented by Egyptian engineer Mohamed Atalla with Korean engineer Dawon Kahng at Bell Labs in 1959. The MOSFET was the first truly compact transistor that could be miniaturised and mass-produced for a wide range of uses.Transistors revolutionized the field of electronics, and paved the way for smaller and cheaper radios, calculators, and computers, among other things. The first transistor and the MOSFET are on the list of IEEE milestones in electronics. The MOSFET is the fundamental building block of modern electronic devices, and is ubiquitous in modern electronic systems. An estimated total of 13 sextillion MOSFETs have been manufactured between 1960 and 2018 (at least 99.9% of all transistors), making the MOSFET the most widely manufactured device in history.Most transistors are made from very pure silicon, and some from germanium, but certain other semiconductor materials can also be used. A transistor may have only one kind of charge carrier, in a field-effect transistor, or may have two kinds of charge carriers in  bipolar junction transistor devices. Compared with the vacuum tube, transistors are generally smaller, and require less power to operate. Certain vacuum tubes have advantages over transistors at very high operating frequencies or high operating voltages.  Many types of transistors are made to standardized specifications by multiple manufacturers.", "developer": ["Supergiant Games"], "genre": "Action RPG", "date_release": "2014-05-20"}, "Trespasser": {"producer": "Seamus Blackley", "composer": "Bill Brown", "description": "In the law of tort, property, and criminal law a trespasser is a person who commits the act of trespassing on a property, that is, without the permission of the owner. Being present on land as a trespasser thereto creates liability in the trespasser, so long as the trespass is intentional. At the same time, the status of a visitor as a trespasser (as opposed to an invitee or a licensee) defines the legal rights of the visitor if they are injured due to the negligence of the property owner.", "developer": ["DreamWorks Interactive"], "genre": "Action-adventure", "date_release": "1998-10-28"}, "Tribes 2": {"producer": "David Georgeson", "composer": "Timothy Steven Clarke", "description": "Tribes 2 is a first-person shooter multiplayer video game developed by Dynamix and published by Sierra On-Line in 2001 as a sequel to Starsiege: Tribes.", "developer": ["Dynamix"], "genre": "First-person shooter", "date_release": "2001-03-30"}, "Tribes: Ascend": {"composer": "Chris Rickwood", "description": "Tribes: Ascend is a free-to-play first-person shooter developed and published by Hi-Rez Studios for Microsoft Windows, as part of the Tribes series. Aspects from previous Tribes games such as jetpacks and skiing are featured in the game. The game was released on April 12, 2012. In February 2013, Hi-Rez released a Game of the Year Edition, which unlocked all classes, weapons, equipment, and perks in a single package. In July 2013, Hi-Rez halted further development on Tribes: Ascend to focus on other titles, though a small team resumed development in August 2015. In December 2015, Hi-Rez Studios announced a patch for the game which introduced major changes. Due to the nature of the patch, the company reverted all previous in-game purchases.", "developer": ["Hi-Rez Studios"], "genre": "First-person shooter", "date_release": "2012-04-12"}, "Tribes: Vengeance": {"producer": "Tony Oakden", "composer": "Eric Brosius", "description": "Tribes: Vengeance is a science fiction first-person shooter video game, developed by Irrational Games and released by Vivendi Universal Games in October 2004. It was built on an enhanced version of the Unreal Engine 2/2.5, which Irrational Games called the Vengeance engine. Part of the Tribes series, in addition to its multiplayer network maps, Vengeance includes a complete single-player campaign.", "developer": ["Irrational Games"], "genre": "First-person shooter", "date_release": "2004-10-05"}, "Tropico": {"producer": "Chris Lacey", "description": "Tropico is a construction and management simulation video game developed by PopTop Software and published by Gathering of Developers in April 2001. Feral Interactive has developed and published a number of the games in the series for Mac OS X. The games see the player taking the role of \"El Presidente\", the ruler of a fictional island country in the Caribbean during the Cold War era from the 1950s onward.\nThe game is tongue-in-cheek in its presentation of semi-democratic banana republics, using a great deal of humor while still referencing such topics as totalitarianism, electoral fraud, and the interventions of powerful companies (United Fruit is implied) and the Cold War superpowers (the United States and Soviet Union).  This is similar to the previous 8bit Game Dictator by DK'Tronics, except in Dictator the success is measured by the amount you put away in your Swiss Bank Account\nTropico features Latin-styled Caribbean music, largely performed by Daniel Indart. The game won the Original Music Composition category in the 2002 Interactive Achievement Awards.\nTropico has several expansion packs and new editions, including Tropico: Paradise Island, plus a combined copy of the original and Paradise Island entitled Tropico: Mucho Macho Edition (released on June 27, 2002). A sequel, Tropico 2: Pirate Cove, was released on April 8, 2003. The third game in the series Tropico 3, was released in the autumn of 2009. A fourth game, Tropico 4, was released on August 26, 2011, and a fifth game, Tropico 5, was released on May 23, 2014. Tropico 6 was released on March 29, 2019.The game was re-released in the three-game pack Tropico Reloaded, packing the original game, the expansion pack Tropico: Paradise Island, and the sequel Tropico 2: Pirate Cove into one release. It is available both digitally on Steam and GOG.com, and on disc.", "developer": ["PopTop Software", "Feral Interactive"], "genre": "Construction and management simulation", "date_release": "2001-04-24"}, "Tropico 2: Pirate Cove": {"composer": "Daniel Indart", "description": "Tropico 2: Pirate Cove is a 2003 city-building game developed by Frog City Software and PopTop Software, and published by Gathering of Developers. It is the sequel to Tropico.\nTropico 2 was a commercial success, with sales above 300,000 copies. The review aggregator Metacritic designated the game's critical reception as \"generally favorable\". Following the acquisition of the Tropico license by Kalypso Media in 2008, that company published four sequels to Tropico 2: Tropico 3, Tropico 4, Tropico 5 and Tropico 6. The first three sequels were developed by Haemimont Games, while Limbic Entertainment developedTropico 6.", "developer": ["Frog City Software"], "genre": "Construction and management simulation", "date_release": "2003-04-28"}, "Tropico 3": {"description": "Tropico 3 is a video game developed by Haemimont Games and published by Kalypso Media. Like the previous games in the series, Tropico 3 is a construction and management simulation as well as a political simulation game, with emphasis on city building. As a thematic sequel to Tropico  (unlike the pirate-themed sequel, Tropico 2), the game attempts to return to the roots of the series, which puts the player into the shoes of \"El Presidente\" – a ruler governing over an island banana republic.\nThe OS X version of the game was released on January 26, 2012, by Feral Interactive.Feral Interactive released a redesigned version of Tropico 3 to iPad on December 18, 2018, under the name Tropico, with an iPhone version following on April 30th, 2019. An Android version of the game was released on September 5th, 2019.", "developer": ["Haemimont Games"], "genre": "Construction and management simulation", "date_release": "2009-10-20"}, "Tropico 4": {"description": "Tropico 4 is a video game that combines city management and political manipulation. The game was developed by Haemimont Games and published by Kalypso Media. Like the first and third games in the series, it centers on a customizable main character titled \"El Presidente\" – the ruler who runs the island banana republic. The Mac OS X version of the game (Tropico 4: Gold Edition, which includes the Modern Times expansion pack) was released by Feral Interactive on July 25, 2013, as well as DLC packs Dash for Growth and Captain of Industry. The State of Emergency DLC pack was released by Feral on April 3, 2014.Tropico 4 includes support for Facebook and Twitter.", "developer": ["Haemimont Games"], "genre": "Construction and management simulation", "date_release": "2011-08-26"}, "Tropico 5": {"description": "Tropico 5 is a construction and management simulation video game developed by Haemimont Games. It was released for Microsoft Windows in May 2014, with versions for Linux, OS X and Xbox 360 released later in 2014 as well as versions for PlayStation 4 and Xbox One released in April 2015 and May 2016 respectively.\nFor the first time in the Tropico series the game features cooperative and competitive multiplayer for up to four players. The players are able to build cities on the same island, allowing the choice of working with one another, or against.", "developer": ["Haemimont Games"], "genre": "Construction and management simulation", "date_release": "2014-05-23"}, "Tropico 6": {"description": "Tropico 6 is a construction, management and  political simulation game in the Tropico series, developed by Limbic Entertainment, published by Kalypso Media, and announced at E3 2017. Originally intended for a 2018 release, Tropico 6 was released on Microsoft Windows, macOS and Linux in March 2019, and for PlayStation 4 and Xbox One in September 2019.", "developer": ["Limbic Entertainment"], "genre": "Construction and management simulation", "date_release": "2019-03-29"}, "True Love": {"composer": null, "description": null, "genre": "Visual novel", "date_release": "1995-07-09"}}