{"Factorio": {"composer": "Daniel James Taylor", "description": "Factorio is a construction and management simulation video game in development by Wube Software. It has been available as an early-access game since 2014. Development of Factorio, based in Prague, began in 2012. An Indiegogo campaign in 2013 raised more than its goal, and early-access versions have been sold on Steam and other distributors to raise further funds.\nThe game follows an engineer who crash-landed on an alien planet and must harvest resources and create industry to build a rocket; however, as an open-world game, players can continue the game past the end of the storyline. The game has both single-player and multiplayer modes.\n\n", "developer": ["Wube Software"], "genre": "RTS", "date_release": "2015-01-01"}, "A Fairy Tale": {"description": "A fairy tale, wonder tale, magic tale, or Märchen is an instance of a folklore genre that takes the form of a short story. Such stories typically feature entities such as dwarfs, dragons, elves, fairies, giants, gnomes, goblins, griffins, mermaids, talking animals, trolls, unicorns, or witches, and usually magic or enchantments. In most cultures, there is no clear line separating myth from folk or fairy tale; all these together form the literature of preliterate societies. Fairy tales may be distinguished from other folk narratives such as legends (which generally involve belief in the veracity of the events described) and explicit moral tales, including beast fables. The term is mainly used for stories with origins in European tradition and, at least in recent centuries, mostly relates to children's literature.\nIn less technical contexts, the term is also used to describe something blessed with unusual happiness, as in \"fairy-tale ending\" (a happy ending) or \"fairy-tale romance\". Colloquially, the term \"fairy tale\" or \"fairy story\" can also mean any far-fetched story or tall tale; it is used especially of any story that not only is not true, but could not possibly be true. Legends are perceived as real; fairy tales may merge into legends, where the narrative is perceived both by teller and hearers as being grounded in historical truth. However, unlike legends and epics, fairy tales usually do not contain more than superficial references to religion and to actual places, people, and events; they take place \"once upon a time\" rather than in actual times.Fairy tales occur both in oral and in literary form; the name \"fairy tale\" (\"conte de fées\" in French) was first ascribed to them by Madame d'Aulnoy in the late 17th century. Many of today's fairy tales have evolved from centuries-old stories that have appeared, with variations, in multiple cultures around the world. The history of the fairy tale is particularly difficult to trace because only the literary forms can survive. Still, according to researchers at universities in Durham and Lisbon, such stories may date back thousands of years, some to the Bronze Age more than 6,500 years ago.  Fairy tales, and works derived from fairy tales, are still written today.\nFolklorists have classified fairy tales in various ways. The Aarne-Thompson classification system and the morphological analysis of Vladimir Propp are among the most notable. Other folklorists have interpreted the tales' significance, but no school has been definitively established for the meaning of the tales.", "developer": ["Reflexive Entertainment"], "genre": "Matching", "date_release": "2009-03-12"}, "Fallout": {"producer": null, "composer": "Mark Morgan", "description": "Nuclear fallout, or fallout, is the residual radioactive material propelled into the upper atmosphere following a nuclear blast, so called because it \"falls out\" of the sky after the explosion and the shock wave have passed. It commonly refers to the radioactive dust and ash created when a nuclear weapon explodes. The amount and spread of fallout is a product of the size of the weapon and the altitude at which it is detonated. Fallout may get entrained with the products of a pyrocumulus cloud and fall as black rain (rain darkened by soot and other particulates, which fell within 30–40 minutes of the Atomic bombings of Hiroshima and Nagasaki). This radioactive dust, usually consisting of fission products mixed with bystanding atoms that are neutron-activated by exposure, is a form of radioactive contamination.", "developer": ["Interplay Inc."], "genre": "RPG", "date_release": "1997-11-01"}, "Fallout 2": {"producer": null, "composer": "Mark Morgan", "description": "Fallout 2: A Post Nuclear Role Playing Game is a turn-based role-playing open world video game developed by Black Isle Studios and published by Interplay Productions in September 1998. While featuring a considerably larger game world and a far more extensive storyline, it mostly uses similar graphics and game mechanics to those of Fallout.\nThe game's story takes place in 2241, 80 years after the events of Fallout and 164 years after the war. It tells the story of the original hero's descendant and their quest to save their primitive tribe from starvation by finding an ancient environmental restoration machine known as the Garden of Eden Creation Kit (GECK).The game was well-received by critics, with praise directed at the gameplay, storyline, and worthiness as a successor to the original Fallout, while criticism was directed at the frequent bugs and lack of improvement over the first game.", "developer": ["Black Isle Studios"], "genre": "RPG", "date_release": "1998-12-01"}, "Fallout 3": {"producer": [null, null], "composer": "Inon Zur", "description": "Fallout 3 is a post-apocalyptic action role-playing open world video game developed by Bethesda Game Studios and published by Bethesda Softworks. The third major installment in the Fallout series, it is the first game to be created by Bethesda since it bought the franchise from Interplay Entertainment. The game marks a major shift in the series by using 3D graphics and real-time combat, replacing the 2D isometric graphics and turn-based combat of previous installments. It was released worldwide in October 2008 for Microsoft Windows, PlayStation 3, and Xbox 360.The game is set within a post-apocalyptic, open world environment that encompasses a scaled region consisting of the ruins of Washington, D.C. and much of the countryside to the west of it, referred to as the \"Capital Wasteland\". It takes place within Fallout's usual setting of a world that deviated into an alternate timeline thanks to atomic age technology, which eventually led to its devastation by a nuclear apocalypse in the year 2077 (referred to as \"The Great War\"), caused by a major international conflict between the United States and China over natural resources and the last remaining supplies of untapped petroleum. The main story takes place in the year 2277, around 36 years after the events of Fallout 2, of which it is not a direct sequel. Players take control of an inhabitant of Vault 101, one of several underground shelters created before the Great War to protect around 1,000 humans from the nuclear fallout, who is forced to venture out into the Capital Wasteland to find their father after he disappears from the Vault under mysterious circumstances. They find themselves seeking to complete their father's work while fighting against the Enclave, the corrupt remnants of the former U.S. government that seeks to use it for their own purposes.\nFallout 3 was met with critical acclaim and received a number of Game of the Year awards, praising the game's open-ended gameplay and flexible character-leveling system, and is considered one of the best video games of all time. The NPD Group estimated that Fallout 3 sold over 610,000 units during its initial month of release in October 2008, performing better than Bethesda's previous game, The Elder Scrolls IV: Oblivion, which sold nearly 500,000 units in its first month. The game received post-launch support, with Bethesda releasing five downloadable add-ons. The game was met with controversy upon release in Australia, for the use of and the ability to be addicted to alcohol and drugs; in India, for cultural and religious sentiments over the mutated cattle in the game being called \"Brahmin\"; and in Japan, due to having a weapon called the \"Fat Man\", which releases mini nuclear bombs.", "developer": ["Bethesda Game Studios"], "genre": "RPG", "date_release": "2008-10-28"}, "Fallout 4": {"producer": [null, null], "composer": "Inon Zur", "description": "Fallout 4 is a post-nuclear apocalyptic action role-playing game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the fifth major installment in the Fallout series and was released worldwide on November 10, 2015, for Microsoft Windows, PlayStation 4 and Xbox One. The game is set within an open world post-apocalyptic environment that encompasses the city of Boston and the surrounding Massachusetts region known as \"The Commonwealth\". The main story takes place in the year 2287, ten years after the events of Fallout 3 and 210 years after \"The Great War\", which caused catastrophic nuclear devastation across the United States.\nThe player assumes control of a character referred to as the \"Sole Survivor\", who emerges from a long-term cryogenic stasis in Vault 111, an underground nuclear fallout shelter. After witnessing the murder of their spouse and kidnapping of their son, the Sole Survivor ventures out into the Commonwealth to search for their missing child. The player explores the game's dilapidated world, completes various quests, helps out factions, and acquires experience points to level up and increase the abilities of their character. New features to the series include the ability to develop and manage settlements and an extensive crafting system where materials scavenged from the environment can be used to craft drugs and explosives, upgrade weapons and armor, and construct, furnish and improve settlements. Fallout 4 also marks the first game in the series to feature full voice acting for the protagonist.\nFallout 4 received positive reviews from critics with many praising the world depth, player freedom, overall amount of content, crafting, and soundtrack, while criticism was mainly directed at the game's visuals and technical issues. The game was a commercial and critical success, generating US$750 million within the first 24 hours of its launch, and received numerous accolades from various gaming publications and award events, including the respective awards for Game of the Year and Best Game at the Academy of Interactive Arts & Sciences and British Academy Games Awards. Bethesda has released six downloadable content add-ons, including the expansions Far Harbor and Nuka-World.", "developer": ["Bethesda Game Studios"], "genre": "RPG", "date_release": "2015-11-10"}, "Fallout: New Vegas": {"producer": [null, null, null, null], "composer": "Inon Zur", "description": "Fallout: New Vegas is a post-apocalyptic action role-playing video game. It is a spin-off of the Fallout series and was developed by Obsidian Entertainment and published by Bethesda Softworks. It was announced in April 2009 and released for Microsoft Windows, PlayStation 3 and Xbox 360 on October 19, 2010. The game is set in a post-apocalyptic open world environment that encompasses a region consisting of parts of Nevada, California, and Arizona. It is set in a world that deviated onto an alternate timeline thanks to atomic age technology, which eventually led to its devastation by a nuclear apocalypse in the year 2077 in an event referred to as \"The Great War\". This war was caused by a major international conflict between the United States and China over natural resources. The main story of New Vegas takes place in the year 2281, four years after the events of Fallout 3. It is not a direct sequel, but it does mark the return of a number of elements found in the Black Isle Studios-developed Fallout 2.\nPlayers take control of a character known as the Courier. While transporting a package across the Mojave Desert to the city of New Vegas, the Courier is ambushed, robbed of the package, shot in the head, and left for dead. After surviving, the Courier begins a journey to find their would-be killer and recover the package, makes friends and enemies among various factions, and ultimately becomes caught up in a conflict that determines who will control New Vegas and the Mojave Wasteland. New Vegas received positive reviews, with critics praising the game's writing, quests, and improved gameplay, though criticized for its glitches and bugs on launch. New Vegas was a commercial success, shipping more than 5 million copies altogether, and is estimated to have sold around 12 million copies worldwide. The game also received a Golden Joystick Award for \"RPG of the Year\" in 2011.", "developer": ["Obsidian Entertainment"], "genre": "RPG", "date_release": "2010-10-19"}, "Fallout Tactics: Brotherhood of Steel": {"composer": "Inon Zur", "description": "Fallout Tactics: Brotherhood of Steel is a turn-based real-time tactical role-playing game set in the post-apocalyptic Fallout universe. Developed by Micro Forté and published by 14 Degrees East, Fallout Tactics was released on 14 March 2001 for Microsoft Windows. It sold above 300,000 units worldwide by 2008.\nThe game follows a squad of the Brotherhood of Steel as it becomes engaged in a desperate war. Although the game takes place in the Fallout universe, it does not follow or continue the story of either Fallout or Fallout 2. Fallout Tactics shipped with a bonus CD when it was pre-ordered. The bonus CD included Fallout: Warfare, a table-top miniatures game based on the Fallout universe, as well as a bonus mission for the main game.", "developer": ["Micro Forté"], "genre": "TRPG", "date_release": "2001-03-15"}, "Far Cry": {"description": "Far Cry is a franchise of first-person shooter video games, all of which have been published by Ubisoft. The first game, Far Cry, was developed by Crytek to premiere their CryEngine software, and released in March 2004. Subsequently, Ubisoft obtained the rights to the franchise and the bulk of the development is handled by Ubisoft Montreal with assistance from other Ubisoft satellite studios. The following games in the series have used a Ubisoft-modified version of the CryEngine, the Dunia Engine, allowing for open world gameplay. There have been five main games in the series, along with three standalone expansions; the first game, initially developed for Microsoft Windows, also saw a number of ports to video game consoles.\nThe Far Cry games, due to the history of their development, do not have any significant shared narrative elements, but instead share a theme of placing the player in a wilderness environment where they must help fight against one or more despots that control the region as well as surviving against wild animals that roam the open spaces. The Far Cry games feature a robust single-player campaign with later titles offering co-operative campaign support. The games also offer competitive multiplayer options and the ability for users to edit the games' maps for these matches.\nThe Far Cry games have generally been well-received and are considered commercial successes. Ubisoft reports that through 2014, lifetime sales of the Far Cry franchise has exceeded 20 million units.", "developer": ["Crytek"], "genre": "First-person shooter", "date_release": "2004-03-12"}, "Far Cry 2": {"producer": [null, null], "composer": "Marc Canham", "description": "Far Cry 2 is an open world first-person shooter developed by Ubisoft Montreal and published by Ubisoft. It was released worldwide for Microsoft Windows, PlayStation 3, and Xbox 360 in October 2008. It is the second installment of the main Far Cry series, preceded by 2004's Far Cry and followed by 2012's Far Cry 3. Far Cry 2 is backwards compatible with Xbox One.\nUbisoft has marketed Far Cry 2 as the true sequel to Far Cry, however the sequel has very few noticeable similarities to the original game. Instead, it features completely new characters and setting, as well as a new style of gameplay that allows the player greater freedom to explore different African landscapes such as deserts, jungles, and savannas. The game takes place in a modern-day Central African nation during civil war. The player takes control of a mercenary on a lengthy journey to locate and assassinate \"The Jackal\", a notorious arms dealer.\nFar Cry 2 was met with positive reception upon its release, with critics praising the game's setting, open-ended gameplay, visuals and AI, while criticism was directed at glitches, design choices and the writing. By January 2009, the game had sold nearly three million copies.", "developer": ["Ubisoft Montreal"], "genre": "First-person shooter", "date_release": "2008-10-21"}, "Far Cry 3": {"producer": "Dan Hay", "composer": "Brian Tyler", "description": "Far Cry 3 is a first-person shooter video game developed by Ubisoft Montreal and published by Ubisoft. The third main installment in the Far Cry series, the game was released for Microsoft Windows, PlayStation 3 and Xbox 360 in November 2012. The game takes place on Rook Islands, a tropical archipelago which can be freely explored by players. Gameplay focuses on combat and exploration. Players can use a variety of weapons to defeat human enemies and hostile wildlife, and the game features elements found in role-playing games such as skill trees and experience. After a vacation goes awry, protagonist Jason Brody must save his friends, who have been kidnapped by pirates, and escape from the island and its unhinged inhabitants.\nUbisoft Montreal collaborated with Ubisoft's global development team, including Massive Entertainment, Ubisoft Shanghai, Ubisoft Bucharest, Ubisoft Reflections and Red Storm Entertainment. Development of the game was partially restarted in 2010 after the departure of several key creative staff. The team evaluated the feedback for Far Cry 2 and identified areas that needed to be improved or removed. The team spent considerable time designing the island, which they described as the \"second most important character\" in the game. Inspirations were taken from media such as Apocalypse Now and Lost, as well as video games The Elder Scrolls V: Skyrim and Red Dead Redemption. Michael Mando was hired to portray Vaas, a character the team compared to Darth Vader.\nThe game was announced in June 2011 and Ubisoft promoted the game with various companion apps, webseries and crossover. The game received critical acclaim upon release, with praise directed at its characters, world design, progression, and gameplay, though its narrative and multiplayer mode received criticism. Despite weak pre-order sales, nearly 10 million copies of the game were sold. It was nominated for multiple year-end accolades including Game of the Year and Best Shooter awards by several gaming publications. Ubisoft supported the game with downloadable content and released Far Cry 3: Blood Dragon, the game's standalone expansion, in 2013. A successor, Far Cry 4 was released in November 2014. The game was re-released for PlayStation 4 and Xbox One in June 2018.", "developer": ["Ubisoft Montreal"], "genre": "First-person shooter", "date_release": "2012-11-29"}, "Far Cry 3: Blood Dragon": {"producer": "Fabrice Cuny", "composer": "Power Glove", "description": "Far Cry 3: Blood Dragon is a first-person shooter video game developed by Ubisoft Montreal and published by Ubisoft for the for PlayStation 3, Microsoft Windows and Xbox 360 in 2013. It is a stand-alone expansion to the 2012 video game Far Cry 3 and the eighth overall installment in the Far Cry franchise.\nBlood Dragon, a parody of 1980s action films, cartoons and video games, takes place on a retro-futuristic open world island with players assuming the action role of the military cyborg Sergeant Rex \"Power\" Colt.  The game received generally positive reviews upon release.", "developer": ["Ubisoft Montreal", "Ubisoft Shanghai"], "genre": "First-person shooter", "date_release": "2013-05-01"}, "Far Cry 4": {"producer": "Cedric Decelle", "composer": "Cliff Martinez", "description": "Far Cry 4 is a  first-person shooter video game developed by Ubisoft Montreal and published by Ubisoft for the Microsoft Windows, PlayStation 3, PlayStation 4, Xbox 360, and Xbox One. It is the successor to the 2012 video game Far Cry 3, and the fourth main installment in the Far Cry series. The game was released on November 18, 2014.\nThe game takes place in Kyrat, a fictional Himalayan country. The main story follows Ajay Ghale, a young Kyrati-American, as he is caught in a civil war involving Kyrat's Royal Army, controlled by tyrannical king Pagan Min, and a rebel movement called the Golden Path. Gameplay focuses on combat and exploration; players battle enemy soldiers and dangerous wildlife using a wide array of weapons. The game features many elements found in role-playing games, such as a branching storyline, and side quests. The game also features a map editor, a co-operative multiplayer mode, and an asymmetrical competitive multiplayer mode.\nAnnounced in May 2014, development on Far Cry 4 began immediately after the shipment of Assassin's Creed III in late 2012. The team originally intended to develop a direct sequel to Far Cry 3 that continues 3's story, but the idea was later scrapped and the team decided to develop a new setting and new story for the game. Certain aspects of Far Cry 4 were inspired by the Nepalese Civil War, and the costume of the game's antagonist Pagan Min was inspired by Japanese films Ichi the Killer and Brother. The game's competitive multiplayer was created by Red Storm Entertainment while the Shangri-La segments in the campaign were handled by Ubisoft Toronto.\nFar Cry 4 was met with a mostly positive critical reception upon release. Critics praised the open world design, visuals, soundtrack, and characters, particularly antagonist Pagan Min, as well as new gameplay additions and the wealth of content. However, some critics disliked the story and found the game too similar to its predecessor. The game was a commercial success, selling seven million copies by the end of 2014, and was the biggest launch in the franchise's history. Several releases of downloadable content were subsequently published. A successor, Far Cry 5, was released on March 27, 2018.", "developer": ["Ubisoft Montreal"], "genre": "First-person shooter", "date_release": "2014-11-18"}, "Far Cry Primal": {"producer": "Vincent Pontbriand", "composer": "Jason Graves", "description": "Far Cry Primal is a first-person shooter video game developed by Ubisoft Montreal and published by Ubisoft. It was released worldwide for PlayStation 4 and Xbox One on February 23, 2016, and for Microsoft Windows on March 1, 2016. The game is a spin-off of the main Far Cry series. It is the first Far Cry game set in pre-modern times. It revolves around the story of Takkar, who starts off as an unarmed hunter and rises to become the leader of a tribe.\nFar Cry Primal received generally positive reception from critics, who mostly praised the concept and setting, as well as the animal-taming mechanic and world design. Some reviewers felt there was a lack of weapons for the player to utilize, leading to repetitive gameplay design, while others felt the story and characters were not on par with the previous Far Cry games.", "developer": ["Ubisoft Montreal"], "genre": "Action-adventure", "date_release": "2016-02-23"}, "Fez": {"producer": [null, null], "composer": "Disasterpeace", "description": "The fez (Turkish: fes), also called tarboosh (Arabic: طربوش‎, romanized: ṭarbūš, derived from Persian: سرپوش‎, romanized: sarpuš, lit. 'cap'), is a felt headdress in the shape of a short cylindrical peakless hat, usually red, and sometimes with a tassel attached to the top. The name \"fez\" refers to the Moroccan city of Fez (capital of the Kingdom of Morocco until 1927), where the dye to color the hat was extracted from crimson berries. The modern fez owes much of its popularity to the Ottoman era.The fez is often confused with the shashiya (or with French spelling chéchia, from Arabic شاشية shāshiyya), which is more popular in the Maghreb but originated from Shash, the former name of Tashkent, Uzbekistan, where shashias have been made since the 9th century. The two types of headgear are quite different: the fez is stiff, cylindrical, and raised in shape, whereas the shashia is soft and its shape adheres to the top of the head, in the manner of a cap.", "developer": ["Polytron Corporation"], "genre": "Puzzle-platform", "date_release": "2013-05-01"}, "Fiesta Online": {"description": "Fiesta is a MMORPG published and hosted by gamigo AG .\nFiesta features an anime style characters rendered in 3D. Fiesta Online was originally published in 2003 but was later published by Outspark and subsequently taken over by Gamigo AG.", "genre": "MMORPG", "date_release": "2007-11-07"}, "Final Fantasy VII": {"producer": "Hironobu Sakaguchi", "composer": "Nobuo Uematsu", "description": "Final Fantasy VII is a 1997 role-playing video game developed by Square for the PlayStation console. It is the seventh main installment in the Final Fantasy series. Published in Japan by Square, it was released in other regions by Sony Computer Entertainment and became the first in the main series to see a PAL release. The game's story follows Cloud Strife, a mercenary who joins an eco-terrorist organization to stop a world-controlling megacorporation from using the planet's life essence as an energy source. Events send Cloud and his allies in pursuit of Sephiroth, a superhuman intent on destroying their planet. During the journey, Cloud builds close friendships with his party members, including Aerith Gainsborough, who holds the secret to saving their world.\nDevelopment began in 1994, originally for the  Super Nintendo Entertainment System. After delays and technical difficulties from experimenting on several platforms, Square moved production to the PlayStation, largely due to the advantages of the CD-ROM format. Veteran Final Fantasy staff returned, including series creator and producer Hironobu Sakaguchi, director Yoshinori Kitase, and composer Nobuo Uematsu. The title became the first in the series to use full motion video and 3D computer graphics, which featured 3D character models superimposed over 2D pre-rendered backgrounds. Although the gameplay systems remained mostly unchanged from previous entries, Final Fantasy VII introduced more widespread science fiction elements and a more realistic presentation. The game had a staff of over 100, with a combined development and marketing budget of around US$80 million.\nAssisted by a large promotional campaign, Final Fantasy VII received widespread commercial and critical success and remains widely regarded as a landmark title and one of the greatest video games of all time. The title won numerous Game of the Year awards and was acknowledged for boosting the sales of the PlayStation and popularizing Japanese role-playing games worldwide. Critics praised its graphics, gameplay, music, and story, although some criticism was directed towards its English localization. Its success has led to enhanced ports on various platforms, a multimedia subseries called the Compilation of Final Fantasy VII and an upcoming high-definition remake for the PlayStation 4.", "developer": ["Square Product Development Division 1"], "genre": "Role-playing", "date_release": "1998-05-31"}, "Final Fantasy VIII": {"producer": "Shinji Hashimoto", "composer": "Nobuo Uematsu", "description": "Final Fantasy VIII is a role-playing video game developed and published by Square for the PlayStation console. Released in 1999, it is the eighth main installment in the Final Fantasy series. Set on an unnamed fantasy world with science fiction elements, the game follows a group of young mercenaries, led by Squall Leonhart, as they are drawn into a conflict sparked by Ultimecia, a sorceress from the future who wishes to compress time. During the quest to defeat Ultimecia, Squall struggles with his role as leader and develops a romance with one of his comrades, Rinoa Heartilly.\nDevelopment began in 1997, during the English localization of Final Fantasy VII. The game builds on the visual changes brought to the series by Final Fantasy VII, including the use of 3D graphics and pre-rendered backgrounds, while also departing from many Final Fantasy traditions. It is the first Final Fantasy to use realistically proportioned characters consistently, feature a vocal piece as its theme music, and forgo the use of magic points for spellcasting.\nFinal Fantasy VIII was mostly well received by critics, who praised its originality and visuals while criticizing some of its gameplay elements. It was voted the 22nd-best game of all time in 2006 by readers of the Japanese magazine Famitsu. The game was a commercial success; it earned more than US$50 million in sales during its first 13 weeks of release, making it the fastest-selling Final Fantasy title until Final Fantasy XIII, a multi-platform release. A Microsoft Windows port followed in 2000, with the addition of the Chocobo World minigame. Final Fantasy VIII was re-released worldwide as a PSOne Classic on the PlayStation Store in 2009, for PlayStation 3 and PlayStation Portable, with support for PlayStation Vita in 2012. It was re-released via Steam in 2013. By August 2019, it had sold more than 9.6 million copies worldwide. A remastered version was released for Microsoft Windows, Nintendo Switch, PlayStation 4, and Xbox One in September 2019.", "developer": ["Square Product Development Division 1"], "genre": "Role-playing", "date_release": "1999-02-11"}, "Final Fantasy XI": {"producer": [null, null], "composer": null, "description": "Final Fantasy XI, also known as Final Fantasy XI Online, is a massively multiplayer online role-playing game (MMORPG), developed and published by Square (later Square Enix) as part of the Final Fantasy series. Designed and produced by Hiromichi Tanaka, it was released in Japan on May 16, 2002, for PlayStation 2 and Microsoft Windows-based personal computers in November of that year. The game was the first MMORPG to offer cross-platform play between PlayStation 2 and personal computer. It was also the Xbox 360's first MMORPG. All versions of the game require a monthly subscription to play.The story is set in the fantasy world of Vana'diel, where player-created avatars can both compete and cooperate in a variety of objectives to develop an assortment of jobs, skills, and earn in-game item rewards. Players can undertake an array of quests and progress through the in-game hierarchy and through the major plot of the game. Since its debut in 2002, five expansion packs have been released along with six add-on scenarios. Each expansion pack and add-on brings a new major storyline to the Final Fantasy XI world, along with numerous areas, quests, events and item rewards.\nIn 2015, Square Enix released the final main scenario for Final Fantasy XI titled Rhapsodies of Vana'diel. Final Fantasy XI became the final active server on the PlayStation 2 online service. The servers for the PlayStation 2 and Xbox 360 versions were ultimately shut down on March 31, 2016. A mobile client for the game is under development by Square Enix in collaboration with Korean developer Nexon. A spinoff mobile game, Final Fantasy Grandmasters was released on September 30, 2015.", "developer": [null, "[2]", null, "[2]"], "genre": "Role-playing", "date_release": "2002-05-16"}, "Firefall": {"composer": null, "description": "Firefall is an American country rock band that formed in Boulder, Colorado, United States, in 1974. It was founded by Rick Roberts, who had been in the Flying Burrito Brothers, and Jock Bartley, who had been Tommy Bolin's replacement in Zephyr. The band's biggest hit single, \"You Are the Woman\", peaked at No. 9 on the Billboard charts in 1976.  Other hits included \"Just Remember I Love You\" (#11 in 1977), “Strange Way” (#11 in 1978), \"Cinderella\" (#34 in 1977), \"Headed for a Fall\" (#35 in 1980), and \"Staying with It\" (#37 in 1981) with female vocalist Lisa Nemzo.", "developer": ["Red 5 Studios"], "genre": "MMOFPS", "date_release": "2014-07-29"}, "Fistful of Frags": {"description": "This is a selected list of Source engine mods (modifications), the game engine created by Valve Corporation for most of their games, including Half-Life, Team Fortress 2, and Portal, as well as licensed to third parties. This list is divided into single-player and multiplayer mods.", "genre": "First-person shooter", "date_release": "2007-12-20"}, "Five Nights at Freddy's": {"description": "Five Nights at Freddy's (often abbreviated to FNaF) is a media franchise based around an indie video game series created, designed, developed, and published by Scott Cawthon for Microsoft Windows, iOS, and Android.\nThe series is centered on the story of a fictional restaurant named Freddy Fazbear's Pizza, a pastiche of restaurants such as Chuck E. Cheese's and ShowBiz Pizza Place. The first three games involve the player working as a nighttime security guard. The player must utilize several tools such as checking security cameras, while also surviving against animatronic characters, which become mobile and homicidal after hours. The fourth game, which uses different gameplay mechanics from its predecessors, takes place in the house of a child who must defend against nightmarish versions of the animatronics by closing doors and fleeing on foot. The fifth game takes place in a maintenance facility owned by a sister company of Freddy Fazbear's Pizza. The player character is a technician instead of a night guard, who must complete different tasks each night as told by an AI voice heard in the game. In the sixth game, the player acts as the owner of a pizzeria who must decorate with payable items, and must also work the night shift for their pizzeria, which plays similarly to previous games.\nThe series has gained widespread popularity since its release. Three novel adaptations, Five Nights at Freddy's: The Silver Eyes, Five Nights at Freddy's: The Twisted Ones, and Five Nights at Freddy's: The Fourth Closet, were released in 2015, 2017, and 2018, respectively. A guidebook for the series, Five Nights at Freddy's: The Freddy Files, was released on August 29, 2017, with an activity book titled Five Nights at Freddy's: Survival Logbook being released on December 26, 2017. A film adaptation is currently in the works.\nA horror attraction based on the series was featured in the Adventuredome in Halloween of 2016. Additionally, the series appeared in the Guinness Book of Records: Gamer's Edition, breaking the record for the largest number of sequels released in a year.", "developer": ["Scott Cawthon"], "genre": "Survival horror", "date_release": "2014-08-08"}, "Five Nights at Freddy's 2": {"description": "Five Nights at Freddy's 2 (often abbreviated to FNaF2) is an indie  point-and-click survival horror video game developed and published by Scott Cawthon. The second installment in the Five Nights at Freddy's series, the game is chronologically set before the events of the first game, making it a prequel to the series. The game was released on Steam on November 11, 2014, earlier than its two planned dates of sometime in 2015 and December 25, 2014, respectively, with the latter due to issues with releasing the demo. Mobile ports for Android and iOS were released on November 15, 2014, and November 20, 2014, respectively.\nSimilar to the previous game, Five Nights at Freddy's 2 centers around the fictional Freddy Fazbear's Pizza, where the player acts as a security guard and must defend himself from the restaurant's animatronic mascots, who are possessed by the souls of murdered children out for revenge on their murderer. The game also introduces several new gameplay components, such as a flashlight, a wearable Freddy Fazbear head (to trick certain animatronics) and 8-bit minigames.The game received mixed-to-positive reviews from critics, who praised the new mechanics but criticized its difficulty in comparison with its predecessor. It was followed by Five Nights at Freddy's 3 on March 2, 2015.", "developer": ["Scott Cawthon"], "genre": "Survival horror", "date_release": "2014-11-10"}, "Five Nights at Freddy's 3": {"description": "Five Nights at Freddy's 3 is an indie point-and-click survival horror video game developed and published by Scott Cawthon. It is the third installment in the Five Nights at Freddy's series, and is chronologically set thirty years after the events of the first game. The game was released on Steam on March 2, 2015, for Android devices on March 7, 2015, and for iOS devices on March 12, 2015.The game received mixed-to-positive reviews from critics, who praised Springtrap and the reworked camera system but criticized the phantom animatronics' jumpscares. A chronological prequel, Five Nights at Freddy's 4, was released on July 23, 2015.", "developer": ["Scott Cawthon"], "genre": "Survival horror", "date_release": "2015-03-02"}, "FlatOut": {"description": "FlatOut is a series of action demolition derby/racing video games created by Finnish independent video game developer Bugbear Entertainment. The FlatOut series has sold a total of almost 3 million units worldwide. Since 2010, the FlatOut games have been developed by Dutch video game developer Team6 game studios B.V., with the first release being FlatOut Wii in 2010, for the Wii. FlatOut 4: Total Insanity was developed by Kylotonn and released on March 17, 2017 for PlayStation 4 and Xbox One in Europe and May 2, 2017 in the U.S.", "developer": ["Bugbear Entertainment"], "genre": "Racing", "date_release": "2004-11-05"}, "FlatOut 2": {"description": "FlatOut 2 is a racing video game developed by Bugbear Entertainment and published by Empire Interactive. It is the sequel to the 2004 game FlatOut.\nThis game is themed more on the street racing/import tuner scene than its predecessor. A notable change is the tire grip; players can take more control of their car, worrying less about skidding in tight turns. The game has three car classes: derby, race, and street.\nIt was released in Russia on June 29, 2006, in Europe on June 30, 2006, and in North America on August 1, 2006. In 2008, an OS X version of the game was released by Virtual Programming. In 2014, a Linux version of the game was released on GOG.com as part of the launch of Linux support.An enhanced port was released in 2007 for the Xbox 360 and Windows as FlatOut: Ultimate Carnage. A PlayStation Portable port of Ultimate Carnage was released as FlatOut: Head On.", "developer": ["Bugbear Entertainment"], "genre": "Racing", "date_release": "2006-06-30"}, "FlatOut 3: Chaos & Destruction": {"description": "FlatOut 3: Chaos & Destruction is an action racing video game developed by Team6 Game Studios and published by Strategy First. Unlike most other titles before it in the FlatOut series, it was not developed by Bugbear Entertainment and the only one not published outside the digital market. The game was released worldwide on 13 December 2011.", "developer": ["Team6 Game Studios"], "genre": "Racing", "date_release": "2011-12-13"}, "FlatOut: Ultimate Carnage": {"description": "FlatOut 2 is a racing video game developed by Bugbear Entertainment and published by Empire Interactive. It is the sequel to the 2004 game FlatOut.\nThis game is themed more on the street racing/import tuner scene than its predecessor. A notable change is the tire grip; players can take more control of their car, worrying less about skidding in tight turns. The game has three car classes: derby, race, and street.\nIt was released in Russia on June 29, 2006, in Europe on June 30, 2006, and in North America on August 1, 2006. In 2008, an OS X version of the game was released by Virtual Programming. In 2014, a Linux version of the game was released on GOG.com as part of the launch of Linux support.An enhanced port was released in 2007 for the Xbox 360 and Windows as FlatOut: Ultimate Carnage. A PlayStation Portable port of Ultimate Carnage was released as FlatOut: Head On.", "developer": ["Bugbear Entertainment"], "genre": "Racing", "date_release": "2007-07-22"}, "For the Glory: A Europa Universalis Game": {"description": "For the Glory is a grand strategy wargame that is based on Europa Universalis II and Paradox's Europa Engine. It was developed by Crystal Empire Games, a studio composed of members of the Europe Universalis II modification \"Alternative Grand Campaign / Event Exchange Project\" (AGCEEP) team, and published by Paradox Interactive. It was announced on September 4, 2009 and was released November 10/11, 2009. The game is available for Windows.\nIn For the Glory, the player chooses from over 190 nations spanning the 1000 province globe to guide a single nation from 1399 to 1819, managing its economy, military, political alliances, scientific development, exploration and colonization, religious affairs, and internal stability. It features over 10,000 historically accurate events and rulers.The game's reviews praised its immersive experience in the history of the period, its improved graphics, and its enhanced interfaces (when compared to its Europa Universalis II start point). However, multiplayer stability issues, laborious management, and irritating sound effects soured opinions.", "genre": "Grand strategy", "date_release": "2009-11-11"}, "The Forest": {"composer": "Gabe Castro", "description": "A forest is a large area dominated by trees.  Hundreds of more precise definitions of forest are used throughout the world, incorporating factors such as tree density, tree height, land use, legal standing and ecological function. According to the widely used Food and Agriculture Organization definition, forests covered 4 billion hectares (9.9×109 acres) (15 million square miles) or approximately 30 percent of the world's land area in 2006.Forests are the dominant terrestrial ecosystem of Earth, and are distributed around the globe. Forests account for 75% of the gross primary production of the Earth's biosphere, and contain 80% of the Earth's plant biomass. Net primary production is estimated at 21.9 gigatonnes carbon per year for tropical forests, 8.1 for temperate forests, and 2.6 for boreal forests.Forests at different latitudes and elevations form distinctly different ecozones: boreal forests around the poles, tropical forests around the Equator, and temperate forests at the middle latitudes. Higher elevation areas tend to support forests similar to those at higher latitudes, and amount of precipitation also affects forest composition.\nHuman society and forests influence each other in both positive and negative ways. Forests provide ecosystem services to humans and serve as tourist attractions. Forests can also affect people's health. Human activities, including harvesting forest resources, can negatively affect forest ecosystems.", "genre": "Survival horror", "date_release": "2013-05-30"}, "A Fork in the Tale": {"description": "A Fork in the Tale is a full motion video (FMV) comedic adventure game developed by Advance Reality Interactive and published  by Any River Entertainment on February 28, 1997. The game draws a heavy influence from Don Bluth's Dragon's Lair games and features Bay Area actors Dale Morris, Fred Smith, Michael Ronin Orlando, Eric Carlson, Kaliopi Eleni, Jett, Pamela Herron and Jody Mortara among the fifty plus roles, as well as voice-overs by comedian Rob Schneider. Because of the large number of video sequences, the game was originally released on 5 CDs.", "genre": "Adventure", "date_release": "1997-02-28"}, "Fortnite": {"description": "Fortnite is an online video game developed by Epic Games and released in 2017. It is available in three distinct game mode versions that otherwise share the same general gameplay and game engine: Fortnite: Save the World, a cooperative shooter-survival game for up to four players to fight off zombie-like creatures and defend objects with fortifications they can build; Fortnite Battle Royale, a free-to-play battle royale game where up to 100 players fight to be the last person standing; and Fortnite Creative, where players are given complete freedom to create worlds and battle arenas. The first two-game modes were released in 2017 as early access titles and Creative was released on December 6, 2018. Save the World is available only for Windows, macOS, PlayStation 4, and Xbox One, while Battle Royale released for those platforms, in addition for Nintendo Switch, iOS and Android devices.\nWhile the first two games have been successful for Epic Games, Fortnite Battle Royale became a resounding success, drawing in more than 125 million players in less than a year and earning hundreds of millions of dollars per month, and since has become a cultural phenomenon.\n\n", "developer": ["Epic Games", "People Can Fly"], "genre": "co-op", "date_release": "2017-07-25"}, "Fragile Allegiance": {"description": "Fragile Allegiance is an open-ended 4X real-time strategy (RTS) game from Gremlin Interactive, released in 1996 for MS-DOS and Windows 95. The game begins on May 25, 2496, as the player begins their employment with TetraCorp (a large interstellar megacorporation) who have set up a new asteroid mining franchise operation in the Fragmented Sectors. There are six alien races competing with Tetracorp for these resources. Beginning with one building and one million credits, the player is tasked with building up a successful mining operation to sell as much ore as possible to the Federation. Diplomacy is crucial to the success or failure of this franchise operation as the players' colonies begin to encroach on one another.\nThe game features complex diplomacy between players and includes real-time lip-synced animations for in-game actors. Described as a combination of SimCity 2000, Civilization and Risk, Fragile Allegiance uses an icon based GUI for all menus and game commands. Unlike other RTS games, there is no defined tech tree, with technology being unlocked by the purchase of 36 blueprints at any time during the course of the game. Fragile Allegiance is the spiritual successor to K240 and there are many similarities between the two.\nFragile Allegiance generally scored well with reviewers, with PC Gamer UK giving the game the Game of Distinction award and it was praised for its graphics, interface and sound. The game has problems running on Windows XP and later Windows versions, as it was designed for MS-DOS and ported to Windows 95.", "developer": ["Gremlin Interactive"], "genre": "4X", "date_release": "1996-12-01"}, "[3]": {"description": "3% is a Brazilian dystopian thriller web television series created by Pedro Aguilera, starring João Miguel and Bianca Comparato. Developed from a 2009 independent pilot episode, it is the first Portuguese-language Netflix original series and the second non-English production, after the Spanish-language series Club de Cuervos.\nThe series is set in an unspecified future when 20-year-old individuals of the impoverished \"Inland\" have the single opportunity to complete \"The Process\" and advance to the affluence of the distant \"Offshore\" society. While most of the unsuccessful candidates are simply eliminated, some fail to survive, leading to only 3% of the candidates succeeding.The first season, consisting of 8 episodes, became available on Netflix worldwide on November 25, 2016. In December 2016, Netflix renewed the series for a second season, which was released on April 27, 2018, consisting of 10 episodes. In June 2018, the series was renewed for a third season, consisting of 8 episodes, which was released on June 7, 2019. In August, 2019 it was announced that the series had been renewed for a fourth and final season.", "genre": "Survival, RPG\n", "date_release": "2016-03-26"}, "Freelancer": {"producer": "Phil Wattenbarger", "composer": null, "description": "Freelance (sometimes spelled free-lance or free lance), freelancer, and freelance worker, are terms commonly used for a person who is self-employed and is not necessarily committed to a particular employer long-term. Freelance workers are sometimes represented by a company or a temporary agency that resells freelance labor to clients; others work independently or use professional associations or websites to get work.\nWhile the term independent contractor would be used in a higher register of English to designate the tax and employment classes of this type of worker, the term \"freelancing\" is most common in culture and creative industries, and use of this term may indicate participation therein.Fields, professions, and industries where freelancing is predominant include: music, writing, acting, computer programming, web design, graphic design, translating and illustrating, film and video production and other forms of piece work which some cultural theorists consider as central to the cognitive-cultural economy.", "developer": ["Digital Anvil"], "genre": "Space trading and combat simulator", "date_release": "2003-03-04"}, "FTL: Faster Than Light": {"composer": "Ben Prunty", "description": "FTL: Faster Than Light is a space-based top-down real-time strategy roguelike game created by indie developer Subset Games, which was released for Microsoft Windows, OS X and Linux in September 2012. In the game, the player controls the crew of a single spacecraft, holding critical information to be delivered to an allied fleet, while being pursued by a large rebel fleet. The player must guide the spacecraft over eight sectors, each with planetary systems and events procedurally generated in a roguelike fashion, while facing rebel and other hostile forces, recruiting new crew, and outfitting and upgrading their ship. Combat takes place in pausable real time, and if the ship is destroyed or all of its crew lost, the game ends, forcing the player to restart with a new ship.\nThe concept for FTL was based on tabletop board games and other non-strategic space combat video games that required the player to manage an array of ship's functions. The initial development by the two-man Subset Games was self-funded, and guided towards developing entries for various indie game competitions. With positive responses from the players and judges at these events, Subset opted to engage in a crowd-sourced Kickstarter campaign to finish the title, and succeeded in obtaining twenty times more than they had sought; the extra funds were used towards more professional art, music and in-game writing.\nThe game, considered one of the major successes of the Kickstarter fundraisers for video games, was released in September 2012 to positive reviews. An updated version, FTL: Advanced Edition, added additional ships, events, and other gameplay elements, and was released in April 2014 as a free update for existing owners and was put up for purchase on iPad devices. The game received generally positive reviews from critics, who praised the game's creativity. FTL is recognized alongside games like Spelunky and The Binding of Isaac that helped popularize indie \"roguelike-like\" games that use some but not all of the principles of a classical roguelike.", "developer": ["Subset Games"], "genre": "Indie", "date_release": "2012-09-14"}}