{"War of the Lance": {"description": "The War of the Lance is a fictional war in the Dragonlance setting, created by Margaret Weis and Tracy Hickman.\nThe six Heroes of the Lance march to fight against Verminaard, the lord of the draconians, and the Dark Goddess; the heroes ultimately prevail with the just-forged Dragonlance.", "developer": ["Strategic Simulations, Inc."], "genre": "Strategy", "date_release": "1988-05-01"}, "War of the Roses": {"producer": "Mika'il Yazbeck", "composer": "Linus Söderlund", "description": "The Wars of the Roses were a series of English civil wars for control of the throne of England fought between supporters of two rival cadet branches of the royal House of Plantagenet: the House of Lancaster, associated with the Red Rose of Lancaster, and the House of York, whose symbol was the White Rose of York. Eventually, the wars eliminated the male lines of both families. The conflict lasted through many sporadic episodes between 1455 and 1487, but there was related fighting before and after this period between the parties. The power struggle ignited around social and financial troubles following the Hundred Years' War, unfolding the structural problems of bastard feudalism, combined with the mental infirmity and weak rule of King Henry VI which revived interest in the House of York's claim to the throne by Richard of York. Historians disagree on which of these factors to identify as the main reason for the wars.With the Duke of York's death in 1460, the claim transferred to his heir, Edward.  After a series of Yorkist victories from January–February 1461, Edward claimed the throne on 4 March 1461, and the last serious Lancastrian resistance ended at the decisive Battle of Towton.   Edward was thus unopposed as the first Yorkist king of England, as Edward IV.  Resistance smoldered in the North of England until 1464, but the early part of his reign remained relatively peaceful.\nA new phase of the wars broke out in 1469 after the Earl of Warwick, the most powerful noble in the country, withdrew his support for Edward and threw it behind the Lancastrian cause.  Fortunes changed many times as the Yorkist and Lancastrian forces exchanged victories throughout 1469–70 (and Edward was even captured for a time in 1469).  When Edward fled to Flanders in 1470, Henry VI was re-installed as king on 3 October 1470, but his resumption of rule was short lived, and he was deposed again following the defeat of his forces at the Battle of Tewkesbury, and on 21 May 1471, Edward entered London unopposed, resumed the throne, and probably had Henry killed that same day.  With all significant Lancastrian leaders now banished or killed, Edward ruled unopposed until his sudden death in 1483. His 12-year-old son reigned for 78 days as Edward V.  He was then deposed by his uncle, Edward IV's brother Richard, who became Richard III.\nThe ascension of Richard III occurred under a cloud of controversy, and shortly after assuming the throne, the wars sparked anew with Buckingham's rebellion, as many die-hard Yorkists abandoned Richard to join Lancastrians.  While the rebellions lacked much central coordination, in the chaos the exiled Henry Tudor, son of Henry VI's half-brother Edmund Earl of Richmond, and the leader of the Lancastrian cause, returned to the country from exile in Brittany at the head of an army of combined Breton and English forces.  Richard avoided direct conflict with Henry until the Battle of Bosworth Field on 22 August 1485.  After Richard III was killed and his forces defeated at Bosworth Field, Henry assumed the throne as Henry VII and married Elizabeth of York, the eldest daughter and heir of Edward IV, thereby uniting the two claims. The House of Tudor ruled the Kingdom of England until 1603, with the death of Elizabeth I, granddaughter of Henry VII and Elizabeth of York.\nShortly after Henry took the throne, the Earl of Lincoln, a Yorkist sympathizer, put forward Lambert Simnel as an imposter Edward Plantaganet, a potential claimant to the throne.  Lincoln's forces were defeated, and he was killed at the Battle of Stoke Field on 16 June 1487, bringing a close to the Wars of the Roses.", "developer": ["Paradox Interactive"], "genre": "Action role-playing", "date_release": "2012-10-02"}, "Warcraft: Orcs & Humans": {"producer": null, "composer": null, "description": "Warcraft: Orcs & Humans is a real-time strategy game (RTS) developed and published by Blizzard Entertainment, and published by Interplay Productions in Europe. The first version, for MS-DOS, was released in North America on 23 November 1994 and the Classic Mac OS version followed in early 1996. The MS-DOS version was re-released by Sold-Out Software in 2002.\nAlthough Warcraft: Orcs & Humans was not the first RTS title to offer multiplayer games, Blizzard's game persuaded a wider audience that multiplayer capabilities were essential for future RTS games. The game introduced innovations in its mission design and gameplay elements, which were adopted by other RTS developers.\nBlizzard's main emphases in Warcraft games were on: skillful management of relatively small forces, and on development of characterization and storyline within and between games played in the same fictional universe. Sales were fairly high, reviewers were mostly impressed, and the game won three awards, and was a finalist for three others. The game's sequel, Warcraft II: Tides of Darkness, became the main rival to Westwood Studios' Command & Conquer series, and this competition fostered an \"RTS boom\" in the mid– to late 1990s.\nThe game and its plot was later adapted as the 2016 film Warcraft.", "developer": ["Blizzard Entertainment"], "genre": "RTS", "date_release": "1994-11-23"}, "Warcraft III: Reign of Chaos": {"producer": "Chris Sigaty", "composer": null, "description": "Warcraft III: Reign of Chaos is a high fantasy real-time strategy computer video game developed and published by Blizzard Entertainment released in July 2002. It is the second sequel to Warcraft: Orcs & Humans, after Warcraft II: Tides of Darkness, the third game set in the Warcraft fictional universe, and the first to be rendered in three dimensions. An expansion pack, The Frozen Throne, was released in July 2003. Warcraft III is set several years after the events of Warcraft II, and tells the story of the Burning Legion's attempt to conquer the fictional world of Azeroth with the help of an army of the Undead, led by fallen paladin Arthas Menethil. It chronicles the combined efforts of the Human Alliance, Orcish Horde, and Night Elves to stop them before they can corrupt the World Tree.\nIn the game, as in many real-time strategy (RTS) games, players collect resources, train individual units and heroes, and build bases in order to: achieve various goals (in single-player mode), or to defeat the enemy player. Four playable factions can be chosen from: Humans, Orcs, (both of which appeared in the previous games) and two new factions: the Night Elves and the Undead. Warcraft III's single-player campaign is laid out similarly to that of StarCraft, and is told through the races in a progressive manner. Players can also play matches against the computer, or against others—using local area networking (LAN) or Blizzard's Battle.net gaming platform.\nAfter Warcraft II: Beyond the Dark Portal, the last in the Warcraft II saga, was released in 1996, Blizzard began development of a point-and-click adventure game called Warcraft Adventures: Lord of the Clans, which was supposed to continue the story. Lord of the Clans was canceled in favor of Warcraft III in 1998, which was presented to the public at the European Computer Trade Show in September 1999. The game's design and gameplay was significantly altered during development, with the final game sharing little similarities with the originally presented version (see similarities to StarCraft).\nThe game received acclaim from critics, who praised the game's presentation and multiplayer features. It is considered an influential example of RTS video games. Warcraft III was a commercial success, shipping 4.4 million copies to retail stores, selling over a million within a month.", "developer": ["Blizzard Entertainment"], "genre": "RTS", "date_release": "2002-07-03"}, "Wargame: AirLand Battle": {"description": "Wargame: AirLand Battle is a real-time strategy video game developed by Eugen Systems and published by Focus Home Interactive, released on May 29, 2013. It is set in Europe during the Cold War, most specifically in the years 1975–85. It is the sequel to the 2012 Wargame: European Escalation.", "developer": ["Eugen Systems"], "genre": "Real-time tactics", "date_release": "2013-05-29"}, "Wargame: European Escalation": {"description": "Wargame: European Escalation is a real-time tactics video game developed by Eugen Systems and published by Focus Home Interactive, released on February 23, 2012. It is set in Europe during the Cold War, most specifically in the years 1975–85 with alternate history scenarios portraying open war between NATO and the Warsaw Pact.", "developer": ["Eugen Systems"], "genre": "Real-time tactics", "date_release": "2012-02-22"}, "Wargame: Red Dragon": {"description": "Wargame: Red Dragon is a real-time strategy video game developed by Eugen Systems and published by Focus Home Interactive, released on April 17, 2014. It is the sequel to the 2013 Wargame: AirLand Battle.", "developer": ["Eugen Systems"], "genre": "Real-time tactics", "date_release": "2014-04-17"}, "Warhammer 40,000: Dawn of War II": {"producer": "Mark Noseworthy", "composer": null, "description": "Warhammer 40,000: Dawn of War II is a real-time strategy-tactical role-playing video game developed by Relic Entertainment and published by THQ for Microsoft Windows based on the fictional Warhammer 40,000 universe. It is the sequel to the Warhammer 40,000: Dawn of War video game series. Dawn of War II was released in North America on February 19, 2009 and in Europe on February 20, 2009. A sequel, Dawn of War III, was released in April 2017.", "developer": ["Relic Entertainment"], "genre": "Real-time tactics", "date_release": "2009-02-19"}, "Wasteland": {"producer": "David Albert", "description": null, "developer": ["Interplay Productions"], "genre": "RPG", "date_release": "1988-01-01"}, "Wasteland 2": {"producer": null, "composer": "Mark Morgan", "description": "Wasteland 2 is a post-apocalyptic role-playing video game developed by inXile Entertainment and published by Deep Silver. It is the sequel to 1988's Wasteland, and was successfully crowdfunded through Kickstarter. After the postponement of the original release date from October 2013, it was released for Microsoft Windows, OS X, and Linux in September 2014. An enhanced version of the game, named Wasteland 2: Director's Cut, was released in October 2015, including versions for PlayStation 4, Xbox One, and Nintendo Switch.", "developer": ["inXile Entertainment"], "genre": "RPG", "date_release": "2014-09-19"}, "Wheels of Aurelia": {"composer": null, "description": "Wheels of Aurelia is a visual novel and adventure video game that was developed and published by Santa Ragione, and was released worldwide on 20 September 2016 for Linux, Microsoft Windows and OS X, and later released on 4 October 2016 for PlayStation 4,  Xbox One and a mobile version on 19 October 2017 for iOS. The game was also released on 2 November 2017 for the Nintendo Switch. Its story is set in Italy in 1978 and tells the story of the player-character, a woman named Lella who drives along the Italian motorway Via Aurelia alongside one or many companions.\nFrom a bird's-eye view, the player controls Lella's vehicle and dialogue choices; the game's narrative has a branching dialogue system. On her way across Via Aurelia, she meets hitchhikers who can alter the story's outcomes. While the game is fairly short, it offers 16 different endings. The game was inspired by the 1986 arcade game Out Run and the cult film Il Sorpasso. Wheels of Aurelia received mixed reviews from critics; while its atmosphere and aesthetics were praised, reviewers thought the gameplay was fitted into the narrative poorly.", "genre": "Visual Novel", "date_release": "2016-09-20"}, "White Night": {"producer": "Mathieu Fremont", "composer": null, "description": null, "genre": "Survival horror", "date_release": "2015-03-03"}, "Widelands": {"description": "Widelands is a free slow-paced real-time strategy  video game under the GNU General Public License. Widelands takes many ideas from and is quite similar to The Settlers and The Settlers II. It is still a work in progress game, with development still required in graphics and bugfixing. The game runs on several operating systems such as AmigaOS 4, Linux, BSD, Mac OS X and Windows.", "genre": "Widelands", "date_release": "2019-05-02"}, "WildStar": {"producer": "Jeremy Gaffney", "composer": "Jeff Kurtenacker", "description": "WildStar was a fantasy/science fiction massively multiplayer online role-playing game that was developed by Carbine Studios, published by NCSOFT. It was unveiled on August 17, 2011 during Gamescom. WildStar took place on the fictional planet Nexus, where a mysterious and powerful race known as the Eldan have disappeared, leaving behind a wealth of technology and secrets for players to explore.The game was released on June 3, 2014 with a subscription and later changed to free-to-play on September 29, 2015. While it was no longer required to pay for a subscription, those who did were \"signature\" members, getting a few bonuses such as increased experience/currency gain.\nOn September 6, 2018, NCSoft announced the immediate closure of Carbine Studios and that WildStar 'would begin the process of winding down'. An exact shut-down date was not given but later stated to be November 28, 2018.\n\n", "developer": ["Carbine Studios"], "genre": "MMORPG", "date_release": "2014-06-07"}, "The Witcher": {"producer": "Maciej Miąsik", "composer": null, "description": "The Witcher (Polish: Wiedźmin, Polish pronunciation: [ˈvʲɛd͡ʑmʲin]), is a fantasy series of novels and short stories written by Polish author Andrzej Sapkowski. The series revolves around the eponymous \"witcher\", Geralt of Rivia. In Sapkowski's works, \"witchers\" are beast hunters who develop supernatural abilities at a young age to battle wild beasts and monsters. The books have been adapted into a film, a television series, video games, and a graphic novel series. The series of novels is known as the Witcher Saga. The short stories and novels have been translated into numerous languages, including English.\nThe books have been described as having a cult following in Poland, and in other Central and Eastern European countries. The video games have been very successful, and as of March 2018, they have sold over 33 million copies worldwide.", "developer": ["CD Projekt Red"], "genre": "Action role-playing", "date_release": "2007-10-26"}, "The Witcher 3: Wild Hunt": {"producer": [null, null], "composer": null, "description": "The Witcher 3: Wild Hunt is a 2015 action role-playing game developed and published by CD Projekt, based on The Witcher series of fantasy novels by Andrzej Sapkowski. It is the sequel to the 2011 game The Witcher 2: Assassins of Kings. Played in an open world with a third-person perspective, players control protagonist Geralt of Rivia, a monster hunter known as a witcher, who is looking for his missing adopted daughter on the run from the Wild Hunt: an otherworldly force determined to capture and use her powers. Players battle the game's many dangers with weapons and magic, interact with non-player characters, and complete main-story and side quests to acquire experience points and gold, which are used to increase Geralt's abilities and purchase equipment. Its central story has several endings, determined by the player's choices at certain points in the game.\nDevelopment began in 2011 and lasted for three and a half years. Voice recording took over two and a half years. The writing was infused with realistic aspects like moral ambiguity in a deliberate attempt to avoid simplification, impart authenticity, and reflect Sapkowski's novels. Central and Northern European cultures formed the basis of the game's world. REDengine 3 enabled the developer to create a complex story without compromising the game's open world. The music was composed by Marcin Przybyłowicz and performed by the Brandenburg State Orchestra.\nThe Witcher 3: Wild Hunt was released for Microsoft Windows, PlayStation 4, and Xbox One in May 2015, with a Nintendo Switch version slated for October 2019. The game received critical acclaim, with praise for its gameplay, narrative, world design, combat, and visuals, although it received minor criticism due to technical issues. It received numerous Game of the Year awards, and has been cited as one of the greatest video games of all time. It was also a commercial success, shipping over twenty million copies by June 2019. Two expansions, Hearts of Stone and Blood and Wine, were also released to critical acclaim. A Game of the Year edition, with the base game, expansions and all downloadable content, was released in August 2016.", "developer": ["CD Projekt Red"], "genre": "Action role-playing", "date_release": "2015-05-19"}, "Wizards & Warriors": {"composer": "Steve Miller", "description": "Wizards & Warriors is a platforming video game developed by Rare for the Nintendo Entertainment System (NES). It was published by Acclaim and released in North America in December 1987, and in Europe on January 7, 1990. It was also released in Japan by Jaleco on July 15, 1988, under the title Densetsu no Kishi Elrond (伝説の騎士エルロンド, Legendary Knight Elrond). In the game, the player controls Kuros, \"Knight Warrior of the Books of Excalibur\", as he sets out in the Kingdom of Elrond to defeat the evil wizard Malkil. Malkil holds the princess of Elrond captive in Castle IronSpire, deep within the forests of Elrond. The player fights through forests, tunnels, and caves, while also collecting keys, treasure, weapons, and magic items.\nWizards & Warriors was the second game Rare released for the NES, after the skiing simulator Slalom (1987). In the months surrounding its North American and European releases, Wizards & Warriors was featured in a number of video game magazines, including Nintendo Fun Club News, Nintendo Power, and VideoGames & Computer Entertainment. The game was praised for its graphics, sound, difficulty, and arcade-style gameplay. In 2010, Retro Gamer called Wizards & Warriors \"a unique experience for NES gamers in 1987\" that was \"technically well ahead of other games for the console at the time\", but attributed the game's relatively low difficulty to allowing unlimited continues without penalty. Wizards & Warriors was followed by three sequels: Ironsword: Wizards & Warriors II (1989), Wizards & Warriors III: Kuros: Visions of Power (1992), and Wizards & Warriors X: The Fortress of Fear (1990).", "developer": ["Heuristic Park"], "genre": "RPG", "date_release": "2000-09-27"}, "World in Conflict": {"description": "World in Conflict is a 2007 real-time strategy (RTS) video game developed by the Swedish video game company Massive Entertainment and published by Vivendi Games for Microsoft Windows. The game was released in September 2007, receiving generally favorable reviews and several awards.  The game is considered by some to be the spiritual successor of Ground Control, another game by Massive Entertainment, and is generally conceived by its designers to be a real-time tactical game, despite being marketed as a RTS game.The game's setting and story takes place in an alternate 1989, in which an impending economic collapse and the failure to achieve aid diplomatically from the West, leads the Soviet Union to invading Western Europe, triggering World War III. The single-player story sees players assume the role of a United States Army officer who takes command of battalions of US and NATO forces; the main bulk of their operations focus on combating a surprise invasion of the United States from Seattle, Washington, as well as operations in Southern France, Russia, and New York.A March 2009 expansion pack, World in Conflict: Soviet Assault, added additional content, including additional campaign missions in which players assume the role of a Soviet military officer who commands Soviet forces in Europe, Russia and the US state of Washington.The game offers multiplayer functionality, supporting up to 16 players online or over LAN. In December 2015, Ubisoft shut down the official Massgate servers that supported multiplayer functions, though the player community restored these functions in 2017, through an unaffiliated version of Massgate.", "developer": ["Massive Entertainment"], "genre": "Real-time tactics", "date_release": "2007-09-18"}, "World in Conflict: Soviet Assault": {"description": "World in Conflict: Soviet Assault is a 2009 expansion pack developed by Massive Entertainment and Swordfish Studios for the 2007 real-time tactics video game World in Conflict. It features the ability to play as the Soviet Union in the single player campaign, against which the player fought in the original World in Conflict as well as adding additional multiplayer maps.The game is set in an alternate 1989 in which the Politburo of the Soviet Union elects to take military action to sustain itself, rather than collapse. Failing to achieve aid diplomatically, the Soviet Union invades Western Europe and the Pacific Northwest region of the United States. However, in addition to the standard US campaign, the player also assumes the role of Romanov, a lieutenant in the Soviet Army under the command of Colonel Vladimir Orlovsky. Orlovsky also commands two other subordinates in his battalion; his nephew Captain Nikolai Malashenko and old friend Major Valeriy Lebedjev, a KGB officer attached to the battalion. The expansion adds a total of six Soviet missions interspersed between the original game's missions, thus completing the story and acting as an update for the campaign while retaining the original game's units and features.\nThe World In Conflict Complete Edition and stand alone Soviet Assault Expansion Pack were released in the United States on March 10, 2009, and later on in Europe and Australia on March 12, 2009.\nWorld in Conflict: Soviet Assault offers multiplayer functionality, supporting up to 16 players online or over LAN. The official Massgate servers were shut down by Ubisoft in December 2015. However, in 2017, the player community restored online multiplayer functionality through an unaffiliated version of Massgate.", "developer": ["Massive Entertainment"], "genre": "Real-time tactics", "date_release": "2009-03-10"}, "World of Goo": {"producer": "Ron Carmel", "composer": "Kyle Gabler", "description": "World of Goo is a puzzle video game developed and published by independent game developer 2D Boy. The game was released on Microsoft Windows and Wii platforms on October 13, 2008, with releases on Nintendo Switch, Mac OS X, Linux, and various mobile devices in subsequent years.\nThe game was nominated for numerous awards—the Seumas McNally Grand Prize, Design Innovation Award, and Technical Excellence—at the Independent Games Festival, and has gone on to win several other gaming awards. The game was critically acclaimed and became an example of a commercially successful indie game.", "developer": ["2D Boy"], "genre": "Puzzle", "date_release": "2008-10-13"}, "World of Tanks": {"composer": "Sergey Khmelevsky", "description": "World of Tanks (WoT) is a massively multiplayer online game developed by Belarusian company Wargaming, featuring mid-20th century (1930s–1960s) era combat vehicles. It is built upon a freemium business model where the game is free-to-play, but participants also have the option of paying a fee for use of \"premium\" features. The focus is on player vs. player gameplay with each player controlling an armored vehicle.\nWorld of Tanks has been ported to multiple gaming consoles. The PlayStation 4, Xbox 360 and Xbox Ones version was developed by Wargaming West studio. World of Tanks has also recently expanded to mobile platforms under the title World of Tanks Blitz, in addition to a board game titled World of Tanks Rush and a collectable card game titled World of Tanks: Generals. World of Tanks was followed by World of Warplanes and World of Warships.", "developer": ["Wargaming"], "genre": "Action", "date_release": "2011-04-12"}, "World of Warplanes": {"description": "World of Warplanes (WoWp) is a free-to-play aerial combat massively multiplayer online (MMO) game developed by Persha Studia and published by Wargaming.net. The game was originally released in November 2013 in CIS countries, North America and Europe. It was relaunched as World of Planes 2.0 in October 2017 in the same countries, achieving significantly better reception.", "developer": ["Wargaming"], "genre": "Action", "date_release": "2013-11-13"}, "World of Warcraft": {"composer": null, "description": "World of Warcraft (WoW) is a massively multiplayer online role-playing game (MMORPG) released in 2004 by Blizzard Entertainment. It is the fourth released game set in the Warcraft fantasy universe. World of Warcraft takes place within the Warcraft world of Azeroth, approximately four years after the events at the conclusion of Blizzard's previous Warcraft release, Warcraft III: The Frozen Throne. The game was announced in 2001, and was released for the 10th anniversary of the Warcraft franchise on November 23, 2004. Since launch, World of Warcraft has had seven major expansion packs released for it: The Burning Crusade, Wrath of the Lich King, Cataclysm, Mists of Pandaria, Warlords of Draenor, Legion, and Battle for Azeroth.\nWorld of Warcraft was the world's most popular MMORPG by player count of nearly 10 million in 2009. The game had a total of over a hundred million registered accounts by 2014. By 2017, the game had grossed over $9.23 billion in revenue, making it one of the highest-grossing video game franchises of all time. At BlizzCon 2017, a vanilla version of the game titled World of Warcraft Classic was announced, which planned to provide a way to experience the base game before any of its expansions launched. It went live at 3pm PDT on August 26, 2019.", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2004-11-23"}, "World of Warcraft: The Burning Crusade": {"composer": null, "description": "World of Warcraft: The Burning Crusade is the first expansion set for the MMORPG World of Warcraft. It was released on January 16, 2007 at local midnight in Europe and North America, selling nearly 2.4 million copies on release day alone and making it, at the time, the fastest-selling PC game released at that point. Approximately 3.53 million copies were sold in the first month of release, including 1.9 million in North America, over 100,000 copies in Australasia, and nearly 1.6 million in Europe.\n\n", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2007-01-15"}, "World of Warcraft: Cataclysm": {"description": "World of Warcraft: Cataclysm is the third expansion set for the massively multiplayer online role-playing game (MMORPG) World of Warcraft, following Wrath of the Lich King. It was officially announced at BlizzCon on August 21, 2009, although dataminers and researchers discovered details before it was officially announced by Blizzard. The expansion was officially released on December 7, 2010.\nShortly after the announcement of the release date, on October 12, 2010, Blizzard implemented patch 4.0.1, which included the overhaul of the game's playing systems.", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2010-12-07"}, "World of Warcraft: Legion": {"composer": null, "description": "World of Warcraft: Legion is the sixth expansion set in the massively multiplayer online role-playing game (MMORPG) World of Warcraft, following Warlords of Draenor. It was announced on August 6, 2015 at Gamescom 2015. The expansion was released on August 30, 2016.The expansion raises the existing level cap from 100 to 110, features artifact weapons for each class's specializations, includes a new area on Azeroth called the Broken Isles and introduces the demon hunter hero class that starts at level 98. It initially included ten 5-man dungeons and two raids.", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2016-08-30"}, "World of Warcraft: Mists of Pandaria": {"composer": null, "description": "World of Warcraft: Mists of Pandaria is the fourth expansion set for the massively multiplayer online role-playing game (MMORPG) World of Warcraft, following Cataclysm. It was announced on October 21, 2011, by Chris Metzen at BlizzCon 2011, and was released on September 25, 2012.Mists of Pandaria raised the existing level cap from level 85 to 90. It introduced a new character class, the monk, along with a new playable race, the Pandaren. The vanity pet system was overhauled and a pet battle system was added. Scenarios were introduced, and Challenge Modes were added for dungeons. The existing talent trees were replaced by a new system of tiered talents awarded every 15 levels. The initial patch included nine new dungeons, three new raids, two new battlegrounds and one new arena. Subsequent patches introduced the Brawler's Guild and heroic versions of the scenarios. Several additional raids, dungeons, a new battleground, and a new arena were also added.", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2012-07-25"}, "World of Warcraft: Warlords of Draenor": {"composer": null, "description": "World of Warcraft: Warlords of Draenor is the fifth expansion set to the massively multiplayer online role-playing game (MMORPG) World of Warcraft, following Mists of Pandaria. It was announced on November 8, 2013 at BlizzCon 2013. The expansion was released on November 13, 2014.The expansion raised the existing level cap from 90 to 100 and introduced player-built, upgradeable garrisons. Most of the player models were updated to have more detailed textures, animations and facial expressions, thus increasing the system requirements of the game.", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2014-11-13"}, "World of Warcraft: Wrath of the Lich King": {"composer": null, "description": "World of Warcraft: Wrath of the Lich King is the second expansion set for the massively multiplayer online role-playing game (MMORPG) World of Warcraft, following The Burning Crusade. It launched on November 13, 2008 and sold 2.8 million copies within the first day, making it the fastest selling computer game of all time released at that point. The game added a substantial amount of new content into the game world, including the new continent of Northrend, home of the eponymous Lich King and his undead minions. In order to advance through Northrend, players are required to reach at least level 68 and the level cap for the expansion is 80. The first hero class was introduced, the Death Knight, that starts at level 55.", "developer": ["Blizzard Entertainment"], "genre": "Online role-playing game", "date_release": "2008-11-13"}}