{"Jade Empire": {"producer": "Jim Bishop", "composer": "Jack Wall", "description": "Jade Empire is an action role-playing game developed by BioWare, originally published by Microsoft Game Studios in 2005 as an Xbox exclusive. It was later ported to Microsoft Windows personal computers (PC) and published by 2K Games in 2007. Later ports to macOS (2008) and mobile platforms (2016) were handled respectively by TransGaming and Aspyr. Set in a world based on Chinese mythology, players control the last surviving Spirit Monk on a quest to save their tutor Master Li and defeat the forces of corrupt emperor Sun Hai. The Spirit Monk is guided through a linear narrative, completing quests and engaging in action-based combat. With morality-based dialogue choices during conversations, the player can impact both story and gameplay progression in various ways.\nDevelopment of Jade Empire began in 2001 as a dream project for company co-founders Ray Muzyka and Greg Zeschuk, who acted as the game's executive producers. Their first original role-playing intellectual property, the game reused the morality system from Star Wars: Knights of the Old Republic, but switched to a real-time combat system. The game's many elements such as its combat system, the world and script, the constructed language created for the game, and the musical score by Jack Wall drew influence from Chinese history, culture and folklore. Upon release, it received widespread critical acclaim. Its success led to the creation of the PC version, which provided the basis for future ports and itself met with positive reviews.", "developer": ["BioWare"], "genre": "Action role-playing", "date_release": "2007-02-26"}, "James Bond 007: Nightfire": {"producer": "Bill Beacham", "composer": null, "description": "James Bond 007: Nightfire is a first-person shooter video game featuring the character of the British secret agent James Bond and a sequel to Agent Under Fire, published by Electronic Arts in 2002. Nightfire was developed by Eurocom for the GameCube, PlayStation 2, and Xbox video game consoles, while Gearbox Software developed the game for Microsoft Windows using the GoldSrc engine. Aspyr later re-released the game for the macOS. The computer versions are substantially different from the console versions, featuring different missions and a modified story line. In 2003, Electronic Arts released Nightfire for the Game Boy Advance (GBA), developed by JV Games and also featuring different missions and a modified story line from the console and computer versions. \nThe game marked Pierce Brosnan's fourth appearance as James Bond before the release of his fourth and final Bond film Die Another Day. His likeness was featured in the game, but not his voice, which was provided by Maxwell Caulfield.", "developer": ["Eurocom", "Gearbox Software", "TransGaming Inc."], "genre": "First-person shooter", "date_release": "2002-11-28"}, "Jazz Jackrabbit": {"producer": [null, null], "composer": null, "description": "Jazz Jackrabbit is a video game trilogy featuring the eponymous character of Jazz Jackrabbit, a green anthropomorphic hare, who fights with his turtle nemesis, Devan Shell, in a science fiction parody of the fable of The Tortoise and the Hare. Created by Arjan Brussee and Cliff Bleszinski and developed by Epic MegaGames, the series debuted on the IBM PC in 1994 with Jazz Jackrabbit. The series consists of two computer games and a handheld console game.", "developer": ["Epic MegaGames", "Arjan Brussee"], "genre": "Side-scrolling shooter", "date_release": "1994-07-30"}, "Jazz Jackrabbit 2": {"producer": null, "composer": "Alexander Brandon", "description": "Jazz Jackrabbit 2 is a platform game produced by Epic MegaGames, now known as Epic Games. It was accidentally confirmed by Arjan Brussee  in 1994 and released in 1998 for PCs running Windows, and later for Macintosh computers. Like the first game, Jazz Jackrabbit, Jazz Jackrabbit 2 is a side-scrolling platform game but features additional multiplayer options, including the ability to play over a LAN or the Internet. On November 30, 2017 it was re-released on GOG.com along with the first game.", "developer": ["Orange Games", "Epic MegaGames"], "genre": "Side-scrolling shooter", "date_release": "1998-04-13"}, "Judge Dredd: Dredd vs. Death": {"description": "Judge Dredd: Dredd vs. Death is a first-person shooter video game based on the Judge Dredd character from the 2000 AD comic series, developed by Rebellion Developments. It was released in 2003 in Europe, and was supposed to be released in March or April 2004 in the United States, but was held back until early 2005.", "developer": ["Rebellion Developments"], "genre": "First-person shooter", "date_release": "2003-10-17"}, "Juiced 2: Hot Import Nights": {"description": "Juiced 2: Hot Import Nights is a racing video game developed by Juice Games for various platforms. The PlayStation 2, Xbox 360 and Nintendo DS versions were released in September 2007. The PlayStation Portable and PlayStation 3 versions were released in October 2007. The Microsoft Windows version was released on November 2007. It is a sequel to the 2005 game Juiced. It was developed by Juice Games and published by THQ. It utilizes more advanced car modification methods in comparison to its predecessor.\nA demo for the Xbox 360 version was released on Xbox Live Marketplace on July 19, 2007. A second, multiplayer demo appeared on September 14, 2007. Ursula Mayes is on the cover of the game on all platforms.\nA Wii version was planned but it was cancelled.", "developer": ["Paradigm Entertainment"], "genre": "Racing", "date_release": "2007-11-16"}, "Jurassic Park": {"producer": null, "composer": null, "description": "Jurassic Park, also known as Jurassic World, is an American science fiction media franchise centered on a disastrous attempt to create a theme park of cloned dinosaurs. It began in 1990 when Universal Pictures and Amblin Entertainment bought the rights to the novel by Michael Crichton before it was even published.\nThe book was successful, as was Steven Spielberg's 1993 film adaptation. The film received a theatrical 3D re-release in 2013, and was selected in 2018 for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" A sequel novel, The Lost World, was published in 1995, followed by a film adaptation in 1997.\nSubsequent films in the series, including Jurassic Park III (2001), are not based on the novels. Numerous video games and comic books based on the franchise have been created since the release of the 1993 film, and several water rides have been opened at various Universal theme parks. As of 2000, the franchise had generated $5 billion in revenue, making it one of the highest-grossing media franchises of all time.The fourth film, Jurassic World, was initially scheduled to be released in 2005, but was delayed numerous times and was ultimately released in June 2015. It became the first film to gross over $500 million worldwide in its opening weekend, and grossed over $1.6 billion through the course of its theatrical run, making it the sixth highest-grossing film of all time. It was also the second highest-grossing film of 2015. When adjusted for monetary inflation, Jurassic World is the second highest-grossing film in the franchise after Jurassic Park. Since the film's release, the franchise has continued to use the Jurassic World name.\nA fifth film, Jurassic World: Fallen Kingdom, was released in June 2018. The film grossed over $1.3 billion worldwide, making it the third Jurassic film to pass the billion dollar mark. It is the third highest-grossing film of 2018 and the 13th highest-grossing film of all time. A sixth film, tentatively titled Jurassic World 3, is scheduled to be released on June 11, 2021. Lego has produced several animated projects based on the Jurassic World films, including a miniseries scheduled for release in 2019. Netflix and DreamWorks Animation also plan to release an animated Jurassic World series in 2020.", "developer": ["Ocean Software"], "genre": "Action", "date_release": "1993-10-01"}, "Jurassic Park III: Danger Zone!": {"description": "Jurassic Park III: Danger Zone! is a 2001 video game developed and published by Knowledge Adventure for Microsoft Windows. It is based on the 2001 film Jurassic Park III. Gameplay consists of the player(s) going around on a virtual board game map. Knowledge Adventure also concurrently developed and published Jurassic Park III: Dino Defender. Certain aspects of Dino Defender were re-used for Danger Zone!.", "developer": ["Knowledge Adventure"], "genre": "Action", "date_release": "2001-06-29"}, "Jurassic Park III: Dino Defender": {"description": "Jurassic Park III: Dino Defender is a 2001 side-scrolling video game developed and published by Knowledge Adventure. It is based on the 2001 film Jurassic Park III. The player is depicted as a person in a bio-mechanical suit hired by Jurassic Park to bring power back to the electrified fences and capture all the free-roaming dinosaurs.\nA modified version of the game's first level, as well as some of the game's animation and audio, was re-used for another video game titled Jurassic Park III: Danger Zone!, also developed and published by Knowledge Adventure.", "developer": ["Knowledge Adventure"], "genre": "Side-scrolling", "date_release": "2001-06-29"}, "Jurassic Park: The Game": {"composer": "Jared Emerson-Johnson", "description": "Jurassic Park: The Game is an episodic graphic adventure video game based on the 1993 film Jurassic Park and released for the PlayStation 3, Macintosh, Microsoft Windows, and Xbox 360. The game was developed and published by Telltale Games as part of a licensing deal with Universal Partnerships & Licensing.\nThe game is set on the fictional island of Isla Nublar, the location of a dinosaur theme park known as Jurassic Park. The game's plot centers on the retrieval of a canister of dinosaur embryos, lost during the events of the film. The game was announced in June 2010, and was initially scheduled for release in April 2011, but was delayed until November. According to Metacritic, the game received \"Mixed or average reviews.\"", "developer": ["Telltale Games"], "genre": "Graphic adventure", "date_release": "2011-11-15"}, "Just Cause": {"producer": "Fredrik Sjöö", "composer": "Rob Lord", "description": "Just cause is a common standard in United States labor law arbitration that is used in labor union contracts in the United States as a form of job security.", "developer": ["Avalanche Studios"], "genre": "Open world", "date_release": "2006-09-22"}, "Just Cause 2": {"producer": "Daniel Willför", "composer": "Mats Lundgren", "description": "Just Cause 2 is a 2010 open world action-adventure video game developed by  Avalanche Studios, published by Eidos Interactive and distributed by Square Enix for Microsoft Windows, PlayStation 3 and Xbox 360. The sequel to 2006's Just Cause, it was powered by Avalanche Studios' Avalanche 2.0 Engine. It features Rico Rodriguez, a major operative of the fictional Agency who arrives at Panau (a fictional dystopian island nation in Maritime Southeast Asia) to overthrow dictator Pandak \"Baby\" Panay and confront former mentor Tom Sheldon. The gameplay involves Rico fighting hostile militants with guns and a grappling hook, enabling players to tether objects to each other and slingshot into the air with a parachute. Just Cause 2 introduces the Chaos System, in which players must complete missions and destroy government property on Panau for Chaos points. These points are essential for story progression.\nThe game was developed as an improvement of Just Cause; its team saw missed opportunities in the first game, analyzing and refining it. As a result, mission design, artificial intelligence and most core gameplay mechanics were overhauled. Panau, inspired by Malaysia, was considered by the team a good location for an action game. Avalanche Studios worked with Square Enix London Studios while developing Just Cause 2. It was announced in 2007 with a demo attracting two million players.\nJust Cause 2 received generally positive reviews from critics, who praised its gameplay, open-ended nature, stunts, world design, and graphics while criticizing its story, gunplay, and mission design. Sales of six million copies worldwide exceeded original projections. The game was supported with downloadable content at release, and a multiplayer fan project was eventually approved as an add-on. A sequel, Just Cause 3, was released in late 2015.", "developer": ["Avalanche Studios"], "genre": "Open world", "date_release": "2010-03-23"}, "Just Cause 3": {"producer": [null, null], "composer": "Henry Jackman", "description": "Just Cause 3 is an open world action-adventure video game developed by Avalanche Studios and published by Square Enix. Announced on November 11, 2014, it is the third game in the Just Cause series and the sequel to 2010's Just Cause 2. It was released worldwide on December 1, 2015, for Microsoft Windows, PlayStation 4 and Xbox One.\nSet six years after its predecessor, Just Cause 3 follows series protagonist Rico Rodriguez as he returns to his homeland of Medici, a fictional Mediterranean island country under the control of dictator General Sebastiano Di Ravello. The game is played from a third-person perspective and allows players to explore the island of Medici in an open world environment.\nJust Cause 3 received mixed reviews; critics praised its open-ended gameplay, destruction mechanics and emphasis on player agency, while criticism was directed at its narrative, which some considered clichéd and uninspired, and performance issues, particularly on the console versions of the game.\nA sequel, Just Cause 4, was released on December 4, 2018.", "developer": ["Avalanche Studios"], "genre": "Open world", "date_release": "2015-12-01"}, "Just Cause 4": {"composer": null, "description": "Just Cause 4 is an action-adventure game developed by Avalanche Studios and published by Square Enix. It is the fourth game in the Just Cause series and the sequel to 2015's Just Cause 3 and was released for Microsoft Windows, PlayStation 4, and Xbox One on December 4, 2018.", "developer": ["Avalanche Studios"], "genre": "Open world", "date_release": "2018-12-04"}}