{"A-10 Cuba!": {"composer": "Paul Morton", "description": "A-10 Cuba! is a flight simulator computer game developed by Parsoft Interactive and published by Activision in 1996 for Windows and Mac. The game was a sequel to the Mac-exclusive A-10 Attack!. A third game in the series, titled A-10 Gulf!, was slated for release in 1997 but later cancelled.", "developer": ["Parsoft Interactive"], "genre": "Flight simulator", "date_release": "1996-11-30"}, "A Girls Fabric Face": {"description": "This is an index of Microsoft Windows games.\nThis list has been split into multiple pages.  Please use the Table of Contents to browse it.\n\n", "genre": "Adventure", "date_release": "2017-03-10"}, "A Hat in Time": {"producer": "Simon Roth", "composer": "Pascal Michael Stiefel", "description": "A Hat in Time is a platform action-adventure video game developed by Gears for Breakfast and published by Humble Bundle. The game was developed using Unreal Engine 3 and funded through a Kickstarter campaign, which doubled its fundraising goals within its first two days.  It is inspired by earlier 3D platformers such as Super Mario 64, Banjo-Kazooie, Spyro the Dragon and Psychonauts. The game was self-published for Microsoft Windows and macOS in October 2017, and by Humble Bundle for the PlayStation 4 and Xbox One consoles two months later. Bundled with the Seal the Deal DLC pack, a Nintendo Switch port will be released on October 18th, 2019, with the physical retail release of the Switch port releasing November 8th, 2019.", "genre": "Platform", "date_release": "2017-10-05"}, "A Game of Thrones: Genesis": {"description": "A Game of Thrones: Genesis is a strategy video game developed by Cyanide and published by Focus Home Interactive released exclusively for Microsoft Windows on September 28, 2011 in North America (only on Steam), September 29, 2011 in Europe and October 13, 2011 in Australia.\nThe game is an adaptation of the A Song of Ice and Fire book series by George R. R. Martin and is the first such video game adaptation. The game takes place over 1,000 years of the fictional history of Westeros, beginning with the arrival of the Rhoynar led by the warrior-queen Nymeria.", "developer": ["Cyanide"], "genre": "Strategy", "date_release": "2011-09-28"}, "ABC Sports Indy Racing": {"description": "ABC Sports Indy Racing is a racing computer game made in 1997. It was officially licensed by the Indy Racing League.", "genre": "Racing", "date_release": "1997-01-01"}, "Abomination: The Nemesis Project": {"composer": "Allister Brimble", "description": "Abomination: The Nemesis Project is a real-time tactics/action computer game released in 1999. In the game, the player leads a team of eight genetically altered supersoldiers (marines) to defeat an infestation of a global genetic plague which slowly turns into a superorganism.\nAbomination was met with mixed to negative reception, with the game's A.I. being the most primary of grievances.", "developer": ["Hothouse Creations"], "genre": "Action", "date_release": "1999-01-01"}, "Ace Lightning": {"description": "Ace Lightning is a British/Canadian children's television series co-produced by the BBC and Alliance Atlantis, which originally broadcast in the United Kingdom but was also aired in other countries including the United States, Australia, New Zealand and South Africa. The show was filmed in Canada, but the program was set in America. It ran for two seasons, and spawned a number of merchandising products.\nThe programme featured live actors interacting with computer animated characters from a fictional video game. The series is significant in that until its creation, live action and CGI had not been attempted to such a huge and constant degree within a weekly television serial.", "genre": "Action-adventure", "date_release": "2002-10-25"}, "Ace of Spades": {"description": "The Ace of Spades (also known as the Spadille and Death Card ) is traditionally the highest and most valued card in the deck of playing cards in English-speaking countries. The actual value of the card varies from game to game.", "developer": ["Jagex"], "genre": "FPS", "date_release": "2012-12-12"}, "Ace Online": {"description": "Ace Online or AirRivals is a free-to-play massively multiplayer online game (MMOG) 3D shooter developed by MasangSoft Inc. and owned by YD Online Corp.", "genre": "MMO", "date_release": "2006-05-26"}, "Ace Ventura: The CD-Rom Game": {"description": "Ace Ventura: The CD-Rom Game is an adventure game released for the PC on October 31, 1996, by 7th Level. The game is based on the animated series Ace Ventura: Pet Detective.", "developer": ["7th Level"], "genre": "Graphic Adventure", "date_release": "1996-10-31"}, "Aces of the Galaxy": {"description": "Aces of the Galaxy is a downloadable rail shooter, developed by Artech Digital Entertainment and published by Sierra Online for the Xbox Live Arcade. The game was released on June 4, 2008. The Windows version is available on Steam.", "developer": ["Artech Digital Entertainment"], "genre": "Rail shooter", "date_release": "2008-06-04"}, "Aces of the Pacific": {"description": "Aces of the Pacific is a combat flight simulator game developed by Dynamix and published by Sierra On-Line in 1992. The game takes place during World War II. Player can choose single or instant mission, or choose to take a career path in United States Army Air Forces, United States Navy, United States Marines, Imperial Japanese Army or Imperial Japanese Navy. Its success caused Dynamix to create a very similar follow-up Aces Over Europe in 1993.", "developer": ["Dynamix"], "genre": "Combat flight simulator", "date_release": "1992-11-08"}, "Achtung Spitfire!": {"composer": "Charles Moylan", "description": "Achtung Spitfire! is a strategy computer game released by Avalon Hill in 1997. It is a turn-based air combat game taking place during the early half of World War II, including fixed-wing aircraft, air battles and operations by Luftwaffe, Royal Air Force and French Air Force in 1939–1943.\nAchtung Spitfire! is a prequel to the 1996 video game Over the Reich, which takes place during the latter half of the war. Another game in the series, Third Reich PC, was also released in 1996. Rather than being designed for serious flight simulation experts, Achtung Spitfire! is catered around the interests of all World War II hobbyists.", "genre": "Strategy", "date_release": "1997-08-31"}, "Act of War: Direct Action": {"description": "Act of War: Direct Action is a real-time strategy game developed by Eugen Systems and published by Atari, Inc. The game was released in March 2005 and features a detailed story written by Dale Brown, a retired captain of the US Air Force and a bestselling author. An expansion pack called Act of War: High Treason was released on March 2006 in Europe and Australia. The original game and expansion were later released as Act of War: Gold Edition, on 28 September 2007 in Europe. In September 2015 Eugen Systems released Act of Aggression which is considered a spiritual successor to Act of War.", "developer": ["Eugen Systems"], "genre": "Real-time Strategy (RTS)", "date_release": "2005-03-15"}, "Act of War: High Treason": {"description": "Act of War: High Treason (abbreviated as AOW:HT) is an expansion pack for Act of War: Direct Action. It was developed by Eugen Systems and published by Atari. It was released in Europe on March 24, 2006 and in North America on May 30, 2006.", "developer": ["Eugen Systems"], "genre": "Real-time Strategy (RTS)", "date_release": "2006-03-24"}, "Action Quake 2": {"description": "Action Quake 2 is a mod for the video game Quake II created by The A-Team. Action Quake 2 was developed to recreate the look and feel of an action movie, having a fast pace and a semi-realistic damage system. It features many maps recreating realistic settings, such as city streets and office buildings, with a balanced range of weapons and equipment inspired by action movies.\nAction Quake 2 is essentially a version of deathmatch and team deathmatch in which most of the classic elements have been modified to some degree. Damage to extremities such as a shot to the leg with any weapon will cause damage and bleeding, along with crippling the player's movement until they bandage themselves.  Originally released in 1998, there was still an active community of players as of 2015.", "genre": "First-person shooter", "date_release": "1998-11-12"}, "Activision Anthology": {"description": "Activision Anthology is a compilation of most of the Atari 2600 games by Activision for various game systems. It also includes games that were originally released by Absolute Entertainment and Imagic, as well as various homebrew games. The Microsoft Windows and Mac OS X versions are titled Activision Anthology: Remix Edition, and include the most games. The PlayStation Portable version is titled Activision Hits Remixed.\nThe game features the original gameplay of the Atari 2600 emulated on modern systems. After achieving high scores in some of the games, the player can unlock special modes where the colors are distorted, or the game is projected on a rotating cube as added difficulty.\nActivision Anthology features a virtual kid's bedroom as the main menu. The player can select several viewpoints to check highscores, choose a video game cartridge from a rotating stand, change the background music on a virtual tape deck, or change game settings while being zoomed in on a virtual Atari 2600. The virtual tape deck features several licensed 1980s music tracks. The music from the virtual tape deck can be mixed with the Atari 2600 game audio so both are audible to simulate playing the game on TV while having the tape running in the background.\nSix Activision-produced Atari 2600 titles were not included in Activision Anthology, likely due to outside ownership of their respective licenses. The excluded games are Commando, Double Dragon, Ghostbusters, Ghostbusters II, Kung Fu Master, and Rampage, although Capcom did give Activision rights to put Commando in the PlayStation 2, Windows, and Mac OS X versions of Activision Anthology. Ghostbusters II was cancelled before Activision could release it, but Salu released it in Europe under their name in 1992. The Absolute Entertainment title Pete Rose Baseball was renamed Baseball, presumably due to licensing rights regarding Pete Rose's name, as well.", "developer": ["MumboJumbo", "MacPlay"], "genre": "Compilation", "date_release": "2002-11-19"}, "Actua Ice Hockey": {"description": "Actua Sports is a sports video game series published by Gremlin Interactive which competed with Electronic Arts EA Sports label during the second half of the 1990s, until Gremlin was acquired by Infogrames. The term \"Actua\" is a (seemingly marketing-related) play on Sega's line of \"Virtua\" titled games, which included Virtua Fighter, Virtua Racing and Virtua Striker.The first game in the series was the 1995 milestone title, Actua Soccer, which quickly became one of the most important titles for the company. It was later joined by the rebirth of the Premier Manager franchise and the club version of Actua Soccer. In 1996, the first non-football game was released, Actua Golf, followed by the sequels Actua Soccer 2 in 1997, now endorsed by English international Alan Shearer and Premier Manager 98. The third installment in the Actua Soccer series and the Ninety-Nine edition of Premier Manager followed in 1998, the year a new title debuted in the series: Actua Ice Hockey, the official video game of the Nagano Olympic Games ice hockey tournament, followed by Actua Tennis in the same year.\nWhile the series died shortly after Gremlin was acquired by Infogrames, some of the games had further titles developed: PGA European Tour Golf and UEFA Challenge, both developed by the now Sheffield House, were published in 1999 and 2002 respectively, and the rights of the Premier Manager franchise were acquired by Zoo Digital Publishing.", "developer": ["Gremlin Interactive"], "genre": "Sports", "date_release": "1998-01-01"}, "Actua Pool": {"description": "Actua Pool is a sports simulation video game developed by British company Gremlin Interactive as part of their highly successful Actua Sports series of sport simulators of the mid-to-late 1990s. Actua Pool, a pool (pocket billiards) was originally released on the Microsoft Windows platform and the Sony PlayStation home console in 1999; these versions were also published under the name Pool Shark. The game was very well received, praised for its realistic physics engine and challenging AI opponents, although the game spawned a sequel which was not as successful. In 2007, Actua Pool was ported to the Nintendo DS handheld game console.\nThe game was published in North America by THQ as Ultimate 8 Ball.", "developer": ["Gremlin Interactive"], "genre": "Sports", "date_release": "1999-01-01"}, "Addiction Pinball": {"description": "Addiction Pinball is a pinball video game developed by Team17 and published by MicroProse for Microsoft Windows in 1998. It features tables based on two Team17 games, which are World Rally Fever and Worms.\nIt was ported to the PlayStation in 2000 as Worms Pinball to capitalise on the success of the Worms franchise. The PlayStation version was published by Infogrames and was only released in Europe.\nA cut-down version for the Microsoft Windows was also released in 1998, also titled Worms Pinball, and was initially included in a Worms compilation pack containing Worms and Reinforcements United and Worms 2. It was also included with the first print run of Worms Blast for Microsoft Windows in 2002, and in 2012 was released on Steam. This version does not include the World Rally Fever table.", "developer": ["Team17"], "genre": "Pinball", "date_release": "1998-04-30"}, "Advent Rising": {"composer": null, "description": "Advent Rising is an action-adventure third-person shooter video game developed by GlyphX Games and published by Majesco Entertainment. The game was released on May 31, 2005 for Xbox and on August 9, 2005 for Microsoft Windows. Its story was created by Donald and Geremy Mustard and featured a script written by science fiction writers Orson Scott Card and Cameron Dayton; the full orchestral soundtrack was done by Tommy Tallarico and Emmanuel Fratianni. As of September 14, 2006, Steam began offering Advent Rising for download.Much-hyped Advent Rising was the first in a planned trilogy which also saw the development of a game that would take place alongside Advent Rising, called Advent Shadow for the PSP. Despite a large advertising campaign including promotion in cinemas, the game's retail performance fell far short of expectations. By the end of 2005, Majesco had completely revised its business plan to focus towards handheld games and canceled plans for future Advent Rising games.\nA five-issue spin-off comic book series was produced and ran from October 2005 to November 2006. Plans for novel tie-ins by Orson Scott Card never came to fruition. In June 2006, Donald Mustard posted a statement on the website of his new venture, Chair Entertainment, stating that he \"would be happy to finish the Advent series if the opportunity presented itself\", but confirmed he does not currently hold the rights to do so. In 2008, Novint announced they are adding Novint Falcon support to this game and will sell it as Ascension Reborn for the Novint Falcon only.", "developer": ["GlyphX Games"], "genre": "Action-adventure", "date_release": "2005-05-31"}, "Adventure Pinball: Forgotten Island": {"description": "Adventure Pinball: Forgotten Island is a pinball video game released in 2001 by Electronic Arts for Microsoft Windows.", "developer": ["Digital Extremes"], "genre": "Pinball", "date_release": "2001-03-21"}, "Adventures of Pip": {"composer": "Jake Kaufman", "description": "Adventures of Pip is a 2D side scrolling action platform video game developed and published by independent video game developer Tic Toc Games. The game launched in June 2015 for Microsoft Windows, OS X, and Wii U and in July 2015 for iOS. Xbox One and PlayStation 4 versions were released in August 2015.", "genre": "Action", "date_release": "2015-06-04"}, "AdvertCity": {"composer": "Alexandre Caelles, Dorian Pilato", "description": "AdvertCity is a business simulation video game developed and published by VoxelStorm.  The game was released on 17 April 2015 for Microsoft Windows, Linux, OS X.  The player takes on the role of an advertising magnate in a dystopian future city with a cyberpunk aesthetic.\nThe game has had a mixed reception, gathering predominantly positive reviews from players but moderate reviews in the press. At the time of writing, the game does not yet have a Metacritic score.", "developer": ["VoxelStorm"], "genre": "Tycoon game", "date_release": "2015-04-17"}, "Africa Trail": {"description": "Africa Trail is an educational computer game developed by MECC and published by The Learning Company. The gameplay resembles that of MECC's other \"Trail\" games, in which players must prepare for a long journey, choose their traveling companions, and make it safely to their destination. In Africa Trail, players must travel across Africa via bicycle. The game includes a Multimedia Resource Tool to allow players to make their own journal and presentation of the journey.", "developer": ["MECC"], "genre": "Adventure", "date_release": "1995-01-01"}, "After...": {"description": null, "genre": "Visual novel", "date_release": "2003-06-27"}, "Afterlife": {"composer": "Peter McConnell", "description": "The afterlife (also referred to as life after death) is the belief that the essential part of an individual's identity or the stream of consciousness continues after the death of the physical body. According to various ideas about the afterlife, the essential aspect of the individual that lives on after death may be some partial element, or the entire soul or spirit, of an individual, which carries with it and may confer personal identity or, on the contrary, may not, as in Indian nirvana. Belief in an afterlife is in contrast to the belief in oblivion after death.\nIn some views, this continued existence often takes place in a spiritual realm, and in other popular views, the individual may be reborn into this world and begin the life cycle over again, likely with no memory of what they have done in the past. In this latter view, such rebirths and deaths may take place over and over again continuously until the individual gains entry to a spiritual realm or Otherworld. Major views on the afterlife derive from religion, esotericism and metaphysics.\nSome belief systems, such as those in the Abrahamic tradition, hold that the dead go to a specific plane of existence after death, as determined by God, or other divine judgment, based on their actions or beliefs during life. In contrast, in systems of reincarnation, such as those in the Indian religions, the nature of the continued existence is determined directly by the actions of the individual in the ended life, rather than through the decision of a different being.", "developer": ["LucasArts"], "genre": "God game", "date_release": "1996-01-01"}, "Agatha Christie: And Then There Were None": {"description": "Agatha Christie: And Then There Were None (also simply known as And Then There Were None) is a 2005 point-and-click adventure game developed by AWE Productions and published by The Adventure Company for Microsoft Windows.  It was the first in The Adventure Company's Agatha Christie series. The game is a detective murder-mystery; it begins with nine people, including Patrick Narracott, the playable character, who meet and journey to the fictional Shipwreck Island.  There, two additional onscreen characters are introduced, and the story then follows the events that unfold.\nAnd Then There Were None retains most of the basic plot elements of Agatha Christie's novel of the same name; the major differences are the inclusion of the playable character, Patrick Narracott, and the creation of a range of possible endings. To further the connection between the game and its source material, Christie's novel was included in the North American PC release of the game. Agatha Christie: And Then There Were None was followed by two more games, Agatha Christie: Murder on the Orient Express and Agatha Christie: Evil Under the Sun.  Since they were based on their respective novels, their plots were unrelated to this first game.\nReactions to the game were mixed, with many reviewers polarized in their opinions: some calling it a good adaptation of the novel; others, an extremely poor adventure game. Several reviews harshly criticized the game's character design and graphics as being archaic and outdated, whereas others praised aspects such as character dialogue and a captivating story.", "genre": "Adventure", "date_release": "2005-09-30"}, "Agatha Christie: Evil Under the Sun": {"description": "Agatha Christie: Evil Under the Sun is a video game by American studio AWE Productions released for the Windows and Nintendo Wii, and is the third installment of The Adventure Company's Agatha Christie series, developed by AWE Productions, based on Agatha Christie's novel Evil Under the Sun. The Windows version was released in 2007, and the Wii version one year later.Evil Under The Sun features Hercule Poirot as the protagonist, unlike the previous game in the series, Agatha Christie: Murder on the Orient Express, which had featured Poirot as a non-playable character. It also features numerous improvements and expanded gameplay elements, with a new inventory system, dialogue choices, and more environments. While players take the role of Poirot, they are actually playing as Captain Hastings playing as Poirot, in an interactive scenario designed by Poirot in order to allow his long-time friend a chance to solve the mystery in the way Poirot would.", "genre": "Adventure", "date_release": "2007-10-16"}, "Agatha Christie: Murder on the Orient Express": {"description": "Agatha Christie: Murder on the Orient Express is a 2006  adventure game developed by AWE Productions and published by The Adventure Company for Microsoft Windows. It is the second installment in The Adventure Company's Agatha Christie series. The setting is five years before the events in Agatha Christie: And Then There Were None, with a largely unrelated storyline. The plot follows an amateur sleuth, Antoinette Marceau, and her investigation of a murder with twelve possible suspects aboard the Orient Express, which has been blocked by an avalanche in the Kingdom of Yugoslavia during 1934. She is aided by famous detective Hercule Poirot.\nMurder on the Orient Express retains the main plot elements of Agatha Christie's novel of the same name. An additional ending is presented in the game which differs from the conclusion of Christie's novel. As with And Then There Were None, Christie's novel is bundled with the game. Some reviewers of Murder on the Orient Express criticized the game because of the repetitive nature of tasks the player must complete, and also complained about the inefficient and cumbersome inventory system. Others have praised it for improved graphics compared to And Then There Were None, as well as convincing voice acting and audio effects. Murder on the Orient Express is followed by Agatha Christie: Evil Under the Sun, the third installment in the Agatha Christie series.\nMurder on the Orient Express is the first game in the Agatha Christie series to feature Hercule Poirot, Christie's most popular and famous detective. David Suchet, whose portrayal of Poirot achieved fame through the popular television series Agatha Christie's Poirot, was hired to provide Poirot's voice. His performance was generally met with praise. Some have criticized the game for not allowing the player to actually control Poirot; the developers explained this choice by saying that adventure gamers who make mistakes throughout the game do not reflect the genius of Poirot, but are better represented by amateur sleuth Antoinette Marceau.", "genre": "Adventure", "date_release": "2006-11-14"}, "Age of Booty": {"description": "Age of Booty is a real-time strategy video game developed by Certain Affinity and published by Capcom for the Xbox 360, PlayStation 3, and Microsoft Windows. Set in the swashbuckling era, the game puts the players in the control of a pirate ship with the goal of looting and capturing towns for a pirate faction, while defeating the enemy ships on the way.", "developer": ["Certain Affinity"], "genre": "Real-time Strategy (RTS)", "date_release": "2009-03-05"}, "Age of Chivalry": {"description": "Age of Chivalry is a multiplayer-focused total conversion modification for the Valve Corporation's Half-Life 2 using the Source engine. Founded by Rickard Drakborn, Jeff Simmons and Scott Chipman, and developed by a group of independent developers called Team Chivalry, the mod features a medieval theme and aims to provide enjoyable close-combat battles.", "genre": "Action", "date_release": "2007-09-10"}, "Age of Conan": {"producer": "Gaute Godager", "composer": "Knut Avenstroup Haugen", "description": "Age of Conan: Unchained (formerly known as Age of Conan: Hyborian Adventures) is a fantasy-themed massively multiplayer online role-playing game (MMORPG) developed by Funcom and published by Eidos Interactive for Microsoft Windows in 2008. Age of Conan is the first installment in the planned Age of Conan series. Age of Conan takes place within the continent of the Hyborian kingdoms, a year after the events depicted in Robert E. Howard's Conan novel, The Hour of the Dragon. Hyborian Adventures' release celebrated the 76th anniversary of the Conan franchise.", "developer": ["Funcom"], "genre": "MMORPG", "date_release": "2008-05-20"}, "Age of Empires": {"composer": null, "description": "Age of Empires is a series of historical real-time strategy video games, originally developed by Ensemble Studios and published by Xbox Game Studios. The first game of the series was Age of Empires, released in 1997. Seven other games and three spin-offs have been released.\nAge of Empires focused on events in Europe, Africa and Asia, spanning from the Stone Age to the Iron Age; the expansion game explored the formation and expansion of the Roman Empire. The sequel, Age of Empires II: The Age of Kings, was set in the Middle Ages, while its expansion focused partially on the Spanish conquest of Mexico. The subsequent three games of Age of Empires III explored the early modern period, when Europe was colonizing the Americas and several Asian nations were on the decline. The newest installment, Age of Empires Online, takes a different approach as a free-to-play online game utilizing Games for Windows Live. A spin-off game, Age of Mythology, was set in the same period as the original Age of Empires, but focused on mythological elements of Greek, Egyptian, and Norse mythology. A fourth main installment in the series, Age of Empires IV, is under development.\nThe Age of Empires series has been a commercial success, selling over 20 million copies. Critics have credited part of the success of the series to its historical theme and fair play; the artificial intelligence (AI) players have fewer advantages than in many of the series' competitors.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "1997-10-15"}, "Age of Empires: The Rise of Rome": {"composer": null, "description": "Age of Empires: The Rise of Rome is an expansion pack for the real-time strategy game Age of Empires. It is based on the rise of the Roman Empire, and adds the Roman Empire and three other playable civilizations to Age of Empires.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "1998-10-31"}, "Age of Empires II: HD Edition": {"description": "Age of Empires II: HD Edition is a real-time strategy video game developed by Hidden Path Entertainment and published by Microsoft Studios. It is a HD remaster of the original game, Age of Empires II: The Age of Kings. It comes with improved graphics, widescreen support as well as new multiplayer options through Steam. It was released worldwide on April 9, 2013.", "developer": ["Hidden Path Entertainment", "Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "2013-04-09"}, "Age of Empires II: The African Kingdoms": {"description": "Age of Empires II: HD Edition is a real-time strategy video game developed by Hidden Path Entertainment and published by Microsoft Studios. It is a HD remaster of the original game, Age of Empires II: The Age of Kings. It comes with improved graphics, widescreen support as well as new multiplayer options through Steam. It was released worldwide on April 9, 2013.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "2015-04-09"}, "Age of Empires II: The Age of Kings": {"composer": "Stephen Rippy", "description": "Age of Empires II: The Age of Kings is a real-time strategy video game developed by Ensemble Studios and published by Microsoft. Released in 1999 for Microsoft Windows and Macintosh, it is the second game in the Age of Empires series. An expansion, The Conquerors, was released in 2000.\nThe Age of Kings is set in the Middle Ages and contains thirteen playable civilizations. Players aim to gather resources, which they use to build towns, create armies, and defeat their enemies. There are five historically based campaigns, which constrict the player to specialized and story-backed conditions. There are three additional single-player game modes, and multiplayer is supported. Despite using the same game engine and similar code to its predecessor, development of The Age of Kings took a year longer than expected, forcing Ensemble Studios to release Age of Empires: The Rise of Rome in 1998 instead. The design team focused on resolving significant issues in Age of Empires, but noted on release that some problems remained.\nReception of The Age of Kings was highly positive. The significant number of new features was praised, as were the gameplay improvements. The Age of Kings received \"universal acclaim\", according to video game review aggregator Metacritic. Three months after its release, two million copies of The Age of Kings had been shipped, and it topped sales charts in seven countries. The game won multiple awards and is today considered a classic of its type, having had a significant impact on future games in its genre. The original Age of Empires II and the expansion pack were later released as The Gold Edition.\nIn April 2013, Age of Empires II: HD Edition was released on the Steam digital distribution platform for Windows operating systems. The HD Edition includes the original game and the expansion The Conquerors, as well as updated graphics for high-resolution displays. Age of Empires II: Definitive Edition, is slated for November 14, 2019.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "1999-09-30"}, "Age of Empires II: The Conquerors": {"description": "Age of Empires II: The Conquerors is the expansion pack to the 1999 real-time strategy game Age of Empires II: The Age of Kings. The Conquerors is the fourth installment in the Age of Empires series by Microsoft Game Studios and Ensemble Studios. It features five new civilizations (the Aztecs, Mayans, Spanish, Koreans, and Huns), four new campaigns, eleven new units, twenty-six new technologies, new gameplay modes, new maps and different minor tweaks to the gameplay.\nA second expansion, The Forgotten, was released on Steam in November 2013, over a decade since the release of The Conquerors. In November 2015, another expansion was released, also on Steam, entitled The African Kingdoms. A third Steam expansion, entitled Rise of the Rajas, was released in December 2016.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "2000-08-24"}, "Age of Empires II: The Forgotten": {"description": "Age of Empires II: The Forgotten is the first expansion pack to the 2013 real-time strategy game Age of Empires II: HD Edition, having been released 13 years after the first expansion for the original Age of Empires II, The Conquerors. The Forgotten originated as an unofficial modification for the game known as Forgotten Empires. The expansion pack was developed by the team that created the mod with the assistance of SkyBox Labs, based in Vancouver. The Forgotten introduces five civilizations (the Italians, Indians, Slavs, Magyars, and Incas), seven campaigns, units, technologies, gameplay modes, maps, improved AI and other tweaks to gameplay. It was released on 7 November, 2013. The next expansion, The African Kingdoms was released in November 2015.", "developer": ["Skybox Labs"], "genre": "Real-time Strategy (RTS)", "date_release": "2013-11-07"}, "Age of Empires III": {"composer": "Stephen Rippy", "description": "Age of Empires III is a real-time strategy video game developed by Microsoft Corporation's Ensemble Studios and published by Microsoft Game Studios. The Mac version was ported over and developed and published by Destineer's MacSoft. The PC version was released on October 18, 2005 in North America and November 4, 2005 in Europe, while the Mac version was released on November 21, 2006 in North America and September 29, 2006 in Europe. An N-Gage version of the game developed by Glu Mobile was released on April 28, 2009. It is the third game of the Age of Empires series and the sequel to Age of Empires II: The Age of Kings.\nThe game portrays the European colonization of the Americas, between approximately 1492 and 1876 AD. There are fourteen civilizations to play within the game. Age of Empires III has made several innovations in the series, in particular with the addition of the \"Home City\", which combines real-time strategy and role-playing features. Two expansion packs have been released: the first, Age of Empires III: The WarChiefs, was released on October 17, 2006, and introduced three Native American civilizations; the second, Age of Empires III: The Asian Dynasties, was released on October 23, 2007, and included three Asian civilizations.\nAge of Empires III has sold over 2 million copies as of May 2008. As well as receiving favorable reviews, it has garnered awards, including GameSpy's \"Best RTS game of 2005\", and was one of the best-selling games of 2005. In 2007, Age of Empires III was the seventh best-selling computer game, with over 313,000 copies sold that year.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "2005-10-18"}, "Age of Empires III: The Asian Dynasties": {"description": "Age of Empires III: The Asian Dynasties is the second expansion pack for the real-time strategy video game Age of Empires III developed through a collaboration between Ensemble Studios and Big Huge Games, and published by Microsoft Game Studios. The Mac version was ported over, developed and published by Destineer's MacSoft. The game is the second expansion pack following The WarChiefs. The game introduces three new civilizations; China, Japan, and India. It also introduced minor people, campaigns, maps, and game modes.\nAge of Empires III: The Asian Dynasties for PC was released in North America on October 23, 2007. The Mac version was released on August 5, 2008. The game was generally received well by critics, mostly praising graphics, and sometimes criticizing predictable aspects of the game. It earned a 79% score on GameRankings and an 81% on Metacritic.", "developer": ["Ensemble Studios", "Big Huge Games"], "genre": "Real-time Strategy (RTS)", "date_release": "2007-11-02"}, "Age of Empires III: The WarChiefs": {"description": "Age of Empires III: The WarChiefs is the first expansion pack for the real-time strategy game Age of Empires III. It was  released on October 17, 2006 in the United States. The expansion pack was bundled with the full game of Age of Empires III, called Age of Empires III Gold Edition on October 23, 2007. The Mac version was ported over, developed and published by Destineer's MacSoft. The full game for Mac was released on June 12, 2007 in the United States. It was followed by a second expansion pack to the original game called Age of Empires III: The Asian Dynasties.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "2006-10-07"}, "Age of Mythology": {"producer": "David Rippy", "composer": null, "description": "Age of Mythology (AoM) is a real-time strategy video game developed by Ensemble Studios and published by Microsoft Game Studios. It was released on October 30, 2002 in North America and a week later in Europe.A spin-off from the Age of Empires series, Age of Mythology takes some of its inspiration from mythology and legends of the Greeks, Egyptians, and Norse, rather than from actual historical events. Many gameplay elements are similar to the Age of Empires series. Its campaign follows an Atlantean admiral, Arkantos, who is forced to travel through the lands of the game's three cultures, hunting for a cyclops who is in league with Poseidon against Atlantis.Age of Mythology was commercially successful, going platinum four months after its release after selling over one million units. In 2003, it was followed by an expansion pack, Age of Mythology: The Titans. On May 8, 2014, Age of Mythology: Extended Edition was released for Windows via Steam. This was followed by a second expansion pack, Age of Mythology: Tale of the Dragon, released on January 28, 2016.", "developer": ["Ensemble Studios"], "genre": "Real-time Strategy (RTS)", "date_release": "2002-10-30"}, "Age of Pirates: Captain Blood": {"description": "Captain Blood, formerly known as Age of Pirates: Captain Blood, is a cancelled action-adventure game based on the novels by Rafael Sabatini about the titular Captain Blood. The player will assume the role of the Captain, following his adventures in 1685 Spanish Main. This game had been rated by the PEGI rating board and was to be released by 1C.", "genre": "Action-adventure", "date_release": "2002-10-30"}, "Age of Pirates: Caribbean Tales": {"description": "Age of Pirates: Caribbean Tales, known in Russia as Corsairs III (Корсары III), is a video game developed by Akella. Due to legal issues, it does not bear the name of the developers' previous pirate games Sea Dogs or Pirates of the Caribbean. Unlike Pirates of the Caribbean, Age Of Pirates was developed with the intent of serving as a true sequel to Sea Dogs despite the name change, and chronicles the story of the children of the main character from the original. The sequel of the game was released on May 26, 2009 titled Age of Pirates 2: City of Abandoned Ships", "developer": ["Akella"], "genre": "Role-playing video game", "date_release": "2006-09-12"}, "Age of Pirates 2: City of Abandoned Ships": {"description": "Age of Pirates 2: City of Abandoned Ships (Russian: Корсары: Город потерянных кораблей, literally \"Corsairs: City of Lost Ships\") is a role-playing video game developed by Akella, which was released on May 26, 2009. It is the sequel to Sea Dogs (2000), Pirates of the Caribbean (2003), and Age of Pirates: Caribbean Tales (2006). Like Caribbean Tales, it does not boast either of the two former games' names, due to legal reasons.", "developer": ["Akella"], "genre": "Role-playing video game", "date_release": "2009-05-26"}, "Age of Wonders": {"composer": "Michiel van den Bos", "description": "Age of Wonders is a turn-based strategy video game often likened to Master of Magic. Originally titled World of Wonders, the game incorporated several role-playing video game elements that were dropped when simultaneous turns were implemented. The game was co-developed by Triumph Studios and Epic MegaGames, Dutch and American game developers respectively, and published by Gathering of Developers in 1999; it was re-released in 2010 on GOG.com and Steam.\nThe game has four sequels, Age of Wonders II: The Wizard's Throne, Age of Wonders: Shadow Magic, Age of Wonders III, and Age of Wonders: Planetfall.", "developer": ["Triumph Studios"], "genre": "Turn-based strategy", "date_release": "1999-10-31"}, "Age of Wonders II: The Wizard's Throne": {"producer": "Chris Lacey", "composer": "Mason B. Fisher", "description": "Age of Wonders II: The Wizard's Throne is a turn-based strategy video game in a fantasy setting. The sequel to Age of Wonders, it was developed by Dutch video game developer Triumph Studios.", "developer": ["Triumph Studios"], "genre": "Turn-based strategy", "date_release": "2002-06-12"}, "Age of Wonders III": {"producer": "Djurre van Dijk", "composer": "Michiel van den Bos", "description": "Age of Wonders III is a 4X turn-based strategy video game developed and published by Dutch developer Triumph Studios. It is the fourth game in the Age of Wonders series, following Age of Wonders, Age of Wonders II: The Wizard's Throne and Age of Wonders: Shadow Magic released in 1999, 2002, and 2003 respectively. It was released on March 31, 2014 through digital distribution, as well as through retail in select territories for Microsoft Windows. A port to Linux and OS X was released on April 14, 2015.\nThe game is set in a high fantasy fictional setting, where players take the role of a leader to explore the world, interacting with other races and kingdoms, both diplomatically and through warfare while progressively expanding and managing their empire. It features a new graphics engine for the series, in addition to an updated soundtrack. The gameplay has also been updated, featuring a new role-playing style leader class based system and interchangeable choices of strategy and appearances for each playable race. It also supports online and local multiple player modes and a level editor along with a new story driven single player campaign mode.", "developer": ["Triumph Studios"], "genre": "Turn-based strategy", "date_release": "2014-03-31"}, "Age of Wonders: Shadow Magic": {"producer": "Chris Lacey", "composer": "Mason B. Fisher", "description": "Age of Wonders: Shadow Magic is a turn-based strategy video game in a fantasy setting. Shadow Magic is the third incarnation of the Age of Wonders series, and is a direct sequel to Age of Wonders II: The Wizard's Throne. All three games were developed by Triumph Studios. The series is the spiritual successor to Master of Magic.", "developer": ["Triumph Studios"], "genre": "Turn-based strategy", "date_release": "2003-07-25"}, "AGEOD's American Civil War": {"description": "AGEOD's American Civil War: 1861-1865 - The Blue and the Gray is a historical operational turn-based strategy video game that places players at the head of the United States or Confederate States during the American Civil War (1861–1865).\nPlayers are military and political leaders trying to lead the troops of their nations (armies and fleets) to victory, while making political and economical/financial decisions throughout the game that affect the outcome.\nMost of the individual years of campaign between 1861 and 1865 are playable via a separate scenario. Advanced scenarios allow recreation of yearly and/or theater campaigns.\nVirtual Programming published the Mac OS X version of the game on April 8, 2011.", "developer": ["AGEOD"], "genre": "Turn-based strategy", "date_release": "2007-06-26"}, "AGON": {"description": "Agon (Classical Greek ἀγών) is an ancient Greek term for a struggle or contest. This could be a contest in athletics, in chariot or horse racing, or in music or literature at a public festival in ancient Greece. Agon is the word-forming element in 'agony', explaining the concept of agon(y) in tragedy by its fundamental characters, the protagonist and antagonist.", "developer": ["Private Moon Studios"], "genre": "Adventure", "date_release": "2003-01-01"}, "Ai Space": {"description": "Ai Space (officially stylized as ai sp@ce) is a Japanese virtual 3D massively multiplayer online social game (MMOSG) developed by several companies that formed the Ai Space Production Committee which was launched on October 15, 2008 for Windows PCs, despite an earlier announcement of a Q3 2008 release. Beta testing commenced between mid-September and mid-October 2008. Primary development was handled by Headlock, and Dwango provided the world's infrastructure and Internet service. Dwango's subsidiary Niwango tied in the Nico Nico Anime Channel from the Nico Nico Douga video sharing website which provided users the opportunity to upload gameplay sequences online. The game closed down on June 30, 2011.\nA downloadable client program enables its users to interact through motional avatars with each other and primarily with bishōjo game heroines from three visual novels: Clannad by Key under Visual Art's, Shuffle! by Navel under Omegavision, and Da Capo II by Circus. After a player creates an avatar, one of the bishōjo game heroines is selected as a personal character doll, or \"chara-doll\", to live with on one of the game's three virtual \"islands\" which are patterned on the worlds featured in the three visual novels. The islands are connected by a central Akihabara Island where players with their chara-dolls can gather for chatting and events. The first theme song for Ai Space is sung by Kotoko.", "genre": "MMOSG", "date_release": "2008-10-15"}, "Aion": {"producer": "Wonsik Woo", "composer": null, "description": "Aion (Greek: Αἰών) is a Hellenistic deity associated with time, the orb or circle encompassing the universe, and the zodiac. The \"time\" represented by Aion is unbounded, in contrast to Chronos as empirical time divided into past, present, and future. He is thus a god of the ages, associated with mystery religions concerned with the afterlife, such as the mysteries of Cybele, Dionysus, Orpheus, and Mithras. In Latin the concept of the deity may appear as Aevum or Saeculum. He is typically in the company of an earth or mother goddess such as Tellus or Cybele, as on the Parabiago plate.", "developer": ["NCsoft"], "genre": "Massively multiplayer online role-playing game", "date_release": "2008-11-25"}, "Air Assault Task Force": {"description": "Air Assault Task Force is a computer wargame developed by ProSIM Company and published by Shrapnel Games.  The lead developer was ProSIM Company founder, Pat Proctor. Other developers included Gary Bezant (The Falklands War: 1982) and Curt Pangracs (The Star and the Crescent).Air Assault Task Force is a combat simulator and includes four campaigns, set at the Joint Readiness Training Center at Fort Polk, LA, at LZ X-Ray during the Vietnam War, in the ill-fated Ranger raid in Mogadishu, Somalia (the famous \"Black Hawk Down\" incident), and Operation Anaconda during Operation Enduring Freedom in Afghanistan. The game built on the pausable real-time gameplay of ProSIM's BCT Commander and the AI and hierarchy system of Armored Task Force. In addition to a major upgrade to these earlier game systems, it also includes a graphical and GUI overhaul that makes the game's graphics better.\nIn 2007, defense contractor Boeing commissioned ProSIM to create a custom version of the game for use as a ground combat simulator, to be paired with an intelligent tutor and after-action review agent application developed by Boeing.", "developer": ["ProSIM Company"], "genre": "Wargame", "date_release": "2006-11-17"}, "Air Conflicts: Secret Wars": {"description": "Air Conflicts: Secret Wars is an arcade combat flight simulator video game set in World War I and II. It was developed by Slovak studio Games Farm and published by bitComposer Games. It was released on 30 September 2011. It is a sequel to the original 2006 Air Conflicts. It was ported to the Nintendo Switch in March 2019 as part of a collection with Air Conflicts: Pacific Carriers.", "genre": "Flight simulation", "date_release": "2011-09-30"}, "Air Conflicts: Vietnam": {"description": "Air Conflicts: Vietnam is a flight simulation video game in the Air Conflicts series developed by Games Farm and published by BitComposer Entertainment. The game was released on November 26, 2013 for PlayStation 3 and Xbox 360, and Microsoft Windows. An Ultimate Edition of the game was released for PlayStation 4 on June 27, 2014. The player must take down the enemy pilots in order to win each level.", "genre": "Flight simulation", "date_release": "2013-11-26"}, "Airscape: The Fall of Gravity": {"description": "Airscape: The Fall of Gravity is an action platformer 2D video game, developed by Australian studio Cross-Product and published by EQ Games for Microsoft Windows.", "genre": "Platformer", "date_release": "2015-08-11"}, "Alan Wake": {"producer": "Jyri Ranki", "composer": "Petri Alanko", "description": "Alan Wake is an action-adventure video game developed by Remedy Entertainment and published by Microsoft Studios, released for the Xbox 360 and Microsoft Windows. The story follows best-selling thriller novelist Alan Wake as he tries to uncover the mystery behind his wife's disappearance during a vacation in the small fictional town of Bright Falls, Washington, all while experiencing events from the plot in his latest novel, which he cannot remember writing, coming to life.\nIn its pacing and structure, Alan Wake is similar to a thriller television series, with episodes that contain plot twists and cliffhangers. The game itself consists of six episodes, and the fiction is continued by two special episodes, titled \"The Signal\" and \"The Writer\", that were made available as downloadable content (DLC) within the same year of the game's release. Together, they make the first season of a possibly longer story. Additionally, a six-episode live-action web series called Bright Falls acts as a prequel to the game, and a number of related books also expand upon the Alan Wake story.\nChiefly written by Sam Lake, Alan Wake took over five years to create—an unusually long development time in the game industry. The game received positive reviews from critics, and is often praised for its visuals, sound, narrative, pacing, and atmosphere. Alan Wake was awarded the first spot in Time magazine's list of the top 10 video games of 2010. Alan Wake's American Nightmare, a full stand-alone title, was released in February 2012 on the Xbox Live Arcade service. A sequel was in development but was cancelled. However, the scrapped sequel became the foundation and inspiration of Remedy's next title, Quantum Break.", "developer": ["Remedy Entertainment"], "genre": "Survival horror", "date_release": "2010-05-14"}, "Alien Swarm": {"composer": "Mike Morasky", "description": "Alien Swarm is a freeware, multiplayer, top-down shooter video game developed by Valve Corporation. It is a remake of a mod for Unreal Tournament 2004, and it was developed by the original team, who were hired by Valve Corporation during the course of the development process.", "developer": ["Valve Corporation"], "genre": "Shoot-em-up", "date_release": "2010-07-19"}, "Alpha Prime": {"composer": "Kasny Jaroslav", "description": "Alpha Prime is a first-person shooter video game developed by Black Element Software and released in 2007. The script for the game's story was written by Ondřej Neff, and the game is built upon Black Element's proprietary Enforce 2 Engine. Alpha Prime was initially released on Steam and, as of August 30, 2011, it is also available on the cloud gaming service OnLive.", "developer": ["Black Element Software"], "genre": "FPS", "date_release": "2007-05-25"}, "Amnesia: The Dark Descent": {"composer": "Mikko Tarmia", "description": "Amnesia: The Dark Descent is a survival horror adventure video game by Frictional Games, released in 2010 for Microsoft Windows, Mac OS X and Linux operating systems, in 2016 for the PlayStation 4 platform and in 2018 for the Xbox One. The game features a protagonist named Daniel exploring a dark and foreboding castle, while trying to maintain his sanity by avoiding monsters and other terrifying obstructions. The game was critically well received, earning two awards from the Independent Games Festival and numerous positive reviews.Originally released independently via online distribution, the game has since been published in retail by 1C Company in Russia and Eastern Europe, as well as THQ in North America. A collection of five short stories set in the world of Amnesia, written by Mikael Hedberg and illustrated by the game's concept artists, was also made available. In addition, the game's soundtrack is available for purchase and a free content expansion Justine has been released, as well as many fan-made expansions and stories for its unique \"Custom Story\" gamemode. The Amnesia Collection – which contains The Dark Descent, its Amnesia: Justine expansion and the sequel, A Machine for Pigs – was released for PlayStation 4 on 22 November 2016, and for Xbox One on 28 September 2018. The same collection was released on the Nintendo Switch on 12 September 2019.(digital download only from the Nintendo eShop).", "developer": ["Frictional Games"], "genre": "Horror game", "date_release": "2010-08-08"}, "Amnesia: A Machine for Pigs": {"composer": "Jessica Curry", "description": "Amnesia: A Machine for Pigs is a survival horror video game developed by The Chinese Room and published by Frictional Games. Originally meant to be a mod by The Chinese Room, the game is an indirect sequel to Amnesia: The Dark Descent, which was both developed and produced by Frictional Games. While set in the same universe as the previous game, it features an entirely new cast of characters and time setting.The game became available to pre-order on 16 August 2013, and was released on 10 September 2013 to mixed reviews from critics. A Machine for Pigs was also released on 22 November 2016 for the PlayStation 4 as part of the Amnesia Collection, including Amnesia: The Dark Descent and its Amnesia: Justine expansion.", "developer": ["The Chinese Room"], "genre": "Horror game", "date_release": "2013-09-10"}, "Anno 1503": {"description": "Anno 1503: The New World (released as 1503 A.D.: The New World in North America) is a 2002 construction and management simulation developed by Max Design and published by Sunflowers Interactive. It's part of the Anno series, and is the direct sequel to Anno 1602, the most commercially successful German game ever by 2002. Anno 1503 revolves around building and maintaining a 16th-century colony in the New World. \nLike its predecessor, the game was a commercial hit in the German market, and became its best-selling computer title of 2002. By 2006, the game's global sales had reached 2 million units, with over 750,000 sold in German-speaking territories. It was followed by an expansion pack, Treasures, Monsters & Pirates, and a sequel: Anno 1701.", "developer": ["Max Design"], "genre": "City-building game", "date_release": "2003-03-23"}, "Anno 1602": {"description": "Anno 1602: Creation of a New World, entitled 1602 A.D. in North America, is a 1998 construction and management video game developed by Max Design and published by Sunflowers Interactive. Set in the early modern period, it requires the player to build colonies on small islands and manage resources, exploration, diplomacy and trade. The game design is noteworthy for its attempt to implement a 'progressive' artificial intelligence, meaning that the pace of the game changes in response to how quickly players act.\nAnno 1602 was a commercial blockbuster that attracted buyers outside the usual demographic of German computer games, including a significant percentage of female customers. It was the German market's best-selling computer game of 1998, and remained the region's highest seller of all time by 2003, with over 1.7 million units sold in German-speaking countries. The game was less successful in international markets, but ultimately sold above 2.7 million copies worldwide by 2004. Anno 1602 began the Anno series, which led to the sequels Anno 1503, Anno 1701, Anno 1404, Anno 2070, Anno 2205 and Anno 1800.", "developer": ["Max Design"], "genre": "City-building game", "date_release": "1998-09-24"}, "Anno 1701": {"composer": "Dynamedion", "description": "Anno 1701, also marketed as 1701 A.D., is a real-time strategy and city building video game, part of the Anno series. It is developed by Related Designs and published by Sunflowers Interactive Entertainment Software. It revolves around building and maintaining an 18th-century colony in the \"New World\". With a budget of €10 million, it was the most expensive German game ever produced by 2006.\nIt is the sequel to Anno 1602 and Anno 1503 and was followed by Anno 1404, which is known in the United States as Dawn of Discovery, Anno 2070, Anno 2205 and Anno 1800.", "developer": ["Related Designs"], "genre": "City-building game", "date_release": "2006-11-03"}, "Anno 2070": {"composer": null, "description": "Anno 2070 is a city-building and economic simulation game, with real-time strategy elements. It is the 5th game of the Anno series. It was released on 17 November 2011, and was co-developed by the German studios Related Designs and Blue Byte, and published by Ubisoft. Anno 2070 required Uplay to operate as an always online DRM System, later removed for receiving severe criticism from players.", "developer": ["Related Designs", "Blue Byte"], "genre": "City-building game", "date_release": "2011-11-17"}, "Anno 2205": {"composer": "Dynamedion", "description": "Anno 2205 is a city-building and economic simulation game, with real-time strategy elements, developed by Blue Byte and published by Ubisoft. Anno 2205 is the sixth game of the Anno series, and was released worldwide on 3 November 2015. As with Anno 2070, the game is set in the future, with players having the opportunity to set up colonies on the Moon.", "developer": ["Blue Byte"], "genre": "City-building game", "date_release": "2015-11-03"}, "Anomaly: Warzone Earth": {"composer": "Piotr Musial", "description": "Anomaly: Warzone Earth is a real-time strategy tower defense video game by 11 bit studios. The game was initially announced in late 2010, and released on April 8, 2011 for Windows and Mac OS X.", "developer": ["11 bit studios"], "genre": "Reverse Tower Defense\n", "date_release": "2011-04-08"}, "Antichamber": {"composer": "Siddhartha Barnhoorn", "description": "Antichamber is a first-person puzzle-platform game created by Australian developer Alexander \"Demruth\" Bruce. Many of the puzzles are based on phenomena that occur within impossible objects created by the game engine, such as passages that lead the player to different locations depending on which way they face, and structures that seem otherwise impossible within normal three-dimensional space. The game includes elements of psychological exploration through brief messages of advice to help the player figure out solutions to the puzzles as well as adages for real life. The game was released on Steam for Microsoft Windows on January 31, 2013, a version sold with the Humble Indie Bundle 11 in February 2014 added support for Linux and OS X.", "genre": "Puzzle platformer", "date_release": "2013-01-31"}, "Anubis II": {"description": "Anubis II (pronounced Anubis the Second; the game is not a sequel) is an action game from UK based developer Metro 3D. The Wii version was worked on by Data Design Interactive. The game was published by Conspiracy Entertainment in the United States.", "genre": "Action", "date_release": "2005-07-14"}, "ARMA: Armed Assault": {"composer": "Ondřej Matějka", "description": "ARMA: Armed Assault (stylized as ARMA; known as ARMA: Combat Operations in North America), is a tactical military first- and third-person shooter, released in 2006.\nARMA is the spiritual successor to Operation Flashpoint: Cold War Crisis and features an overhauled game engine, with improved graphics, physics, multiplayer functionality, scripting capabilities, and new units and vehicles. An expansion pack titled ARMA: Queen's Gambit was released in 2007.\nBecause of legal issues between Bohemia Interactive and Codemasters (the original publishers of Operation Flashpoint), Codemasters owns the intellectual property to the name Operation Flashpoint. Since Bohemia Interactive severed its connection with Codemasters and no longer has the legal right to use the Operation Flashpoint name, Armed Assault is considered to be the direct descendant of Operation Flashpoint. ARMA 2 (previously referred to as \"Game 2\") was released in June 2009. Codemasters has released a rival title to Bohemia Interactive using the name Operation Flashpoint: Dragon Rising, in which Bohemia Interactive has no participation.", "developer": ["Bohemia Interactive"], "genre": "Tactical shooter", "date_release": "2006-11-10"}, "ARMA 2": {"composer": "Ondřej Matějka", "description": "ARMA 2 is an open world, military simulation video game developed and published by Bohemia Interactive for Microsoft Windows. It is the sequel to ARMA: Armed Assault (ARMA: Combat Operations in North America), and the predecessor to ARMA 3. ARMA 2 saw a limited release in May 2009, and a wide release from June 2009 through July 2009. An expansion pack titled ARMA 2: Operation Arrowhead was released in 2010. In June 2011, a free version of the game was released, featuring multiplayer and limited single-player modes. It is also considered the official successor of Operation Flashpoint: Cold War Crisis (which has since been renamed to ARMA: Cold War Assault by Bohemia Interactive).The game had sold 2.3 million copies as of February 2015.", "developer": ["Bohemia Interactive"], "genre": "Tactical shooter", "date_release": "2009-06-26"}, "ARMA 3": {"producer": "Marek Španěl", "composer": null, "description": "ARMA 3 is an open-world, realism-based, military tactical shooter video game developed and published by Bohemia Interactive. It was released for Microsoft Windows in September 2013, and later announced for macOS and Linux in August 2015.ARMA 3 takes place in the mid-2030s, on the islands of Altis and Stratis in the Aegean Sea, and the South Pacific island of Tanoa. The islands feature photo-realistic terrain and water environments. Altis is the largest official terrain in the ARMA series with ground area covering approximately 270 square kilometres (100 sq mi). The smaller island, Stratis, expands over an area of 20 square kilometres (7.7 sq mi).The single-player campaign has the player take control of U.S. Army soldier Corporal Ben Kerry. During the campaign, the player will face everything from lone wolf infiltration missions to the commanding of large scale armored operations. The player will be able to choose different objectives and weaponry (such as UAVs, artillery, and air support) according to their play style.", "developer": ["Bohemia Interactive"], "genre": "Tactical shooter", "date_release": "2013-09-12"}, "Assetto Corsa": {"description": "Assetto Corsa (Italian for \"Race Setup\") is a sim racing video game developed by the Italian video game developer Kunos Simulazioni. It is designed with an emphasis on a realistic racing experience with support for extensive customization and moddability. The game was first released through the Steam Early Access program on 8 November 2013, and officially left Early Access as final release version on 19 December 2014.Publisher 505 Games in partnership with Kunos Simulazioni announced on 3 June 2015 that they would bring the game to Xbox One and PlayStation 4 in 2016 and on 20 January 2016 revealed a release date of 22 April 2016. On 24 February 2016 it was announced that the console release was delayed to 3 June 2016. 505 Games and Kunos Simulazioni announced another delay and a new release date for the console versions on 6 May 2016, the game was released on consoles on 26 and 30 August 2016 in Europe and North America respectively. A sequel, Assetto Corsa Competizione was realized in 29 May 2019.", "developer": ["Kunos Simulazioni"], "genre": "Racing", "date_release": "2013-11-08"}, "Astebreed": {"description": "Astebreed (Japanese: アスタブリード, Hepburn: Asutaburīdo) is an action shoot 'em up 3D video game, published by Playism and developed by Edelweiss, for PlayStation 4, Microsoft Windows and Nintendo Switch.", "genre": "Shoot em up", "date_release": "2014-05-31"}, "AstroFire": {"description": "AstroFire is a MS-DOS based arcade 2D video game, published by British studio ORT Software, in 1994.", "developer": ["[2]"], "genre": "Shoot em up", "date_release": "1994-01-01"}, "Attack on Titan": {"producer": "Hisashi Koinuma", "composer": null, "description": "Attack on Titan (Japanese: 進撃の巨人, Hepburn: Shingeki no Kyojin, lit. \"The Attacking Giants\") is a Japanese manga series both written and illustrated by Hajime Isayama. It is set in a fantasy world where humanity lives within territories surrounded by three enormous walls that protect them from gigantic man-eating humanoids referred to as Titans.\nThe series first began in Kodansha's Bessatsu Shōnen Magazine on September 9, 2009, and it has been collected into 28 tankōbon volumes as of April 2019. Attack on Titan has become a critical and commercial success. As of April 2019, the manga has 90 million tankōbon copies in print worldwide (80 million in Japan and 10 million outside of Japan), making it one of the best-selling manga series. It has won several awards, including the Kodansha Manga Award, Micheluzzi Awards, and Harvey Award.The anime television adaptation, produced by Wit Studio, has also been well received by critics with the first three seasons being met with critical acclaim with praise for its story, animation, music and voice acting, and has proved to be extremely successful in both Japan and the U.S., thus boosting the series' popularity. Although it also gained fame in neighboring Asian countries, political interpretations of the series caused controversies in China and South Korea.", "developer": ["Omega Force"], "genre": "Action", "date_release": "2016-02-18"}, "Attack on Titan 2": {"producer": "Hisashi Koinuma", "composer": null, "description": "Attack on Titan (Japanese: 進撃の巨人, Hepburn: Shingeki no Kyojin, lit. \"The Attacking Giants\") is a Japanese manga series both written and illustrated by Hajime Isayama. It is set in a fantasy world where humanity lives within territories surrounded by three enormous walls that protect them from gigantic man-eating humanoids referred to as Titans.\nThe series first began in Kodansha's Bessatsu Shōnen Magazine on September 9, 2009, and it has been collected into 28 tankōbon volumes as of April 2019. Attack on Titan has become a critical and commercial success. As of April 2019, the manga has 90 million tankōbon copies in print worldwide (80 million in Japan and 10 million outside of Japan), making it one of the best-selling manga series. It has won several awards, including the Kodansha Manga Award, Micheluzzi Awards, and Harvey Award.The anime television adaptation, produced by Wit Studio, has also been well received by critics with the first three seasons being met with critical acclaim with praise for its story, animation, music and voice acting, and has proved to be extremely successful in both Japan and the U.S., thus boosting the series' popularity. Although it also gained fame in neighboring Asian countries, political interpretations of the series caused controversies in China and South Korea.", "developer": ["Omega Force"], "genre": "Action", "date_release": "2018-03-15"}, "Audiosurf": {"composer": null, "description": "Audiosurf is a puzzle/rhythm hybrid game created by Invisible Handlebar, a personal company created by Dylan Fitterer. Its track-like stages visually mimic the music the player chooses, while the player races across several lanes collecting colored blocks that appear in sync with the music. The game was released on February 15, 2008 over Steam, a few days after winning the Independent Games Festival 2008 Excellence in Audio Award, heavily influenced by the hit soundtrack composed by Pedro Macedo Camacho; the full version was for a long time only available for purchase through Steam, but was later released as a retail product in Europe, by Ascaron. Audiosurf was the first third party game to use Valve's Steamworks technology. The Zune HD version was also released as Audiosurf: Tilt. The sequel, Audiosurf 2 was released with early access on October 2, 2013. The announcement was made through Dylan Fitterer's Twitter account.", "developer": ["Dylan Fitterer"], "genre": "Music", "date_release": "2008-02-15"}, "Audiosurf 2": {"description": "Audiosurf 2, previously named Audiosurf Air, is a rhythm score attack video game created by Dylan Fitterer, and the sequel to Audiosurf. It was launched on October 2, 2013 for Windows through Steam Early Access, OS X and Linux versions were released on January 9, 2015.  The game is Steam Workshop compatible, allowing players to create and share mods for the game. It came out of early access on May 26, 2015.", "developer": ["Dylan Fitterer"], "genre": "Music", "date_release": "2013-10-02"}, "Automation - The Car Company Tycoon Game": {"composer": "Michael Trott", "description": "Automation is a video game from Camshaft Software for Microsoft Windows that allows the player to create and run a virtual car company and design vehicles to sell. It is currently available via Steam.", "genre": "Business simulation", "date_release": "2015-03-12"}, "Axis Assassin": {"description": "Axis Assassin is a computer game written by John Field for the Apple II and published by Electronic Arts in 1983. Ports for the Atari 8-bit family and Commodore 64 were released alongside the Apple II original. The game is similar in concept and visuals to Atari's 1981 Tempest arcade game.\nAlong with M.U.L.E., Hard Hat Mack, Archon: The Light and the Dark, and Worms?, Axis Assassin was one of the five initial titles from Electronic Arts. Author John Field was included in the two-page \"We See Farther\" magazine ad from 1983 that positioned EA's game developers as \"rock stars.\" Field also wrote The Last Gladiator for Electronic Arts, which was published the same year as Axis Assassin.", "developer": ["Electronic Arts"], "genre": "Tube shooter", "date_release": "1983-01-01"}, "A Bastard's Tale": {"description": "A Bastard's Tale is an action 2D video game, published by Swedish studio No Pest Productions for PlayStation 4 and Microsoft Windows.", "genre": "Action", "date_release": "2015-05-26"}, "A Bird Story": {"composer": null, "description": "A Bird Story is an adventure role-playing video game developed and published by Freebird Games. It was released in November 2014 for Microsoft Windows, OS X, and Linux as a minisode connecting the previous game by Freebird Games, To the Moon, with its sequel, Finding Paradise. It received mixed reviews from critics, whose main complaints were its dullness and slow gameplay.", "developer": ["Freebird Games"], "genre": "Adventure", "date_release": "2014-11-07"}, "A Blind Legend": {"description": "A Blind Legend is an action-adventure video game. The game is published by French studio Plug In Digital, and developed by Dowino for Microsoft Windows. The game is without video/graphics, and headphones are used to play this game.", "genre": "Action", "date_release": "2016-04-07"}, "A Bloody Night": {"description": "Silent Night, Bloody Night is a 1972 American psychological slasher film directed by Theodore Gershuny and co-produced by Lloyd Kaufman. The film stars Patrick O'Neal and cult actress Mary Woronov in leading roles, with John Carradine in a supporting performance. The plot follows a series of murders that occur in a small New England town on Christmas Eve after a man inherits a family estate which was once an insane asylum.\nMany of the cast and crew members were former Warhol superstars: Mary Woronov, Ondine, Candy Darling, Kristen Steen, Tally Brown, Lewis Love, filmmaker Jack Smith and artist Susan Rothenberg. It was filmed in Oyster Bay, Long Island, New York in 1970 but was not released theatrically until 1972 under the alternate titles Night of the Dark Full Moon, and in 1981 as Death House (sometimes stylized as Deathouse).\nAlthough it is attributed to Zora Investments Associates in the credits, the film was never registered with the United States Copyright Office, and thus fell into the public domain.", "genre": "Action", "date_release": "2017-05-23"}, "A Boy and His Blob": {"producer": "Robb Alvey", "composer": "Daniel Sadowski", "description": "A Boy and His Blob is a platform-puzzle video game developed by WayForward Technologies and published by Majesco Entertainment. It is a re-imagining of the 1989 video game, A Boy and His Blob: Trouble on Blobolonia, which was originally developed by Imagineering for the NES. The game was released for the Wii in North America on October 13, 2009, and in Europe on November 6, 2009. A high-definition port of the game developed by Abstraction Games was released on Xbox One, PlayStation 4, PlayStation Vita, Microsoft Windows, OS X, and Linux on January 20, 2016. A PlayStation 3 version was made available on June 28 of the same year as a cross-purchase with the PS4 and Vita versions. Mobile ports for IOS and Android were later released worldwide on November 17, 2017 and September 26, 2017 respectively.WayForward's director Sean Velasco, a fan of the original NES title, expressed a desire to re-create and update the experience for current generation gamers, streamlining the NES title's gameplay mechanics to create a more \"forgiving\" experience.\nA Boy and His Blob's art direction has received widespread critical acclaim and praise, and was utilized by the developers, in addition to a minimalistic story, in order to create a \"heartwarming... and friendly game\" accessible to a wide audience.", "developer": ["WayForward"], "genre": "Adventure", "date_release": "2016-01-19"}, "A Butterfly in the District of Dreams": {"description": "A Butterfly in the District of Dreams (Japanese: 誰かが恋した繁花街 ～Butterfly Loved the Street～, Hepburn: Dare ka ga Koi Shita Hankagai ～Batafurai Rabudo za Sutorīto～) is a casual indie 2D visual novel, developed by Life a Little for Microsoft Windows.", "genre": "Visual Novel", "date_release": "2017-05-12"}, "A Chair in a Room: Greenwater": {"description": "A Chair in a Room: Greenwater is a virtual reality horror 3D video game, developed and published by British studio Wolf & Wood Interactive Ltd., for Microsoft Windows and PlayStation 4.", "genre": "Adventure", "date_release": "2016-04-05"}, "A City Sleeps": {"description": "A City Sleeps is a scrolling shooter video game developed by Harmonix for Microsoft Windows and Mac OS X systems on October 16, 2014.", "genre": "Action", "date_release": "2014-10-16"}, "A Date in the Park": {"description": "The United States has 61 protected areas known as national parks that are operated by the National Park Service, an agency of the Department of the Interior. National parks must be established by an act of the United States Congress. A bill creating the first national park, Yellowstone, was signed into law by President Ulysses S. Grant in 1872, followed by Mackinac National Park in 1875 (decommissioned in 1895), and then Rock Creek Park (later merged into National Capital Parks), Sequoia and Yosemite in 1890. The Organic Act of 1916 created the National Park Service \"to conserve the scenery and the natural and historic objects and wildlife therein, and to provide for the enjoyment of the same in such manner and by such means as will leave them unimpaired for the enjoyment of future generations.\" Many current national parks had been previously protected as national monuments by the president under the Antiquities Act before being upgraded by Congress. Seven national parks (including six in Alaska) are paired with a national preserve, areas with different levels of protection that are administered together but considered separate units and whose areas are not included in the figures below.\nCriteria for the selection of national parks include natural beauty, unique geological features, unusual ecosystems, and recreational opportunities (though these criteria are not always considered together). National monuments, on the other hand, are frequently chosen for their historical or archaeological significance. Fourteen national parks are designated UNESCO World Heritage Sites (WHS), while 21 national parks are designated UNESCO Biosphere Reserves (BR). Eight national parks are designated in both UNESCO programs.\nTwenty-nine states have national parks, as do the territories of American Samoa and the United States Virgin Islands. California has the most with nine, followed by Alaska with eight, Utah with five, and Colorado with four. The largest national park is Wrangell–St. Elias in Alaska: at over 8 million acres (32,375 km2), it is larger than each of the nine smallest states. The next three largest parks are also in Alaska. The smallest park is Gateway Arch National Park, Missouri, at approximately 192.83 acres (0.7804 km2). The total area protected by national parks is approximately 52.2 million acres (211,000 km2), for an average of 870 thousand acres (3,500 km2) but a median of only 229 thousand acres (930 km2).The national parks set a visitation record in 2017, with more than 84 million visitors. The most-visited national park is Great Smoky Mountains National Park in North Carolina and Tennessee, with over 11.3 million visitors in 2017, followed by Arizona's Grand Canyon National Park, with over 6.2 million. In contrast, only 11,177 people visited the remote Gates of the Arctic National Park and Preserve in Alaska in the same year.A few former national parks are no longer designated as such, or have been disbanded. Other units of the National Park Service (419 altogether) while broadly referred to as national parks within the National Park System do not hold the formal designation in their title.", "genre": "Adventure", "date_release": "2015-02-14"}, "A Day in the Woods": {"description": "A Walk in the Woods is a 2015 American biographical comedy-drama film directed by Ken Kwapis and starring Robert Redford, Nick Nolte and Emma Thompson. Based on the 1998 book/memoir of the same name by Bill Bryson, it was released on September 2, 2015, by Broad Green Pictures.\n\n", "genre": "Puzzle", "date_release": "2011-10-28"}, "A dead world's dream": {"description": "Dead Heart in a Dead World is the fourth studio album by progressive metal band Nevermore, released in October 2000. In a style comparable to a darker, heavier Queensrÿche, its songs range topics such as criticism of drug possession penalties to rejection of religion. The album also features a cover of Simon & Garfunkel's hit, \"The Sound of Silence\".  It is also notable for being Nevermore's first record utilizing seven-string guitars.\nThe album featured one single in the track \"Believe in Nothing\", which was covered by  All That Remains on their 2008 album, Overcome. It was also covered by Firewind in 2008, on the Century Media covers album \"Covering 20 Years Of Extremes.\"", "genre": "Platformer", "date_release": "2016-09-20"}, "A Demon's Game: Episode 1": {"description": "A Demon's Game: Episode 1 is an action indie 3D video game, developed and published by RP Studios, for Microsoft Windows.", "genre": "Action", "date_release": "2016-12-19"}, "A Detective's Novel": {"description": null, "genre": "Visual Novel", "date_release": "2016-07-28"}, "A dragon girl looks up at the endless sky": {"description": null, "genre": "RPG", "date_release": "2016-10-27"}, "A Druid's Duel": {"description": null, "genre": "Turn-Based Strategy", "date_release": "2015-02-25"}, "A Duel Hand Disaster: Trackher": {"description": "A Duel Hand Disaster: Trackher is an action indie 3D video game, developed and published by American game studio Ask An Enemy Studios, for Microsoft Windows.", "genre": "Shoot 'em up", "date_release": "2017-08-29"}}