{"Zombie Driver": {"description": "Zombie Driver is a vehicular combat PC video game. Set in a zombie apocalypse environment, a chemical accident/secret government project has turned the inhabitants of an entire city into shambling, aggressive opponents.  The player must undertake various missions to rescue stranded civilians, slaughter zombies and unlock/upgrade various vehicles.\nIt was later re-released as Zombie Driver HD on the Xbox 360, PlayStation 3 and Ouya game consoles and Steam, and on Xbox One as Zombie Driver: Ultimate Edition. A Nintendo Switch version was released under the title, Zombie Driver: Immortal Edition.", "genre": "Vehicular combat", "date_release": "2009-12-04"}, "ZoMGman! Battle Arena": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Co-op Battle Arena\n", "date_release": "2007-06-26"}, "ZoMGman! 2": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Co-op Battle Arena\n", "date_release": "2008-11-07"}, "Zoo Tycoon": {"description": "Zoo Tycoon is a series of business simulation video games. The worlds focus around building and running successful zoo scenarios. The series was initially developed by Blue Fang Games and published by Microsoft Studios who later in 2001-2008 went on to create two stand-alone video games and seven expansion packs for PC and Macintosh platforms. In 2013, Microsoft Studios released a new Zoo Tycoon game, developed by Frontier Developments for Xbox One and Xbox 360. An enhanced version of the Xbox game, Zoo Tycoon: Ultimate Animal Collection, was released for Windows 10 and the Xbox One on October 31, 2017.\nThe series is considered finished. Frontier Developments, whom developed the last Zoo Tycoon in 2013, created the spiritual successor to the series, named Planet Zoo, in 2019.\n\n", "developer": ["Blue Fang Games"], "genre": "Business simulation", "date_release": "2001-10-17"}, "Zoo Tycoon 2": {"description": "Zoo Tycoon 2 is a business simulation video game developed by Blue Fang Games and published by Microsoft Game Studios and MacSoft. Originally released for Windows, Zoo Tycoon 2 is also available for Windows Mobile, PDA, and Mac OS X, although expansions are not included in the Mac version. A Nintendo DS version, titled Zoo Tycoon 2 DS, was released in 2008.\nZoo Tycoon 2 features similar gameplay as its predecessor, Zoo Tycoon. The object of the game is to build and operate a zoo by creating exhibits and aquariums, keeping guests and animals happy, and maintaining employees, finances, terrain, and scenery.", "developer": ["Blue Fang Games", "MacSoft"], "genre": "Business simulation", "date_release": "2004-11-01"}, "Zoo Tycoon 2: African Adventure": {"description": "Zoo Tycoon 2 is a business simulation video game developed by Blue Fang Games and published by Microsoft Game Studios and MacSoft. Originally released for Windows, Zoo Tycoon 2 is also available for Windows Mobile, PDA, and Mac OS X, although expansions are not included in the Mac version. A Nintendo DS version, titled Zoo Tycoon 2 DS, was released in 2008.\nZoo Tycoon 2 features similar gameplay as its predecessor, Zoo Tycoon. The object of the game is to build and operate a zoo by creating exhibits and aquariums, keeping guests and animals happy, and maintaining employees, finances, terrain, and scenery.", "developer": ["Blue Fang Games"], "genre": "Business simulation", "date_release": "2006-05-01"}, "Zoo Tycoon 2: Dino Danger Pack": {"description": "Zoo Tycoon 2 is a business simulation video game developed by Blue Fang Games and published by Microsoft Game Studios and MacSoft. Originally released for Windows, Zoo Tycoon 2 is also available for Windows Mobile, PDA, and Mac OS X, although expansions are not included in the Mac version. A Nintendo DS version, titled Zoo Tycoon 2 DS, was released in 2008.\nZoo Tycoon 2 features similar gameplay as its predecessor, Zoo Tycoon. The object of the game is to build and operate a zoo by creating exhibits and aquariums, keeping guests and animals happy, and maintaining employees, finances, terrain, and scenery.", "developer": ["Blue Fang Games"], "genre": "Business simulation", "date_release": "2006-07-01"}, "Zoo Tycoon 2: Endangered Species": {"description": "Zoo Tycoon 2 is a business simulation video game developed by Blue Fang Games and published by Microsoft Game Studios and MacSoft. Originally released for Windows, Zoo Tycoon 2 is also available for Windows Mobile, PDA, and Mac OS X, although expansions are not included in the Mac version. A Nintendo DS version, titled Zoo Tycoon 2 DS, was released in 2008.\nZoo Tycoon 2 features similar gameplay as its predecessor, Zoo Tycoon. The object of the game is to build and operate a zoo by creating exhibits and aquariums, keeping guests and animals happy, and maintaining employees, finances, terrain, and scenery.", "developer": ["Blue Fang Games"], "genre": "Business simulation", "date_release": "2005-10-01"}, "Zoo Tycoon 2: Extinct Animals": {"description": "Zoo Tycoon 2: Extinct Animals is a video game expansion pack for Zoo Tycoon 2 released October 17, 2007. The expansion focuses around extinct animals, mainly dinosaurs or ice age creatures, as well as more recently extinct creatures like the dodo, thylacine and quagga.\nThis expansion pack follows the other expansion packs, Endangered Species, African Adventure and Marine Mania. Extinct Animals replaces and includes the animals and objects from the earlier Dino Danger Pack premium download. This expansion is similar to the Dinosaur Digs expansion of the first Zoo Tycoon.", "developer": ["Blue Fang Games"], "genre": "Business simulation", "date_release": "2007-10-17"}, "Zoo Tycoon 2: Marine Mania": {"description": "Zoo Tycoon 2: Marine Mania is the third expansion pack for the video game Zoo Tycoon 2. The expansion focuses around marine animals, as did the Marine Mania expansion for the first Zoo Tycoon game.", "developer": ["Blue Fang Games"], "genre": "Business simulation", "date_release": "2006-10-17"}, "Zoo Vet": {"description": "Zoo Vet and Zoo Vet: Endangered Animals are computer games designed by Legacy Interactive.  In the games, you play a vet recently hired by a zoo, and have to give the animals vet care. Each level has five different animals to care for, and some animals get treated twice. In Zoo Vet: Endangered Animals, some animals have two of the same kind instead of treating the same animal twice. Some of the missions in the original include a chimpanzee with a sore eye and a giraffe with loose stool. Some of the missions in the sequel include an eagle with a broken wing and a gorilla with high blood pressure.", "developer": ["Legacy Interactive"], "genre": "\n", "date_release": "2004-12-01"}, "Zork: Grand Inquisitor": {"description": "Zork: Grand Inquisitor is a graphic adventure game developed by Activision, released for Windows in 1997 and Macintosh in 2001. It builds upon the Zork and Enchanter series of interactive fiction video games originally released by Infocom, and sees players attempting to restore magic to Zork by solving puzzles and using spells. The game stars Erick Avari, Michael McKean, Amy D. Jacobson, Marty Ingels, Earl Boen, Jordana Capra, Dirk Benedict, and Rip Taylor. Zork: The Undiscovered Underground was written and released as a promotional prequel to the game.", "developer": ["Activision"], "genre": "Adventure", "date_release": "1997-10-31"}, "Zork Zero": {"description": "Zork Zero: The Revenge of Megaboz is an interactive fiction video game, written by Steve Meretzky over nearly 18 months and published by Infocom in 1988. Although it is the ninth and last Zork game released by Infocom before the company's closure, Zork Zero takes place before the previous eight games (Zork I, Zork II, Zork III, Enchanter, Sorcerer, Wishbringer, Spellbreaker and Beyond Zork). Unlike its predecessors, Zork Zero is a vast game, featuring a graphical interface with scene-based colors and borders, an interactive map, menus, an in-game hints system, an interactive Encyclopedia Frobozzica, and playable graphical mini-games. The graphics were created by computer artist James Shook. It is Infocom's thirty-second game.\nPrevious games by Infocom used a parser evolved from the one in Zork I, but for Zork Zero, they designed a new LALR parser from scratch. Zork Zero's parser has some innovative features. If it notices if a player is having trouble with it, it offers helpful suggestions, such as sample commands.Three of the four graphical mini-games are based on older logic puzzles. Peggleboz is a version of peg solitaire, Snarfem is Nim, and the Tower of Bozbar is Towers of Hanoi. Other puzzles based on established logic puzzle types include a river-crossing puzzle with a fox, a rooster, and a worm, and a Knights and Knaves puzzle in which violently xenophobic Veritassi and Prevaricons are truth-tellers and liars respectively, and peaceful Wishyfoo are alternators.", "developer": ["Infocom"], "genre": "interactive fiction", "date_release": "1988-10-19"}, "Zuma's Revenge!": {"description": "Zuma's Revenge! is a tile-matching puzzle video game developed and published by PopCap Games. It was released for Microsoft Windows and Mac OS X on September 15, 2009 as a sequel to the earlier Zuma, and was later ported to Windows Phone. It features high-definition graphics, new levels and 'power-ups,' several new features, as well as boss battles. On February 22, 2011, a version was introduced for Nintendo DS which features daily challenges, versus mode and achievements.", "developer": ["PopCap Games"], "genre": "Puzzle", "date_release": "2009-09-15"}, "Zup!": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 2": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 3": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 4": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 5": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 6": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 7": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! 8": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! Arena": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Action", "date_release": null}, "Zup! X": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! Zero": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "Zup! Zero 2": {"description": "The following page is an alphabetical section from the list of PC games.", "genre": "Puzzle", "date_release": null}, "ZZT": {"description": "ZZT is an action-adventure puzzle video game developed by Potomac Computer Systems and released for MS-DOS in October 1991. The game was designed by Tim Sweeney and took roughly nine months to develop, including the game's scripting language, ZZT-oop. The name was thought to be an acronym for \"Zoo of Zero Tolerance\", but Sweeney actually picked that name so it would be listed last alphabetically on the software catalog. ZZT was followed by a sequel, Super ZZT, in 1992.", "developer": ["Potomac Computer Systems"], "genre": "Action-adventure", "date_release": null}}